MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:29 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0141212                         PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                             PC v4.2.1 *
       3            ;* Date/Time created: Fri Mar 21 13:42:28 2014                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=coffabi --hll_source=on --mem_model:code=large --mem_model:data=small --o
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Bas
       9                    .dwattr $C$DW$CU, DW_AT_producer("MSP430 C/C++ Codegen PC v4.2.1 Copyright (c) 2003-2013 Texas
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\409010855\Documents\GitHub\CHARM\Embedded_Voltmeter
      12            ;*****************************************************************************
      13            ;* CINIT RECORDS                                                             *

    2442                    .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$21)
    2443                    .dwattr $C$DW$151, DW_AT_location[DW_OP_reg13]
    2444            $C$DW$152       .dwtag  DW_TAG_formal_parameter, DW_AT_name("fromlen")
    2445                    .dwattr $C$DW$152, DW_AT_TI_symbol_name("fromlen")
    2446                    .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$21)
    2447                    .dwattr $C$DW$152, DW_AT_location[DW_OP_reg14]
    2448            
    2449            ;*****************************************************************************
    2450            ;* FUNCTION NAME: SimpleLinkWaitData                                         *
    2451            ;*                                                                           *
    2452            ;*   Regs Modified     : SR,r11,r12,r13,r14,r15                              *
    2453            ;*   Regs Used         : SR,r11,r12,r13,r14,r15                              *
    2454            ;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
    2455            ;*****************************************************************************
    2456            SimpleLinkWaitData:
    2457            ;* --------------------------------------------------------------------------*
    2458            ;* r12   assigned to pBuf
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:29 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0141212                         PAGE   50

    2459            $C$DW$153       .dwtag  DW_TAG_variable, DW_AT_name("pBuf")
    2460                    .dwattr $C$DW$153, DW_AT_TI_symbol_name("pBuf")
    2461                    .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$75)
    2462                    .dwattr $C$DW$153, DW_AT_location[DW_OP_reg12]
    2463            ;* r13   assigned to from
    2464            $C$DW$154       .dwtag  DW_TAG_variable, DW_AT_name("from")
    2465                    .dwattr $C$DW$154, DW_AT_TI_symbol_name("from")
    2466                    .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$75)
    2467                    .dwattr $C$DW$154, DW_AT_location[DW_OP_reg13]
    2468            ;* r14   assigned to fromlen
    2469            $C$DW$155       .dwtag  DW_TAG_variable, DW_AT_name("fromlen")
    2470                    .dwattr $C$DW$155, DW_AT_TI_symbol_name("fromlen")
    2471                    .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$75)
    2472                    .dwattr $C$DW$155, DW_AT_location[DW_OP_reg14]
    2473                    .dwcfi  cfa_offset, 4
    2474                    .dwcfi  save_reg_to_mem, 16, -4
    2475                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    2476 000000 4392          MOV.W     #1,&tSLInformation+50 ; [] |840| 
         000002 0032!
    2477                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    2478            $C$DW$156       .dwtag  DW_TAG_TI_branch
    2479                    .dwattr $C$DW$156, DW_AT_low_pc(0x00)
    2480                    .dwattr $C$DW$156, DW_AT_name("hci_event_handler")
    2481                    .dwattr $C$DW$156, DW_AT_TI_call
    2482                    .dwattr $C$DW$156, DW_AT_TI_return
    2483 000004 0080!         MOVX.A    #hci_event_handler,PC ; [] |841| 
         000006 0000 
    2484                                                      ; [] |841| 
    2485                    .dwattr $C$DW$149, DW_AT_TI_end_file("C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltm
    2486                    .dwattr $C$DW$149, DW_AT_TI_end_line(0x34a)
    2487                    .dwattr $C$DW$149, DW_AT_TI_end_column(0x01)
    2488                    .dwendentry
    2489                    .dwendtag $C$DW$149
    2490            
    2491            ;*****************************************************************************
    2492            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    2493            ;*****************************************************************************
    2494                    .global UINT32_TO_STREAM_f
    2495                    .global STREAM_TO_UINT16_f
    2496                    .global STREAM_TO_UINT32_f
    2497                    .global hci_patch_send
    2498                    .global SpiResumeSpi
    2499                    .global tSLInformation
    2500                    .global I_LSL
    2501                    .global L_LSL
    2502                    .global memcpy
    2503            
    2504            ;******************************************************************************
    2505            ;* BUILD ATTRIBUTES                                                           *
    2506            ;******************************************************************************
    2507                    .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
    2508            
    2509            ;******************************************************************************
    2510            ;* TYPE INFORMATION                                                           *
    2511            ;******************************************************************************
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:29 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0141212                         PAGE   51

    2512            
    2513            $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2514                    .dwattr $C$DW$T$46, DW_AT_byte_size(0x3e)
    2515            $C$DW$157       .dwtag  DW_TAG_member
    2516                    .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2517                    .dwattr $C$DW$157, DW_AT_name("usRxEventOpcode")
    2518                    .dwattr $C$DW$157, DW_AT_TI_symbol_name("usRxEventOpcode")
    2519                    .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2520                    .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2521            $C$DW$158       .dwtag  DW_TAG_member
    2522                    .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2523                    .dwattr $C$DW$158, DW_AT_name("usEventOrDataReceived")
    2524                    .dwattr $C$DW$158, DW_AT_TI_symbol_name("usEventOrDataReceived")
    2525                    .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2526                    .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2527            $C$DW$159       .dwtag  DW_TAG_member
    2528                    .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    2529                    .dwattr $C$DW$159, DW_AT_name("pucReceivedData")
    2530                    .dwattr $C$DW$159, DW_AT_TI_symbol_name("pucReceivedData")
    2531                    .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2532                    .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2533            $C$DW$160       .dwtag  DW_TAG_member
    2534                    .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$21)
    2535                    .dwattr $C$DW$160, DW_AT_name("pucTxCommandBuffer")
    2536                    .dwattr $C$DW$160, DW_AT_TI_symbol_name("pucTxCommandBuffer")
    2537                    .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2538                    .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2539            $C$DW$161       .dwtag  DW_TAG_member
    2540                    .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$29)
    2541                    .dwattr $C$DW$161, DW_AT_name("sFWPatches")
    2542                    .dwattr $C$DW$161, DW_AT_TI_symbol_name("sFWPatches")
    2543                    .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2544                    .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2545            $C$DW$162       .dwtag  DW_TAG_member
    2546                    .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$30)
    2547                    .dwattr $C$DW$162, DW_AT_name("sDriverPatches")
    2548                    .dwattr $C$DW$162, DW_AT_TI_symbol_name("sDriverPatches")
    2549                    .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2550                    .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2551            $C$DW$163       .dwtag  DW_TAG_member
    2552                    .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$31)
    2553                    .dwattr $C$DW$163, DW_AT_name("sBootLoaderPatches")
    2554                    .dwattr $C$DW$163, DW_AT_TI_symbol_name("sBootLoaderPatches")
    2555                    .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2556                    .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2557            $C$DW$164       .dwtag  DW_TAG_member
    2558                    .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$35)
    2559                    .dwattr $C$DW$164, DW_AT_name("sWlanCB")
    2560                    .dwattr $C$DW$164, DW_AT_TI_symbol_name("sWlanCB")
    2561                    .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2562                    .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2563            $C$DW$165       .dwtag  DW_TAG_member
    2564                    .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$38)
    2565                    .dwattr $C$DW$165, DW_AT_name("ReadWlanInterruptPin")
    2566                    .dwattr $C$DW$165, DW_AT_TI_symbol_name("ReadWlanInterruptPin")
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:29 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0141212                         PAGE   52

    2567                    .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2568                    .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2569            $C$DW$166       .dwtag  DW_TAG_member
    2570                    .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$41)
    2571                    .dwattr $C$DW$166, DW_AT_name("WlanInterruptEnable")
    2572                    .dwattr $C$DW$166, DW_AT_TI_symbol_name("WlanInterruptEnable")
    2573                    .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2574                    .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2575            $C$DW$167       .dwtag  DW_TAG_member
    2576                    .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$42)
    2577                    .dwattr $C$DW$167, DW_AT_name("WlanInterruptDisable")
    2578                    .dwattr $C$DW$167, DW_AT_TI_symbol_name("WlanInterruptDisable")
    2579                    .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2580                    .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2581            $C$DW$168       .dwtag  DW_TAG_member
    2582                    .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$45)
    2583                    .dwattr $C$DW$168, DW_AT_name("WriteWlanPin")
    2584                    .dwattr $C$DW$168, DW_AT_TI_symbol_name("WriteWlanPin")
    2585                    .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2586                    .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2587            $C$DW$169       .dwtag  DW_TAG_member
    2588                    .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$32)
    2589                    .dwattr $C$DW$169, DW_AT_name("slTransmitDataError")
    2590                    .dwattr $C$DW$169, DW_AT_TI_symbol_name("slTransmitDataError")
    2591                    .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2592                    .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2593            $C$DW$170       .dwtag  DW_TAG_member
    2594                    .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2595                    .dwattr $C$DW$170, DW_AT_name("usNumberOfFreeBuffers")
    2596                    .dwattr $C$DW$170, DW_AT_TI_symbol_name("usNumberOfFreeBuffers")
    2597                    .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2598                    .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2599            $C$DW$171       .dwtag  DW_TAG_member
    2600                    .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2601                    .dwattr $C$DW$171, DW_AT_name("usSlBufferLength")
    2602                    .dwattr $C$DW$171, DW_AT_TI_symbol_name("usSlBufferLength")
    2603                    .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2604                    .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2605            $C$DW$172       .dwtag  DW_TAG_member
    2606                    .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2607                    .dwattr $C$DW$172, DW_AT_name("usBufferSize")
    2608                    .dwattr $C$DW$172, DW_AT_TI_symbol_name("usBufferSize")
    2609                    .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2610                    .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2611            $C$DW$173       .dwtag  DW_TAG_member
    2612                    .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2613                    .dwattr $C$DW$173, DW_AT_name("usRxDataPending")
    2614                    .dwattr $C$DW$173, DW_AT_TI_symbol_name("usRxDataPending")
    2615                    .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2616                    .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2617            $C$DW$174       .dwtag  DW_TAG_member
    2618                    .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$25)
    2619                    .dwattr $C$DW$174, DW_AT_name("NumberOfSentPackets")
    2620                    .dwattr $C$DW$174, DW_AT_TI_symbol_name("NumberOfSentPackets")
    2621                    .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:29 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0141212                         PAGE   53

    2622                    .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2623            $C$DW$175       .dwtag  DW_TAG_member
    2624                    .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$25)
    2625                    .dwattr $C$DW$175, DW_AT_name("NumberOfReleasedPackets")
    2626                    .dwattr $C$DW$175, DW_AT_TI_symbol_name("NumberOfReleasedPackets")
    2627                    .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2628                    .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2629            $C$DW$176       .dwtag  DW_TAG_member
    2630                    .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$20)
    2631                    .dwattr $C$DW$176, DW_AT_name("InformHostOnTxComplete")
    2632                    .dwattr $C$DW$176, DW_AT_TI_symbol_name("InformHostOnTxComplete")
    2633                    .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2634                    .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2635                    .dwendtag $C$DW$T$46
    2636            
    2637            $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("sSimplLinkInformation")
    2638                    .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$46)
    2639                    .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    2640            $C$DW$T$57      .dwtag  DW_TAG_volatile_type
    2641                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    2642            
    2643            $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2644                    .dwattr $C$DW$T$47, DW_AT_name("S3_1")
    2645                    .dwattr $C$DW$T$47, DW_AT_declaration
    2646                    .dwendtag $C$DW$T$47
    2647            
    2648            
    2649            $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2650                    .dwattr $C$DW$T$49, DW_AT_name("S3_3")
    2651                    .dwattr $C$DW$T$49, DW_AT_declaration
    2652                    .dwendtag $C$DW$T$49
    2653            
    2654            
    2655            $C$DW$T$50      .dwtag  DW_TAG_union_type
    2656                    .dwattr $C$DW$T$50, DW_AT_name("U3_0")
    2657                    .dwattr $C$DW$T$50, DW_AT_declaration
    2658                    .dwendtag $C$DW$T$50
    2659            
    2660            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2661                    .dwattr $C$DW$T$3, DW_AT_address_class(0x10)
    2662            $C$DW$T$63      .dwtag  DW_TAG_const_type
    2663                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$3)
    2664            
    2665            $C$DW$T$33      .dwtag  DW_TAG_subroutine_type
    2666                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2667            $C$DW$177       .dwtag  DW_TAG_formal_parameter
    2668                    .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$32)
    2669            $C$DW$178       .dwtag  DW_TAG_formal_parameter
    2670                    .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$24)
    2671            $C$DW$179       .dwtag  DW_TAG_formal_parameter
    2672                    .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$20)
    2673                    .dwendtag $C$DW$T$33
    2674            
    2675            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2676                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:29 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0141212                         PAGE   54

    2677                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    2678            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanCB")
    2679                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2680                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2681            
    2682            $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    2683                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    2684            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    2685                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    2686                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    2687            $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptDisable")
    2688                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    2689                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2690            $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptEnable")
    2691                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    2692                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2693            
    2694            $C$DW$T$43      .dwtag  DW_TAG_subroutine_type
    2695                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    2696            $C$DW$180       .dwtag  DW_TAG_formal_parameter
    2697                    .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$20)
    2698                    .dwendtag $C$DW$T$43
    2699            
    2700            $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    2701                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    2702                    .dwattr $C$DW$T$44, DW_AT_address_class(0x14)
    2703            $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("tWriteWlanPin")
    2704                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2705                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2706            $C$DW$T$59      .dwtag  DW_TAG_const_type
    2707            $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    2708                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2709                    .dwattr $C$DW$T$60, DW_AT_address_class(0x10)
    2710            $C$DW$T$4       .dwtag  DW_TAG_base_type
    2711                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2712                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    2713                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2714            $C$DW$T$5       .dwtag  DW_TAG_base_type
    2715                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2716                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2717                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2718            $C$DW$T$6       .dwtag  DW_TAG_base_type
    2719                    .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2720                    .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2721                    .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2722            $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("UINT8")
    2723                    .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    2724                    .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2725            $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    2726                    .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    2727                    .dwattr $C$DW$T$21, DW_AT_address_class(0x10)
    2728            $C$DW$T$75      .dwtag  DW_TAG_const_type
    2729                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$21)
    2730            
    2731            $C$DW$T$51      .dwtag  DW_TAG_array_type
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:29 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0141212                         PAGE   55

    2732                    .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$20)
    2733                    .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    2734                    .dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
    2735            $C$DW$181       .dwtag  DW_TAG_subrange_type
    2736                    .dwattr $C$DW$181, DW_AT_upper_bound(0x03)
    2737                    .dwendtag $C$DW$T$51
    2738            
    2739            
    2740            $C$DW$T$48      .dwtag  DW_TAG_array_type
    2741                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$6)
    2742                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    2743                    .dwattr $C$DW$T$48, DW_AT_byte_size(0x15)
    2744            $C$DW$182       .dwtag  DW_TAG_subrange_type
    2745                    .dwattr $C$DW$182, DW_AT_upper_bound(0x14)
    2746                    .dwendtag $C$DW$T$48
    2747            
    2748            $C$DW$T$7       .dwtag  DW_TAG_base_type
    2749                    .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2750                    .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2751                    .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    2752            $C$DW$T$8       .dwtag  DW_TAG_base_type
    2753                    .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2754                    .dwattr $C$DW$T$8, DW_AT_name("short")
    2755                    .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    2756            $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("INT16")
    2757                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$8)
    2758                    .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    2759            $C$DW$T$9       .dwtag  DW_TAG_base_type
    2760                    .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2761                    .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2762                    .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    2763            $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("UINT16")
    2764                    .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    2765                    .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2766            $C$DW$T$88      .dwtag  DW_TAG_const_type
    2767                    .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$19)
    2768            $C$DW$T$10      .dwtag  DW_TAG_base_type
    2769                    .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2770                    .dwattr $C$DW$T$10, DW_AT_name("int")
    2771                    .dwattr $C$DW$T$10, DW_AT_byte_size(0x02)
    2772            $C$DW$T$11      .dwtag  DW_TAG_base_type
    2773                    .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2774                    .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2775                    .dwattr $C$DW$T$11, DW_AT_byte_size(0x02)
    2776            $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    2777                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$11)
    2778                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    2779            $C$DW$T$12      .dwtag  DW_TAG_base_type
    2780                    .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2781                    .dwattr $C$DW$T$12, DW_AT_name("long")
    2782                    .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    2783            $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("INT32")
    2784                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$12)
    2785                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2786            $C$DW$T$95      .dwtag  DW_TAG_const_type
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:29 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0141212                         PAGE   56

    2787                    .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$32)
    2788            
    2789            $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    2790                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$32)
    2791                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2792            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2793                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2794                    .dwattr $C$DW$T$37, DW_AT_address_class(0x14)
    2795            $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanReadInteruptPin")
    2796                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    2797                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2798            $C$DW$T$13      .dwtag  DW_TAG_base_type
    2799                    .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2800                    .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2801                    .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    2802            $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("UINT32")
    2803                    .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    2804                    .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2805            $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    2806                    .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    2807                    .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    2808            $C$DW$T$14      .dwtag  DW_TAG_base_type
    2809                    .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    2810                    .dwattr $C$DW$T$14, DW_AT_name("long long")
    2811                    .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    2812            $C$DW$T$15      .dwtag  DW_TAG_base_type
    2813                    .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    2814                    .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    2815                    .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    2816            $C$DW$T$16      .dwtag  DW_TAG_base_type
    2817                    .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    2818                    .dwattr $C$DW$T$16, DW_AT_name("float")
    2819                    .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    2820            $C$DW$T$17      .dwtag  DW_TAG_base_type
    2821                    .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    2822                    .dwattr $C$DW$T$17, DW_AT_name("double")
    2823                    .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    2824            $C$DW$T$18      .dwtag  DW_TAG_base_type
    2825                    .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2826                    .dwattr $C$DW$T$18, DW_AT_name("long double")
    2827                    .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    2828            $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CHAR")
    2829                    .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$6)
    2830                    .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    2831            $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    2832                    .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    2833                    .dwattr $C$DW$T$24, DW_AT_address_class(0x10)
    2834            
    2835            $C$DW$T$27      .dwtag  DW_TAG_subroutine_type
    2836                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    2837                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2838            $C$DW$183       .dwtag  DW_TAG_formal_parameter
    2839                    .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$26)
    2840                    .dwendtag $C$DW$T$27
    2841            
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:29 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0141212                         PAGE   57

    2842            $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    2843                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2844                    .dwattr $C$DW$T$28, DW_AT_address_class(0x14)
    2845            $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("tBootLoaderPatches")
    2846                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    2847                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2848            $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("tDriverPatches")
    2849                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$28)
    2850                    .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2851            $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("tFWPatches")
    2852                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    2853                    .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2854            $C$DW$T$109     .dwtag  DW_TAG_const_type
    2855                    .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$24)
    2856            
    2857            $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2858                    .dwattr $C$DW$T$52, DW_AT_name("_bsd_getsockopt_return_t")
    2859                    .dwattr $C$DW$T$52, DW_AT_byte_size(0x05)
    2860            $C$DW$184       .dwtag  DW_TAG_member
    2861                    .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$51)
    2862                    .dwattr $C$DW$184, DW_AT_name("ucOptValue")
    2863                    .dwattr $C$DW$184, DW_AT_TI_symbol_name("ucOptValue")
    2864                    .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2865                    .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2866            $C$DW$185       .dwtag  DW_TAG_member
    2867                    .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$23)
    2868                    .dwattr $C$DW$185, DW_AT_name("iStatus")
    2869                    .dwattr $C$DW$185, DW_AT_TI_symbol_name("iStatus")
    2870                    .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2871                    .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2872                    .dwendtag $C$DW$T$52
    2873            
    2874            $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdGetSockOptReturnParams")
    2875                    .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$52)
    2876                    .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    2877            
    2878            $C$DW$T$53      .dwtag  DW_TAG_structure_type
    2879                    .dwattr $C$DW$T$53, DW_AT_name("_bsd_read_return_t")
    2880                    .dwattr $C$DW$T$53, DW_AT_byte_size(0x0c)
    2881            $C$DW$186       .dwtag  DW_TAG_member
    2882                    .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$32)
    2883                    .dwattr $C$DW$186, DW_AT_name("iSocketDescriptor")
    2884                    .dwattr $C$DW$186, DW_AT_TI_symbol_name("iSocketDescriptor")
    2885                    .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2886                    .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2887            $C$DW$187       .dwtag  DW_TAG_member
    2888                    .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$32)
    2889                    .dwattr $C$DW$187, DW_AT_name("iNumberOfBytes")
    2890                    .dwattr $C$DW$187, DW_AT_TI_symbol_name("iNumberOfBytes")
    2891                    .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2892                    .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2893            $C$DW$188       .dwtag  DW_TAG_member
    2894                    .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$25)
    2895                    .dwattr $C$DW$188, DW_AT_name("uiFlags")
    2896                    .dwattr $C$DW$188, DW_AT_TI_symbol_name("uiFlags")
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:29 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0141212                         PAGE   58

    2897                    .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2898                    .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2899                    .dwendtag $C$DW$T$53
    2900            
    2901            $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdReadReturnParams")
    2902                    .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$53)
    2903                    .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    2904            
    2905            $C$DW$T$54      .dwtag  DW_TAG_structure_type
    2906                    .dwattr $C$DW$T$54, DW_AT_name("_netapp_pingreport_args")
    2907                    .dwattr $C$DW$T$54, DW_AT_byte_size(0x14)
    2908            $C$DW$189       .dwtag  DW_TAG_member
    2909                    .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$25)
    2910                    .dwattr $C$DW$189, DW_AT_name("packets_sent")
    2911                    .dwattr $C$DW$189, DW_AT_TI_symbol_name("packets_sent")
    2912                    .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2913                    .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2914            $C$DW$190       .dwtag  DW_TAG_member
    2915                    .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$25)
    2916                    .dwattr $C$DW$190, DW_AT_name("packets_received")
    2917                    .dwattr $C$DW$190, DW_AT_TI_symbol_name("packets_received")
    2918                    .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2919                    .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2920            $C$DW$191       .dwtag  DW_TAG_member
    2921                    .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$25)
    2922                    .dwattr $C$DW$191, DW_AT_name("min_round_time")
    2923                    .dwattr $C$DW$191, DW_AT_TI_symbol_name("min_round_time")
    2924                    .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2925                    .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2926            $C$DW$192       .dwtag  DW_TAG_member
    2927                    .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$25)
    2928                    .dwattr $C$DW$192, DW_AT_name("max_round_time")
    2929                    .dwattr $C$DW$192, DW_AT_TI_symbol_name("max_round_time")
    2930                    .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2931                    .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2932            $C$DW$193       .dwtag  DW_TAG_member
    2933                    .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$25)
    2934                    .dwattr $C$DW$193, DW_AT_name("avg_round_time")
    2935                    .dwattr $C$DW$193, DW_AT_TI_symbol_name("avg_round_time")
    2936                    .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2937                    .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2938                    .dwendtag $C$DW$T$54
    2939            
    2940            $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("netapp_pingreport_args_t")
    2941                    .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$54)
    2942                    .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    2943                    .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2944            
    2945            ;***************************************************************
    2946            ;* DWARF CIE ENTRIES                                           *
    2947            ;***************************************************************
    2948            
    2949            $C$DW$CIE       .dwcie 16
    2950                    .dwcfi  cfa_register, 1
    2951                    .dwcfi  cfa_offset, 0
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:29 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0141212                         PAGE   59

    2952                    .dwcfi  undefined, 0
    2953                    .dwcfi  undefined, 1
    2954                    .dwcfi  undefined, 2
    2955                    .dwcfi  undefined, 3
    2956                    .dwcfi  same_value, 4
    2957                    .dwcfi  same_value, 5
    2958                    .dwcfi  same_value, 6
    2959                    .dwcfi  same_value, 7
    2960                    .dwcfi  same_value, 8
    2961                    .dwcfi  same_value, 9
    2962                    .dwcfi  same_value, 10
    2963                    .dwcfi  undefined, 11
    2964                    .dwcfi  undefined, 12
    2965                    .dwcfi  undefined, 13
    2966                    .dwcfi  undefined, 14
    2967                    .dwcfi  undefined, 15
    2968                    .dwcfi  undefined, 16
    2969                    .dwendentry
    2970            
    2971            ;***************************************************************
    2972            ;* DWARF REGISTER MAP                                          *
    2973            ;***************************************************************
    2974            
    2975            $C$DW$194       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("PC")
    2976                    .dwattr $C$DW$194, DW_AT_location[DW_OP_reg0]
    2977            $C$DW$195       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SP")
    2978                    .dwattr $C$DW$195, DW_AT_location[DW_OP_reg1]
    2979            $C$DW$196       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SR")
    2980                    .dwattr $C$DW$196, DW_AT_location[DW_OP_reg2]
    2981            $C$DW$197       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("CG")
    2982                    .dwattr $C$DW$197, DW_AT_location[DW_OP_reg3]
    2983            $C$DW$198       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r4")
    2984                    .dwattr $C$DW$198, DW_AT_location[DW_OP_reg4]
    2985            $C$DW$199       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r5")
    2986                    .dwattr $C$DW$199, DW_AT_location[DW_OP_reg5]
    2987            $C$DW$200       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r6")
    2988                    .dwattr $C$DW$200, DW_AT_location[DW_OP_reg6]
    2989            $C$DW$201       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r7")
    2990                    .dwattr $C$DW$201, DW_AT_location[DW_OP_reg7]
    2991            $C$DW$202       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r8")
    2992                    .dwattr $C$DW$202, DW_AT_location[DW_OP_reg8]
    2993            $C$DW$203       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r9")
    2994                    .dwattr $C$DW$203, DW_AT_location[DW_OP_reg9]
