MSP430 Assembler PC v4.1.9 Sat Mar 29 22:59:41 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0696811                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                             PC v4.1.9 *
       3            ;* Date/Time created: Sat Mar 29 22:59:40 2014                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=coffabi --hll_source=on --mem_model:code=large --mem_model:data=small --o
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source
       9                    .dwattr $C$DW$CU, DW_AT_producer("MSP430 C/C++ Codegen PC v4.1.9 Copyright (c) 2003-2014 Texas
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("E:\Dropbox\git\CHARM\Embedded_Voltmeter\Basic WiFi Source\Ba
      12            ;*****************************************************************************
      13            ;* CINIT RECORDS                                                             *

    3051                    .dwfde $C$DW$CIE, SimpleLinkWaitData
    3052            $C$DW$250       .dwtag  DW_TAG_formal_parameter, DW_AT_name("pBuf")
    3053                    .dwattr $C$DW$250, DW_AT_TI_symbol_name("pBuf")
    3054                    .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$21)
    3055                    .dwattr $C$DW$250, DW_AT_location[DW_OP_reg12]
    3056            $C$DW$251       .dwtag  DW_TAG_formal_parameter, DW_AT_name("from")
    3057                    .dwattr $C$DW$251, DW_AT_TI_symbol_name("from")
    3058                    .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$21)
    3059                    .dwattr $C$DW$251, DW_AT_location[DW_OP_reg13]
MSP430 Assembler PC v4.1.9 Sat Mar 29 22:59:41 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0696811                            PAGE   61

    3060            $C$DW$252       .dwtag  DW_TAG_formal_parameter, DW_AT_name("fromlen")
    3061                    .dwattr $C$DW$252, DW_AT_TI_symbol_name("fromlen")
    3062                    .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$21)
    3063                    .dwattr $C$DW$252, DW_AT_location[DW_OP_reg14]
    3064            
    3065            ;*****************************************************************************
    3066            ;* FUNCTION NAME: SimpleLinkWaitData                                         *
    3067            ;*                                                                           *
    3068            ;*   Regs Modified     : SR,r11,r12,r13,r14,r15                              *
    3069            ;*   Regs Used         : SR,r11,r12,r13,r14,r15                              *
    3070            ;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
    3071            ;*****************************************************************************
    3072            
    3073            ;******************************************************************************
    3074            ;*                                                                            *
    3075            ;* Using -g (debug) with optimization (-o4) may disable key optimizations!    *
    3076            ;*                                                                            *
    3077            ;******************************************************************************
    3078 000000       SimpleLinkWaitData:
    3079            ;* --------------------------------------------------------------------------*
    3080                    .dwcfi  cfa_offset, 4
    3081                    .dwcfi  save_reg_to_mem, 16, -4
    3082                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    3083 000000 4392          MOV.W     #1,&tSLInformation+50 ; [] |840| 
         000002 0032!
    3084                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    3085            $C$DW$253       .dwtag  DW_TAG_TI_branch
    3086                    .dwattr $C$DW$253, DW_AT_low_pc(0x00)
    3087                    .dwattr $C$DW$253, DW_AT_name("hci_event_handler")
    3088                    .dwattr $C$DW$253, DW_AT_TI_call
    3089                    .dwattr $C$DW$253, DW_AT_TI_return
    3090 000004 0080!         MOVX.A    #hci_event_handler,PC ; [] |841| 
         000006 0000 
    3091                                                      ; [] |841| 
    3092                    .dwattr $C$DW$249, DW_AT_TI_end_file("E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Sourc
    3093                    .dwattr $C$DW$249, DW_AT_TI_end_line(0x34a)
    3094                    .dwattr $C$DW$249, DW_AT_TI_end_column(0x01)
    3095                    .dwendentry
    3096                    .dwendtag $C$DW$249
    3097            
    3098            ;*****************************************************************************
    3099            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    3100            ;*****************************************************************************
    3101                    .global UINT32_TO_STREAM_f
    3102                    .global STREAM_TO_UINT16_f
    3103                    .global STREAM_TO_UINT32_f
    3104                    .global hci_patch_send
    3105                    .global SpiResumeSpi
    3106                    .global tSLInformation
    3107                    .global I_LSL
    3108                    .global L_LSL
    3109                    .global memcpy
    3110            
    3111            ;******************************************************************************
    3112            ;* BUILD ATTRIBUTES                                                           *
MSP430 Assembler PC v4.1.9 Sat Mar 29 22:59:41 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0696811                            PAGE   62

    3113            ;******************************************************************************
    3114                    .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
    3115            
    3116            ;******************************************************************************
    3117            ;* TYPE INFORMATION                                                           *
    3118            ;******************************************************************************
    3119            
    3120            $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3121                    .dwattr $C$DW$T$46, DW_AT_byte_size(0x3e)
    3122            $C$DW$254       .dwtag  DW_TAG_member
    3123                    .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    3124                    .dwattr $C$DW$254, DW_AT_name("usRxEventOpcode")
    3125                    .dwattr $C$DW$254, DW_AT_TI_symbol_name("usRxEventOpcode")
    3126                    .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3127                    .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3128            $C$DW$255       .dwtag  DW_TAG_member
    3129                    .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    3130                    .dwattr $C$DW$255, DW_AT_name("usEventOrDataReceived")
    3131                    .dwattr $C$DW$255, DW_AT_TI_symbol_name("usEventOrDataReceived")
    3132                    .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3133                    .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3134            $C$DW$256       .dwtag  DW_TAG_member
    3135                    .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$21)
    3136                    .dwattr $C$DW$256, DW_AT_name("pucReceivedData")
    3137                    .dwattr $C$DW$256, DW_AT_TI_symbol_name("pucReceivedData")
    3138                    .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3139                    .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3140            $C$DW$257       .dwtag  DW_TAG_member
    3141                    .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$21)
    3142                    .dwattr $C$DW$257, DW_AT_name("pucTxCommandBuffer")
    3143                    .dwattr $C$DW$257, DW_AT_TI_symbol_name("pucTxCommandBuffer")
    3144                    .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3145                    .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3146            $C$DW$258       .dwtag  DW_TAG_member
    3147                    .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$29)
    3148                    .dwattr $C$DW$258, DW_AT_name("sFWPatches")
    3149                    .dwattr $C$DW$258, DW_AT_TI_symbol_name("sFWPatches")
    3150                    .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3151                    .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3152            $C$DW$259       .dwtag  DW_TAG_member
    3153                    .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$30)
    3154                    .dwattr $C$DW$259, DW_AT_name("sDriverPatches")
    3155                    .dwattr $C$DW$259, DW_AT_TI_symbol_name("sDriverPatches")
    3156                    .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3157                    .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3158            $C$DW$260       .dwtag  DW_TAG_member
    3159                    .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$31)
    3160                    .dwattr $C$DW$260, DW_AT_name("sBootLoaderPatches")
    3161                    .dwattr $C$DW$260, DW_AT_TI_symbol_name("sBootLoaderPatches")
    3162                    .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3163                    .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3164            $C$DW$261       .dwtag  DW_TAG_member
    3165                    .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$35)
    3166                    .dwattr $C$DW$261, DW_AT_name("sWlanCB")
    3167                    .dwattr $C$DW$261, DW_AT_TI_symbol_name("sWlanCB")
MSP430 Assembler PC v4.1.9 Sat Mar 29 22:59:41 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0696811                            PAGE   63

    3168                    .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3169                    .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3170            $C$DW$262       .dwtag  DW_TAG_member
    3171                    .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$38)
    3172                    .dwattr $C$DW$262, DW_AT_name("ReadWlanInterruptPin")
    3173                    .dwattr $C$DW$262, DW_AT_TI_symbol_name("ReadWlanInterruptPin")
    3174                    .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3175                    .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3176            $C$DW$263       .dwtag  DW_TAG_member
    3177                    .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$41)
    3178                    .dwattr $C$DW$263, DW_AT_name("WlanInterruptEnable")
    3179                    .dwattr $C$DW$263, DW_AT_TI_symbol_name("WlanInterruptEnable")
    3180                    .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3181                    .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3182            $C$DW$264       .dwtag  DW_TAG_member
    3183                    .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$42)
    3184                    .dwattr $C$DW$264, DW_AT_name("WlanInterruptDisable")
    3185                    .dwattr $C$DW$264, DW_AT_TI_symbol_name("WlanInterruptDisable")
    3186                    .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3187                    .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3188            $C$DW$265       .dwtag  DW_TAG_member
    3189                    .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$45)
    3190                    .dwattr $C$DW$265, DW_AT_name("WriteWlanPin")
    3191                    .dwattr $C$DW$265, DW_AT_TI_symbol_name("WriteWlanPin")
    3192                    .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3193                    .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3194            $C$DW$266       .dwtag  DW_TAG_member
    3195                    .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$32)
    3196                    .dwattr $C$DW$266, DW_AT_name("slTransmitDataError")
    3197                    .dwattr $C$DW$266, DW_AT_TI_symbol_name("slTransmitDataError")
    3198                    .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3199                    .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3200            $C$DW$267       .dwtag  DW_TAG_member
    3201                    .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    3202                    .dwattr $C$DW$267, DW_AT_name("usNumberOfFreeBuffers")
    3203                    .dwattr $C$DW$267, DW_AT_TI_symbol_name("usNumberOfFreeBuffers")
    3204                    .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3205                    .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3206            $C$DW$268       .dwtag  DW_TAG_member
    3207                    .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    3208                    .dwattr $C$DW$268, DW_AT_name("usSlBufferLength")
    3209                    .dwattr $C$DW$268, DW_AT_TI_symbol_name("usSlBufferLength")
    3210                    .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3211                    .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3212            $C$DW$269       .dwtag  DW_TAG_member
    3213                    .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    3214                    .dwattr $C$DW$269, DW_AT_name("usBufferSize")
    3215                    .dwattr $C$DW$269, DW_AT_TI_symbol_name("usBufferSize")
    3216                    .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3217                    .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3218            $C$DW$270       .dwtag  DW_TAG_member
    3219                    .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    3220                    .dwattr $C$DW$270, DW_AT_name("usRxDataPending")
    3221                    .dwattr $C$DW$270, DW_AT_TI_symbol_name("usRxDataPending")
    3222                    .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
MSP430 Assembler PC v4.1.9 Sat Mar 29 22:59:41 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0696811                            PAGE   64

    3223                    .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3224            $C$DW$271       .dwtag  DW_TAG_member
    3225                    .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$25)
    3226                    .dwattr $C$DW$271, DW_AT_name("NumberOfSentPackets")
    3227                    .dwattr $C$DW$271, DW_AT_TI_symbol_name("NumberOfSentPackets")
    3228                    .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3229                    .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3230            $C$DW$272       .dwtag  DW_TAG_member
    3231                    .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$25)
    3232                    .dwattr $C$DW$272, DW_AT_name("NumberOfReleasedPackets")
    3233                    .dwattr $C$DW$272, DW_AT_TI_symbol_name("NumberOfReleasedPackets")
    3234                    .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3235                    .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3236            $C$DW$273       .dwtag  DW_TAG_member
    3237                    .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$20)
    3238                    .dwattr $C$DW$273, DW_AT_name("InformHostOnTxComplete")
    3239                    .dwattr $C$DW$273, DW_AT_TI_symbol_name("InformHostOnTxComplete")
    3240                    .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3241                    .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3242                    .dwendtag $C$DW$T$46
    3243            
    3244            $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("sSimplLinkInformation")
    3245                    .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$46)
    3246                    .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3247            $C$DW$T$57      .dwtag  DW_TAG_volatile_type
    3248                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    3249            
    3250            $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3251                    .dwattr $C$DW$T$47, DW_AT_name("S3_1")
    3252                    .dwattr $C$DW$T$47, DW_AT_declaration
    3253                    .dwendtag $C$DW$T$47
    3254            
    3255            
    3256            $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3257                    .dwattr $C$DW$T$49, DW_AT_name("S3_3")
    3258                    .dwattr $C$DW$T$49, DW_AT_declaration
    3259                    .dwendtag $C$DW$T$49
    3260            
    3261            
    3262            $C$DW$T$50      .dwtag  DW_TAG_union_type
    3263                    .dwattr $C$DW$T$50, DW_AT_name("U3_0")
    3264                    .dwattr $C$DW$T$50, DW_AT_declaration
    3265                    .dwendtag $C$DW$T$50
    3266            
    3267            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3268                    .dwattr $C$DW$T$3, DW_AT_address_class(0x10)
    3269            $C$DW$T$63      .dwtag  DW_TAG_const_type
    3270                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$3)
    3271            
    3272            $C$DW$T$33      .dwtag  DW_TAG_subroutine_type
    3273                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3274            $C$DW$274       .dwtag  DW_TAG_formal_parameter
    3275                    .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$32)
    3276            $C$DW$275       .dwtag  DW_TAG_formal_parameter
    3277                    .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$24)
MSP430 Assembler PC v4.1.9 Sat Mar 29 22:59:41 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0696811                            PAGE   65

    3278            $C$DW$276       .dwtag  DW_TAG_formal_parameter
    3279                    .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    3280                    .dwendtag $C$DW$T$33
    3281            
    3282            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3283                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    3284                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    3285            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanCB")
    3286                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    3287                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3288            
    3289            $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    3290                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3291            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3292                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    3293                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    3294            $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptDisable")
    3295                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    3296                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3297            $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptEnable")
    3298                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    3299                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3300            
    3301            $C$DW$T$43      .dwtag  DW_TAG_subroutine_type
    3302                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3303            $C$DW$277       .dwtag  DW_TAG_formal_parameter
    3304                    .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$20)
    3305                    .dwendtag $C$DW$T$43
    3306            
    3307            $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    3308                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    3309                    .dwattr $C$DW$T$44, DW_AT_address_class(0x14)
    3310            $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("tWriteWlanPin")
    3311                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    3312                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3313            $C$DW$T$59      .dwtag  DW_TAG_const_type
    3314            $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    3315                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    3316                    .dwattr $C$DW$T$60, DW_AT_address_class(0x10)
    3317            $C$DW$T$4       .dwtag  DW_TAG_base_type
    3318                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3319                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    3320                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3321            $C$DW$T$5       .dwtag  DW_TAG_base_type
    3322                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3323                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3324                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3325            $C$DW$T$6       .dwtag  DW_TAG_base_type
    3326                    .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3327                    .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3328                    .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3329            $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("UINT8")
    3330                    .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    3331                    .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    3332            $C$DW$T$21      .dwtag  DW_TAG_pointer_type
MSP430 Assembler PC v4.1.9 Sat Mar 29 22:59:41 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0696811                            PAGE   66

    3333                    .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    3334                    .dwattr $C$DW$T$21, DW_AT_address_class(0x10)
    3335            $C$DW$T$75      .dwtag  DW_TAG_const_type
    3336                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$21)
    3337            
    3338            $C$DW$T$51      .dwtag  DW_TAG_array_type
    3339                    .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$20)
    3340                    .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    3341                    .dwattr $C$DW$T$51, DW_AT_byte_size(0x04)
    3342            $C$DW$278       .dwtag  DW_TAG_subrange_type
    3343                    .dwattr $C$DW$278, DW_AT_upper_bound(0x03)
    3344                    .dwendtag $C$DW$T$51
    3345            
    3346            
    3347            $C$DW$T$48      .dwtag  DW_TAG_array_type
    3348                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$6)
    3349                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3350                    .dwattr $C$DW$T$48, DW_AT_byte_size(0x15)
    3351            $C$DW$279       .dwtag  DW_TAG_subrange_type
    3352                    .dwattr $C$DW$279, DW_AT_upper_bound(0x14)
    3353                    .dwendtag $C$DW$T$48
    3354            
    3355            $C$DW$T$7       .dwtag  DW_TAG_base_type
    3356                    .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3357                    .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3358                    .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3359            $C$DW$T$8       .dwtag  DW_TAG_base_type
    3360                    .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3361                    .dwattr $C$DW$T$8, DW_AT_name("short")
    3362                    .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3363            $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("INT16")
    3364                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$8)
    3365                    .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3366            $C$DW$T$9       .dwtag  DW_TAG_base_type
    3367                    .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3368                    .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3369                    .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3370            $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("UINT16")
    3371                    .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    3372                    .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    3373            $C$DW$T$88      .dwtag  DW_TAG_const_type
    3374                    .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$19)
    3375            $C$DW$T$10      .dwtag  DW_TAG_base_type
    3376                    .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3377                    .dwattr $C$DW$T$10, DW_AT_name("int")
    3378                    .dwattr $C$DW$T$10, DW_AT_byte_size(0x02)
    3379            $C$DW$T$11      .dwtag  DW_TAG_base_type
    3380                    .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3381                    .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3382                    .dwattr $C$DW$T$11, DW_AT_byte_size(0x02)
    3383            $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    3384                    .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$11)
    3385                    .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    3386            $C$DW$T$12      .dwtag  DW_TAG_base_type
    3387                    .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
MSP430 Assembler PC v4.1.9 Sat Mar 29 22:59:41 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0696811                            PAGE   67

    3388                    .dwattr $C$DW$T$12, DW_AT_name("long")
    3389                    .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    3390            $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("INT32")
    3391                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$12)
    3392                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    3393            $C$DW$T$95      .dwtag  DW_TAG_const_type
    3394                    .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$32)
    3395            
    3396            $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    3397                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$32)
    3398                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3399            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3400                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    3401                    .dwattr $C$DW$T$37, DW_AT_address_class(0x14)
    3402            $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanReadInteruptPin")
    3403                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    3404                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3405            $C$DW$T$13      .dwtag  DW_TAG_base_type
    3406                    .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3407                    .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3408                    .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    3409            $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("UINT32")
    3410                    .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    3411                    .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    3412            $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    3413                    .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    3414                    .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    3415            $C$DW$T$14      .dwtag  DW_TAG_base_type
    3416                    .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3417                    .dwattr $C$DW$T$14, DW_AT_name("long long")
    3418                    .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    3419            $C$DW$T$15      .dwtag  DW_TAG_base_type
    3420                    .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3421                    .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3422                    .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    3423            $C$DW$T$16      .dwtag  DW_TAG_base_type
    3424                    .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3425                    .dwattr $C$DW$T$16, DW_AT_name("float")
    3426                    .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    3427            $C$DW$T$17      .dwtag  DW_TAG_base_type
    3428                    .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    3429                    .dwattr $C$DW$T$17, DW_AT_name("double")
    3430                    .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    3431            $C$DW$T$18      .dwtag  DW_TAG_base_type
    3432                    .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    3433                    .dwattr $C$DW$T$18, DW_AT_name("long double")
    3434                    .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    3435            $C$DW$T$22      .dwtag  DW_TAG_base_type
    3436                    .dwattr $C$DW$T$22, DW_AT_encoding(DW_ATE_unsigned_char)
    3437                    .dwattr $C$DW$T$22, DW_AT_name("unsigned char")
    3438                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    3439            $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CHAR")
    3440                    .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    3441                    .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    3442            $C$DW$T$24      .dwtag  DW_TAG_pointer_type
MSP430 Assembler PC v4.1.9 Sat Mar 29 22:59:41 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0696811                            PAGE   68

    3443                    .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    3444                    .dwattr $C$DW$T$24, DW_AT_address_class(0x10)
    3445            
    3446            $C$DW$T$27      .dwtag  DW_TAG_subroutine_type
    3447                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    3448                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3449            $C$DW$280       .dwtag  DW_TAG_formal_parameter
    3450                    .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$26)
    3451                    .dwendtag $C$DW$T$27
    3452            
    3453            $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    3454                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3455                    .dwattr $C$DW$T$28, DW_AT_address_class(0x14)
    3456            $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("tBootLoaderPatches")
    3457                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    3458                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3459            $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("tDriverPatches")
    3460                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$28)
    3461                    .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3462            $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("tFWPatches")
    3463                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3464                    .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    3465            $C$DW$T$109     .dwtag  DW_TAG_const_type
    3466                    .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$24)
    3467            
    3468            $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3469                    .dwattr $C$DW$T$52, DW_AT_name("_bsd_getsockopt_return_t")
    3470                    .dwattr $C$DW$T$52, DW_AT_byte_size(0x05)
    3471            $C$DW$281       .dwtag  DW_TAG_member
    3472                    .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$51)
    3473                    .dwattr $C$DW$281, DW_AT_name("ucOptValue")
    3474                    .dwattr $C$DW$281, DW_AT_TI_symbol_name("ucOptValue")
    3475                    .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3476                    .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3477            $C$DW$282       .dwtag  DW_TAG_member
    3478                    .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$23)
    3479                    .dwattr $C$DW$282, DW_AT_name("iStatus")
    3480                    .dwattr $C$DW$282, DW_AT_TI_symbol_name("iStatus")
    3481                    .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3482                    .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3483                    .dwendtag $C$DW$T$52
    3484            
    3485            $C$DW$T$111     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdGetSockOptReturnParams")
    3486                    .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$52)
    3487                    .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    3488            
    3489            $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3490                    .dwattr $C$DW$T$53, DW_AT_name("_bsd_read_return_t")
    3491                    .dwattr $C$DW$T$53, DW_AT_byte_size(0x0c)
    3492            $C$DW$283       .dwtag  DW_TAG_member
    3493                    .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$32)
    3494                    .dwattr $C$DW$283, DW_AT_name("iSocketDescriptor")
    3495                    .dwattr $C$DW$283, DW_AT_TI_symbol_name("iSocketDescriptor")
    3496                    .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3497                    .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v4.1.9 Sat Mar 29 22:59:41 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0696811                            PAGE   69

    3498            $C$DW$284       .dwtag  DW_TAG_member
    3499                    .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$32)
    3500                    .dwattr $C$DW$284, DW_AT_name("iNumberOfBytes")
    3501                    .dwattr $C$DW$284, DW_AT_TI_symbol_name("iNumberOfBytes")
    3502                    .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3503                    .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3504            $C$DW$285       .dwtag  DW_TAG_member
    3505                    .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$25)
    3506                    .dwattr $C$DW$285, DW_AT_name("uiFlags")
    3507                    .dwattr $C$DW$285, DW_AT_TI_symbol_name("uiFlags")
    3508                    .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3509                    .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3510                    .dwendtag $C$DW$T$53
    3511            
    3512            $C$DW$T$113     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdReadReturnParams")
    3513                    .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$53)
    3514                    .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    3515            
    3516            $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3517                    .dwattr $C$DW$T$54, DW_AT_name("_netapp_pingreport_args")
    3518                    .dwattr $C$DW$T$54, DW_AT_byte_size(0x14)
    3519            $C$DW$286       .dwtag  DW_TAG_member
    3520                    .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$25)
    3521                    .dwattr $C$DW$286, DW_AT_name("packets_sent")
    3522                    .dwattr $C$DW$286, DW_AT_TI_symbol_name("packets_sent")
    3523                    .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3524                    .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3525            $C$DW$287       .dwtag  DW_TAG_member
    3526                    .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$25)
    3527                    .dwattr $C$DW$287, DW_AT_name("packets_received")
    3528                    .dwattr $C$DW$287, DW_AT_TI_symbol_name("packets_received")
    3529                    .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3530                    .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3531            $C$DW$288       .dwtag  DW_TAG_member
    3532                    .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$25)
    3533                    .dwattr $C$DW$288, DW_AT_name("min_round_time")
    3534                    .dwattr $C$DW$288, DW_AT_TI_symbol_name("min_round_time")
    3535                    .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3536                    .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3537            $C$DW$289       .dwtag  DW_TAG_member
    3538                    .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$25)
    3539                    .dwattr $C$DW$289, DW_AT_name("max_round_time")
    3540                    .dwattr $C$DW$289, DW_AT_TI_symbol_name("max_round_time")
    3541                    .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3542                    .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3543            $C$DW$290       .dwtag  DW_TAG_member
    3544                    .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$25)
    3545                    .dwattr $C$DW$290, DW_AT_name("avg_round_time")
    3546                    .dwattr $C$DW$290, DW_AT_TI_symbol_name("avg_round_time")
    3547                    .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3548                    .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3549                    .dwendtag $C$DW$T$54
    3550            
    3551            $C$DW$T$114     .dwtag  DW_TAG_typedef, DW_AT_name("netapp_pingreport_args_t")
    3552                    .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$54)
MSP430 Assembler PC v4.1.9 Sat Mar 29 22:59:41 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0696811                            PAGE   70

    3553                    .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    3554                    .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    3555            
    3556            ;***************************************************************
    3557            ;* DWARF CIE ENTRIES                                           *
    3558            ;***************************************************************
    3559            
    3560            $C$DW$CIE       .dwcie 16
    3561                    .dwcfi  cfa_register, 1
    3562                    .dwcfi  cfa_offset, 0
    3563                    .dwcfi  undefined, 0
    3564                    .dwcfi  undefined, 1
    3565                    .dwcfi  undefined, 2
    3566                    .dwcfi  undefined, 3
    3567                    .dwcfi  same_value, 4
    3568                    .dwcfi  same_value, 5
    3569                    .dwcfi  same_value, 6
    3570                    .dwcfi  same_value, 7
    3571                    .dwcfi  same_value, 8
    3572                    .dwcfi  same_value, 9
    3573                    .dwcfi  same_value, 10
    3574                    .dwcfi  undefined, 11
    3575                    .dwcfi  undefined, 12
    3576                    .dwcfi  undefined, 13
    3577                    .dwcfi  undefined, 14
    3578                    .dwcfi  undefined, 15
    3579                    .dwcfi  undefined, 16
    3580                    .dwendentry
    3581            
    3582            ;***************************************************************
    3583            ;* DWARF REGISTER MAP                                          *
    3584            ;***************************************************************
    3585            
    3586            $C$DW$291       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("PC")
    3587                    .dwattr $C$DW$291, DW_AT_location[DW_OP_reg0]
    3588            $C$DW$292       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SP")
    3589                    .dwattr $C$DW$292, DW_AT_location[DW_OP_reg1]
    3590            $C$DW$293       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SR")
    3591                    .dwattr $C$DW$293, DW_AT_location[DW_OP_reg2]
    3592            $C$DW$294       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("CG")
    3593                    .dwattr $C$DW$294, DW_AT_location[DW_OP_reg3]
    3594            $C$DW$295       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r4")
    3595                    .dwattr $C$DW$295, DW_AT_location[DW_OP_reg4]
    3596            $C$DW$296       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r5")
    3597                    .dwattr $C$DW$296, DW_AT_location[DW_OP_reg5]
    3598            $C$DW$297       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r6")
    3599                    .dwattr $C$DW$297, DW_AT_location[DW_OP_reg6]
    3600            $C$DW$298       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r7")
    3601                    .dwattr $C$DW$298, DW_AT_location[DW_OP_reg7]
    3602            $C$DW$299       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r8")
    3603                    .dwattr $C$DW$299, DW_AT_location[DW_OP_reg8]
    3604            $C$DW$300       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r9")
    3605                    .dwattr $C$DW$300, DW_AT_location[DW_OP_reg9]
