MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:32 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0527610                         PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                             PC v4.2.1 *
       3            ;* Date/Time created: Fri Mar 21 13:42:31 2014                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=coffabi --hll_source=on --mem_model:code=large --mem_model:data=small --o
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Bas
       9                    .dwattr $C$DW$CU, DW_AT_producer("MSP430 C/C++ Codegen PC v4.2.1 Copyright (c) 2003-2013 Texas
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\409010855\Documents\GitHub\CHARM\Embedded_Voltmeter
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SimpleLinkWaitEvent")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("SimpleLinkWaitEvent")

    1175            $C$DW$102       .dwtag  DW_TAG_variable, DW_AT_name("scRet")
    1176                    .dwattr $C$DW$102, DW_AT_TI_symbol_name("scRet")
    1177                    .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$60)
    1178                    .dwattr $C$DW$102, DW_AT_location[DW_OP_breg1 0]
    1179            ;* r13   assigned to ptr
    1180            $C$DW$103       .dwtag  DW_TAG_variable, DW_AT_name("ptr")
    1181                    .dwattr $C$DW$103, DW_AT_TI_symbol_name("ptr")
    1182                    .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
    1183                    .dwattr $C$DW$103, DW_AT_location[DW_OP_reg13]
    1184                    .dwcfi  cfa_offset, 4
    1185                    .dwcfi  save_reg_to_mem, 16, -4
    1186 000000 8321          SUB.W     #2,SP                 ; [] 
    1187                    .dwcfi  cfa_offset, 6
    1188                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    1189 000002 43F1          MOV.B     #-1,0(SP)             ; [] |397| 
         000004 0000 
    1190                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    1191 000006 421D          MOV.W     &tSLInformation+6,r13 ; [] |398| 
         000008 0006!
    1192                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    1193 00000a 403C          MOV.W     #8198,r12             ; [] |401| 
         00000c 2006 
    1194 00000e 434E          MOV.B     #0,r14                ; [] |401| 
    1195            $C$DW$104       .dwtag  DW_TAG_TI_branch
    1196                    .dwattr $C$DW$104, DW_AT_low_pc(0x00)
    1197                    .dwattr $C$DW$104, DW_AT_name("hci_command_send")
    1198                    .dwattr $C$DW$104, DW_AT_TI_call
    1199 000010 13B0!         CALLA     #hci_command_send     ; [] |401| 
         000012 0000 
    1200                                                      ; [] |401| 
    1201                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    1202 000014 403C          MOV.W     #8198,r12             ; [] |404| 
         000016 2006 
    1203 000018 01CD          MOVA      SP,r13                ; [] |404| 
    1204            $C$DW$105       .dwtag  DW_TAG_TI_branch
    1205                    .dwattr $C$DW$105, DW_AT_low_pc(0x00)
    1206                    .dwattr $C$DW$105, DW_AT_name("SimpleLinkWaitEvent")
    1207                    .dwattr $C$DW$105, DW_AT_TI_call
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:32 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0527610                         PAGE   25

    1208 00001a 13B0!         CALLA     #SimpleLinkWaitEvent  ; [] |404| 
         00001c 0000 
    1209                                                      ; [] |404| 
    1210                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    1211 00001e 416C          MOV.B     0(SP),r12             ; [] |406| 
    1212 000020 118C          SXT       r12                   ; [] |406| 
    1213 000022 B03C          BIT.W     #32768,r12            ; [] |406| 
         000024 8000 
    1214 000026 7D0D          SUBC.W    r13,r13               ; [] |406| 
    1215 000028 E33D          INV.W     r13                   ; [] |406| 
    1216 00002a 5321          ADD.W     #2,SP                 ; [] 
    1217                    .dwcfi  cfa_offset, 4
    1218            $C$DW$106       .dwtag  DW_TAG_TI_branch
    1219                    .dwattr $C$DW$106, DW_AT_low_pc(0x00)
    1220                    .dwattr $C$DW$106, DW_AT_TI_return
    1221 00002c 0110          RETA      ; [] 
    1222                    ; [] 
    1223                    .dwattr $C$DW$101, DW_AT_TI_end_file("C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltm
    1224                    .dwattr $C$DW$101, DW_AT_TI_end_line(0x197)
    1225                    .dwattr $C$DW$101, DW_AT_TI_end_column(0x01)
    1226                    .dwendentry
    1227                    .dwendtag $C$DW$101
    1228            
    1229            ;*****************************************************************************
    1230            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1231            ;*****************************************************************************
    1232                    .global SimpleLinkWaitEvent
    1233                    .global UINT32_TO_STREAM_f
    1234                    .global hci_command_send
    1235                    .global nvmem_set_mac_address
    1236                    .global tSLInformation
    1237            
    1238            ;******************************************************************************
    1239            ;* BUILD ATTRIBUTES                                                           *
    1240            ;******************************************************************************
    1241                    .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
    1242            
    1243            ;******************************************************************************
    1244            ;* TYPE INFORMATION                                                           *
    1245            ;******************************************************************************
    1246            
    1247            $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1248                    .dwattr $C$DW$T$46, DW_AT_byte_size(0x3e)
    1249            $C$DW$107       .dwtag  DW_TAG_member
    1250                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1251                    .dwattr $C$DW$107, DW_AT_name("usRxEventOpcode")
    1252                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("usRxEventOpcode")
    1253                    .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1254                    .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1255            $C$DW$108       .dwtag  DW_TAG_member
    1256                    .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1257                    .dwattr $C$DW$108, DW_AT_name("usEventOrDataReceived")
    1258                    .dwattr $C$DW$108, DW_AT_TI_symbol_name("usEventOrDataReceived")
    1259                    .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1260                    .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:32 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0527610                         PAGE   26

    1261            $C$DW$109       .dwtag  DW_TAG_member
    1262                    .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$21)
    1263                    .dwattr $C$DW$109, DW_AT_name("pucReceivedData")
    1264                    .dwattr $C$DW$109, DW_AT_TI_symbol_name("pucReceivedData")
    1265                    .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1266                    .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1267            $C$DW$110       .dwtag  DW_TAG_member
    1268                    .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
    1269                    .dwattr $C$DW$110, DW_AT_name("pucTxCommandBuffer")
    1270                    .dwattr $C$DW$110, DW_AT_TI_symbol_name("pucTxCommandBuffer")
    1271                    .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1272                    .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1273            $C$DW$111       .dwtag  DW_TAG_member
    1274                    .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$29)
    1275                    .dwattr $C$DW$111, DW_AT_name("sFWPatches")
    1276                    .dwattr $C$DW$111, DW_AT_TI_symbol_name("sFWPatches")
    1277                    .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1278                    .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1279            $C$DW$112       .dwtag  DW_TAG_member
    1280                    .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$30)
    1281                    .dwattr $C$DW$112, DW_AT_name("sDriverPatches")
    1282                    .dwattr $C$DW$112, DW_AT_TI_symbol_name("sDriverPatches")
    1283                    .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1284                    .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1285            $C$DW$113       .dwtag  DW_TAG_member
    1286                    .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$31)
    1287                    .dwattr $C$DW$113, DW_AT_name("sBootLoaderPatches")
    1288                    .dwattr $C$DW$113, DW_AT_TI_symbol_name("sBootLoaderPatches")
    1289                    .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1290                    .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1291            $C$DW$114       .dwtag  DW_TAG_member
    1292                    .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$35)
    1293                    .dwattr $C$DW$114, DW_AT_name("sWlanCB")
    1294                    .dwattr $C$DW$114, DW_AT_TI_symbol_name("sWlanCB")
    1295                    .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1296                    .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1297            $C$DW$115       .dwtag  DW_TAG_member
    1298                    .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$38)
    1299                    .dwattr $C$DW$115, DW_AT_name("ReadWlanInterruptPin")
    1300                    .dwattr $C$DW$115, DW_AT_TI_symbol_name("ReadWlanInterruptPin")
    1301                    .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1302                    .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1303            $C$DW$116       .dwtag  DW_TAG_member
    1304                    .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$41)
    1305                    .dwattr $C$DW$116, DW_AT_name("WlanInterruptEnable")
    1306                    .dwattr $C$DW$116, DW_AT_TI_symbol_name("WlanInterruptEnable")
    1307                    .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1308                    .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1309            $C$DW$117       .dwtag  DW_TAG_member
    1310                    .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$42)
    1311                    .dwattr $C$DW$117, DW_AT_name("WlanInterruptDisable")
    1312                    .dwattr $C$DW$117, DW_AT_TI_symbol_name("WlanInterruptDisable")
    1313                    .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1314                    .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1315            $C$DW$118       .dwtag  DW_TAG_member
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:32 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0527610                         PAGE   27

    1316                    .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$45)
    1317                    .dwattr $C$DW$118, DW_AT_name("WriteWlanPin")
    1318                    .dwattr $C$DW$118, DW_AT_TI_symbol_name("WriteWlanPin")
    1319                    .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1320                    .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1321            $C$DW$119       .dwtag  DW_TAG_member
    1322                    .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$32)
    1323                    .dwattr $C$DW$119, DW_AT_name("slTransmitDataError")
    1324                    .dwattr $C$DW$119, DW_AT_TI_symbol_name("slTransmitDataError")
    1325                    .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1326                    .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1327            $C$DW$120       .dwtag  DW_TAG_member
    1328                    .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1329                    .dwattr $C$DW$120, DW_AT_name("usNumberOfFreeBuffers")
    1330                    .dwattr $C$DW$120, DW_AT_TI_symbol_name("usNumberOfFreeBuffers")
    1331                    .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1332                    .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1333            $C$DW$121       .dwtag  DW_TAG_member
    1334                    .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1335                    .dwattr $C$DW$121, DW_AT_name("usSlBufferLength")
    1336                    .dwattr $C$DW$121, DW_AT_TI_symbol_name("usSlBufferLength")
    1337                    .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1338                    .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1339            $C$DW$122       .dwtag  DW_TAG_member
    1340                    .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1341                    .dwattr $C$DW$122, DW_AT_name("usBufferSize")
    1342                    .dwattr $C$DW$122, DW_AT_TI_symbol_name("usBufferSize")
    1343                    .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1344                    .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1345            $C$DW$123       .dwtag  DW_TAG_member
    1346                    .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1347                    .dwattr $C$DW$123, DW_AT_name("usRxDataPending")
    1348                    .dwattr $C$DW$123, DW_AT_TI_symbol_name("usRxDataPending")
    1349                    .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1350                    .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1351            $C$DW$124       .dwtag  DW_TAG_member
    1352                    .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$25)
    1353                    .dwattr $C$DW$124, DW_AT_name("NumberOfSentPackets")
    1354                    .dwattr $C$DW$124, DW_AT_TI_symbol_name("NumberOfSentPackets")
    1355                    .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1356                    .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1357            $C$DW$125       .dwtag  DW_TAG_member
    1358                    .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$25)
    1359                    .dwattr $C$DW$125, DW_AT_name("NumberOfReleasedPackets")
    1360                    .dwattr $C$DW$125, DW_AT_TI_symbol_name("NumberOfReleasedPackets")
    1361                    .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1362                    .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1363            $C$DW$126       .dwtag  DW_TAG_member
    1364                    .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1365                    .dwattr $C$DW$126, DW_AT_name("InformHostOnTxComplete")
    1366                    .dwattr $C$DW$126, DW_AT_TI_symbol_name("InformHostOnTxComplete")
    1367                    .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1368                    .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1369                    .dwendtag $C$DW$T$46
    1370            
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:32 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0527610                         PAGE   28

    1371            $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("sSimplLinkInformation")
    1372                    .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$46)
    1373                    .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1374            $C$DW$T$53      .dwtag  DW_TAG_volatile_type
    1375                    .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1376            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1377                    .dwattr $C$DW$T$3, DW_AT_address_class(0x10)
    1378            
    1379            $C$DW$T$33      .dwtag  DW_TAG_subroutine_type
    1380                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1381            $C$DW$127       .dwtag  DW_TAG_formal_parameter
    1382                    .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$32)
    1383            $C$DW$128       .dwtag  DW_TAG_formal_parameter
    1384                    .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$24)
    1385            $C$DW$129       .dwtag  DW_TAG_formal_parameter
    1386                    .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    1387                    .dwendtag $C$DW$T$33
    1388            
    1389            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1390                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1391                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    1392            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanCB")
    1393                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1394                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1395            
    1396            $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    1397                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1398            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    1399                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1400                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    1401            $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptDisable")
    1402                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    1403                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1404            $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptEnable")
    1405                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1406                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1407            
    1408            $C$DW$T$43      .dwtag  DW_TAG_subroutine_type
    1409                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1410            $C$DW$130       .dwtag  DW_TAG_formal_parameter
    1411                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1412                    .dwendtag $C$DW$T$43
    1413            
    1414            $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    1415                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1416                    .dwattr $C$DW$T$44, DW_AT_address_class(0x14)
    1417            $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("tWriteWlanPin")
    1418                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1419                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1420            $C$DW$T$4       .dwtag  DW_TAG_base_type
    1421                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1422                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    1423                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1424            $C$DW$T$5       .dwtag  DW_TAG_base_type
    1425                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:32 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0527610                         PAGE   29

    1426                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1427                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1428            $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("INT8")
    1429                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$5)
    1430                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1431            $C$DW$T$6       .dwtag  DW_TAG_base_type
    1432                    .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1433                    .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1434                    .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1435            $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("UINT8")
    1436                    .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    1437                    .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1438            $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    1439                    .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    1440                    .dwattr $C$DW$T$21, DW_AT_address_class(0x10)
    1441            $C$DW$T$63      .dwtag  DW_TAG_const_type
    1442                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$21)
    1443            
    1444            $C$DW$T$47      .dwtag  DW_TAG_array_type
    1445                    .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$20)
    1446                    .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1447                    .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    1448            $C$DW$131       .dwtag  DW_TAG_subrange_type
    1449                    .dwattr $C$DW$131, DW_AT_upper_bound(0x03)
    1450                    .dwendtag $C$DW$T$47
    1451            
    1452            
    1453            $C$DW$T$48      .dwtag  DW_TAG_array_type
    1454                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$20)
    1455                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1456                    .dwattr $C$DW$T$48, DW_AT_byte_size(0x06)
    1457            $C$DW$132       .dwtag  DW_TAG_subrange_type
    1458                    .dwattr $C$DW$132, DW_AT_upper_bound(0x05)
    1459                    .dwendtag $C$DW$T$48
    1460            
    1461            
    1462            $C$DW$T$49      .dwtag  DW_TAG_array_type
    1463                    .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$20)
    1464                    .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1465                    .dwattr $C$DW$T$49, DW_AT_byte_size(0x20)
    1466            $C$DW$133       .dwtag  DW_TAG_subrange_type
    1467                    .dwattr $C$DW$133, DW_AT_upper_bound(0x1f)
    1468                    .dwendtag $C$DW$T$49
    1469            
    1470            $C$DW$T$7       .dwtag  DW_TAG_base_type
    1471                    .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1472                    .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1473                    .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    1474            $C$DW$T$8       .dwtag  DW_TAG_base_type
    1475                    .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1476                    .dwattr $C$DW$T$8, DW_AT_name("short")
    1477                    .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1478            $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("INT16")
    1479                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$8)
    1480                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:32 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0527610                         PAGE   30

    1481            $C$DW$T$9       .dwtag  DW_TAG_base_type
    1482                    .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1483                    .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1484                    .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1485            $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("UINT16")
    1486                    .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1487                    .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1488            $C$DW$T$10      .dwtag  DW_TAG_base_type
    1489                    .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1490                    .dwattr $C$DW$T$10, DW_AT_name("int")
    1491                    .dwattr $C$DW$T$10, DW_AT_byte_size(0x02)
    1492            $C$DW$T$11      .dwtag  DW_TAG_base_type
    1493                    .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1494                    .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1495                    .dwattr $C$DW$T$11, DW_AT_byte_size(0x02)
    1496            $C$DW$T$12      .dwtag  DW_TAG_base_type
    1497                    .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1498                    .dwattr $C$DW$T$12, DW_AT_name("long")
    1499                    .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    1500            $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("INT32")
    1501                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$12)
    1502                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1503            
    1504            $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    1505                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$32)
    1506                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1507            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    1508                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1509                    .dwattr $C$DW$T$37, DW_AT_address_class(0x14)
    1510            $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanReadInteruptPin")
    1511                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1512                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1513            $C$DW$T$13      .dwtag  DW_TAG_base_type
    1514                    .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1515                    .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1516                    .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    1517            $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("UINT32")
    1518                    .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    1519                    .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1520            $C$DW$T$87      .dwtag  DW_TAG_const_type
    1521                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$25)
    1522            $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    1523                    .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1524                    .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    1525            $C$DW$T$88      .dwtag  DW_TAG_const_type
    1526                    .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$26)
    1527            $C$DW$T$14      .dwtag  DW_TAG_base_type
    1528                    .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1529                    .dwattr $C$DW$T$14, DW_AT_name("long long")
    1530                    .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    1531            $C$DW$T$15      .dwtag  DW_TAG_base_type
    1532                    .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1533                    .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1534                    .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    1535            $C$DW$T$16      .dwtag  DW_TAG_base_type
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:32 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0527610                         PAGE   31

    1536                    .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1537                    .dwattr $C$DW$T$16, DW_AT_name("float")
    1538                    .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1539            $C$DW$T$17      .dwtag  DW_TAG_base_type
    1540                    .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1541                    .dwattr $C$DW$T$17, DW_AT_name("double")
    1542                    .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    1543            $C$DW$T$18      .dwtag  DW_TAG_base_type
    1544                    .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1545                    .dwattr $C$DW$T$18, DW_AT_name("long double")
    1546                    .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    1547            $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CHAR")
    1548                    .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$6)
    1549                    .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1550            $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    1551                    .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    1552                    .dwattr $C$DW$T$24, DW_AT_address_class(0x10)
    1553            
    1554            $C$DW$T$27      .dwtag  DW_TAG_subroutine_type
    1555                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    1556                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1557            $C$DW$134       .dwtag  DW_TAG_formal_parameter
    1558                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$26)
    1559                    .dwendtag $C$DW$T$27
    1560            
    1561            $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1562                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1563                    .dwattr $C$DW$T$28, DW_AT_address_class(0x14)
    1564            $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("tBootLoaderPatches")
    1565                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    1566                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1567            $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("tDriverPatches")
    1568                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$28)
    1569                    .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1570            $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("tFWPatches")
    1571                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1572                    .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1573            
    1574            $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1575                    .dwattr $C$DW$T$50, DW_AT_name("_netapp_ipconfig_ret_args_t")
    1576                    .dwattr $C$DW$T$50, DW_AT_byte_size(0x3a)
    1577            $C$DW$135       .dwtag  DW_TAG_member
    1578                    .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$47)
    1579                    .dwattr $C$DW$135, DW_AT_name("aucIP")
    1580                    .dwattr $C$DW$135, DW_AT_TI_symbol_name("aucIP")
    1581                    .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582                    .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1583            $C$DW$136       .dwtag  DW_TAG_member
    1584                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$47)
    1585                    .dwattr $C$DW$136, DW_AT_name("aucSubnetMask")
    1586                    .dwattr $C$DW$136, DW_AT_TI_symbol_name("aucSubnetMask")
    1587                    .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1588                    .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1589            $C$DW$137       .dwtag  DW_TAG_member
    1590                    .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$47)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:32 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0527610                         PAGE   32

    1591                    .dwattr $C$DW$137, DW_AT_name("aucDefaultGateway")
    1592                    .dwattr $C$DW$137, DW_AT_TI_symbol_name("aucDefaultGateway")
    1593                    .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1594                    .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1595            $C$DW$138       .dwtag  DW_TAG_member
    1596                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$47)
    1597                    .dwattr $C$DW$138, DW_AT_name("aucDHCPServer")
    1598                    .dwattr $C$DW$138, DW_AT_TI_symbol_name("aucDHCPServer")
    1599                    .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1600                    .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1601            $C$DW$139       .dwtag  DW_TAG_member
    1602                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$47)
    1603                    .dwattr $C$DW$139, DW_AT_name("aucDNSServer")
    1604                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("aucDNSServer")
    1605                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1606                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1607            $C$DW$140       .dwtag  DW_TAG_member
    1608                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$48)
    1609                    .dwattr $C$DW$140, DW_AT_name("uaMacAddr")
    1610                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("uaMacAddr")
    1611                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1612                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1613            $C$DW$141       .dwtag  DW_TAG_member
    1614                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$49)
    1615                    .dwattr $C$DW$141, DW_AT_name("uaSSID")
    1616                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("uaSSID")
    1617                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1618                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1619                    .dwendtag $C$DW$T$50
    1620            
    1621            $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("tNetappIpconfigRetArgs")
    1622                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$50)
    1623                    .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1624            $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    1625                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    1626                    .dwattr $C$DW$T$58, DW_AT_address_class(0x10)
    1627            $C$DW$T$94      .dwtag  DW_TAG_const_type
    1628                    .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$58)
    1629                    .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1630            
    1631            ;***************************************************************
    1632            ;* DWARF CIE ENTRIES                                           *
    1633            ;***************************************************************
    1634            
    1635            $C$DW$CIE       .dwcie 16
    1636                    .dwcfi  cfa_register, 1
    1637                    .dwcfi  cfa_offset, 0
    1638                    .dwcfi  undefined, 0
    1639                    .dwcfi  undefined, 1
    1640                    .dwcfi  undefined, 2
    1641                    .dwcfi  undefined, 3
    1642                    .dwcfi  same_value, 4
    1643                    .dwcfi  same_value, 5
    1644                    .dwcfi  same_value, 6
    1645                    .dwcfi  same_value, 7
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:32 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0527610                         PAGE   33

    1646                    .dwcfi  same_value, 8
    1647                    .dwcfi  same_value, 9
    1648                    .dwcfi  same_value, 10
    1649                    .dwcfi  undefined, 11
    1650                    .dwcfi  undefined, 12
    1651                    .dwcfi  undefined, 13
    1652                    .dwcfi  undefined, 14
    1653                    .dwcfi  undefined, 15
    1654                    .dwcfi  undefined, 16
    1655                    .dwendentry
    1656            
    1657            ;***************************************************************
    1658            ;* DWARF REGISTER MAP                                          *
    1659            ;***************************************************************
    1660            
    1661            $C$DW$142       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("PC")
    1662                    .dwattr $C$DW$142, DW_AT_location[DW_OP_reg0]
    1663            $C$DW$143       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SP")
    1664                    .dwattr $C$DW$143, DW_AT_location[DW_OP_reg1]
    1665            $C$DW$144       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SR")
    1666                    .dwattr $C$DW$144, DW_AT_location[DW_OP_reg2]
    1667            $C$DW$145       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("CG")
    1668                    .dwattr $C$DW$145, DW_AT_location[DW_OP_reg3]
    1669            $C$DW$146       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r4")
    1670                    .dwattr $C$DW$146, DW_AT_location[DW_OP_reg4]
    1671            $C$DW$147       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r5")
    1672                    .dwattr $C$DW$147, DW_AT_location[DW_OP_reg5]
    1673            $C$DW$148       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r6")
    1674                    .dwattr $C$DW$148, DW_AT_location[DW_OP_reg6]
    1675            $C$DW$149       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r7")
    1676                    .dwattr $C$DW$149, DW_AT_location[DW_OP_reg7]
