MSP430 Assembler PC v4.1.8 Sat Mar 22 17:43:08 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0406010                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                             PC v4.1.8 *
       3            ;* Date/Time created: Sat Mar 22 17:43:08 2014                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=coffabi --hll_source=on --mem_model:code=large --mem_model:data=small --o
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source
       9                    .dwattr $C$DW$CU, DW_AT_producer("MSP430 C/C++ Codegen PC v4.1.8 Copyright (c) 2003-2013 Texas
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("E:\Dropbox\git\CHARM\Embedded_Voltmeter\Basic WiFi Source\Ba
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("SimpleLinkWaitEvent")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("SimpleLinkWaitEvent")

    1275 000000 8321          SUB.W     #2,SP                 ; [] 
    1276                    .dwcfi  cfa_offset, 6
    1277            $C$DW$106       .dwtag  DW_TAG_variable, DW_AT_name("scRet")
    1278                    .dwattr $C$DW$106, DW_AT_TI_symbol_name("scRet")
    1279                    .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$60)
    1280                    .dwattr $C$DW$106, DW_AT_location[DW_OP_breg1 0]
    1281            ;* r13   assigned to ptr
    1282            $C$DW$107       .dwtag  DW_TAG_variable, DW_AT_name("ptr")
    1283                    .dwattr $C$DW$107, DW_AT_TI_symbol_name("ptr")
    1284                    .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$21)
    1285                    .dwattr $C$DW$107, DW_AT_location[DW_OP_reg13]
    1286                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    1287 000002 43F1          MOV.B     #-1,0(SP)             ; [] |397| 
         000004 0000 
    1288                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    1289 000006 421D          MOV.W     &tSLInformation+6,r13 ; [] |398| 
         000008 0006!
    1290                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    1291 00000a 403C          MOV.W     #8198,r12             ; [] |401| 
         00000c 2006 
    1292 00000e 434E          MOV.B     #0,r14                ; [] |401| 
    1293            $C$DW$108       .dwtag  DW_TAG_TI_branch
    1294                    .dwattr $C$DW$108, DW_AT_low_pc(0x00)
    1295                    .dwattr $C$DW$108, DW_AT_name("hci_command_send")
    1296                    .dwattr $C$DW$108, DW_AT_TI_call
    1297 000010 13B0!         CALLA     #hci_command_send     ; [] |401| 
         000012 0000 
    1298                                                      ; [] |401| 
    1299                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    1300 000014 403C          MOV.W     #8198,r12             ; [] |404| 
         000016 2006 
    1301 000018 01CD          MOVA      SP,r13                ; [] |404| 
    1302            $C$DW$109       .dwtag  DW_TAG_TI_branch
    1303                    .dwattr $C$DW$109, DW_AT_low_pc(0x00)
    1304                    .dwattr $C$DW$109, DW_AT_name("SimpleLinkWaitEvent")
    1305                    .dwattr $C$DW$109, DW_AT_TI_call
    1306 00001a 13B0!         CALLA     #SimpleLinkWaitEvent  ; [] |404| 
         00001c 0000 
    1307                                                      ; [] |404| 
    1308                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    1309 00001e 416C          MOV.B     0(SP),r12             ; [] |406| 
    1310 000020 118C          SXT       r12                   ; [] |406| 
    1311 000022 B03C          BIT.W     #32768,r12            ; [] |406| 
         000024 8000 
    1312 000026 7D0D          SUBC.W    r13,r13               ; [] |406| 
    1313 000028 E33D          INV.W     r13                   ; [] |406| 
    1314                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    1315 00002a 5321          ADD.W     #2,SP                 ; [] 
MSP430 Assembler PC v4.1.8 Sat Mar 22 17:43:08 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0406010                            PAGE   27

    1316                    .dwcfi  cfa_offset, 4
    1317            $C$DW$110       .dwtag  DW_TAG_TI_branch
    1318                    .dwattr $C$DW$110, DW_AT_low_pc(0x00)
    1319                    .dwattr $C$DW$110, DW_AT_TI_return
    1320 00002c 0110          RETA      ; [] 
    1321                    ; [] 
    1322                    .dwattr $C$DW$105, DW_AT_TI_end_file("E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Sourc
    1323                    .dwattr $C$DW$105, DW_AT_TI_end_line(0x197)
    1324                    .dwattr $C$DW$105, DW_AT_TI_end_column(0x01)
    1325                    .dwendentry
    1326                    .dwendtag $C$DW$105
    1327            
    1328            ;*****************************************************************************
    1329            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1330            ;*****************************************************************************
    1331                    .global SimpleLinkWaitEvent
    1332                    .global UINT32_TO_STREAM_f
    1333                    .global hci_command_send
    1334                    .global nvmem_set_mac_address
    1335                    .global tSLInformation
    1336            
    1337            ;******************************************************************************
    1338            ;* BUILD ATTRIBUTES                                                           *
    1339            ;******************************************************************************
    1340                    .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
    1341            
    1342            ;******************************************************************************
    1343            ;* TYPE INFORMATION                                                           *
    1344            ;******************************************************************************
    1345            
    1346            $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1347                    .dwattr $C$DW$T$46, DW_AT_byte_size(0x3e)
    1348            $C$DW$111       .dwtag  DW_TAG_member
    1349                    .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1350                    .dwattr $C$DW$111, DW_AT_name("usRxEventOpcode")
    1351                    .dwattr $C$DW$111, DW_AT_TI_symbol_name("usRxEventOpcode")
    1352                    .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353                    .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1354            $C$DW$112       .dwtag  DW_TAG_member
    1355                    .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1356                    .dwattr $C$DW$112, DW_AT_name("usEventOrDataReceived")
    1357                    .dwattr $C$DW$112, DW_AT_TI_symbol_name("usEventOrDataReceived")
    1358                    .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1359                    .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1360            $C$DW$113       .dwtag  DW_TAG_member
    1361                    .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$21)
    1362                    .dwattr $C$DW$113, DW_AT_name("pucReceivedData")
    1363                    .dwattr $C$DW$113, DW_AT_TI_symbol_name("pucReceivedData")
    1364                    .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1365                    .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1366            $C$DW$114       .dwtag  DW_TAG_member
    1367                    .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$21)
    1368                    .dwattr $C$DW$114, DW_AT_name("pucTxCommandBuffer")
    1369                    .dwattr $C$DW$114, DW_AT_TI_symbol_name("pucTxCommandBuffer")
    1370                    .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
MSP430 Assembler PC v4.1.8 Sat Mar 22 17:43:08 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0406010                            PAGE   28

    1371                    .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1372            $C$DW$115       .dwtag  DW_TAG_member
    1373                    .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$29)
    1374                    .dwattr $C$DW$115, DW_AT_name("sFWPatches")
    1375                    .dwattr $C$DW$115, DW_AT_TI_symbol_name("sFWPatches")
    1376                    .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1377                    .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1378            $C$DW$116       .dwtag  DW_TAG_member
    1379                    .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$30)
    1380                    .dwattr $C$DW$116, DW_AT_name("sDriverPatches")
    1381                    .dwattr $C$DW$116, DW_AT_TI_symbol_name("sDriverPatches")
    1382                    .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1383                    .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1384            $C$DW$117       .dwtag  DW_TAG_member
    1385                    .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$31)
    1386                    .dwattr $C$DW$117, DW_AT_name("sBootLoaderPatches")
    1387                    .dwattr $C$DW$117, DW_AT_TI_symbol_name("sBootLoaderPatches")
    1388                    .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1389                    .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1390            $C$DW$118       .dwtag  DW_TAG_member
    1391                    .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$35)
    1392                    .dwattr $C$DW$118, DW_AT_name("sWlanCB")
    1393                    .dwattr $C$DW$118, DW_AT_TI_symbol_name("sWlanCB")
    1394                    .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1395                    .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1396            $C$DW$119       .dwtag  DW_TAG_member
    1397                    .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$38)
    1398                    .dwattr $C$DW$119, DW_AT_name("ReadWlanInterruptPin")
    1399                    .dwattr $C$DW$119, DW_AT_TI_symbol_name("ReadWlanInterruptPin")
    1400                    .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1401                    .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1402            $C$DW$120       .dwtag  DW_TAG_member
    1403                    .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$41)
    1404                    .dwattr $C$DW$120, DW_AT_name("WlanInterruptEnable")
    1405                    .dwattr $C$DW$120, DW_AT_TI_symbol_name("WlanInterruptEnable")
    1406                    .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1407                    .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1408            $C$DW$121       .dwtag  DW_TAG_member
    1409                    .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$42)
    1410                    .dwattr $C$DW$121, DW_AT_name("WlanInterruptDisable")
    1411                    .dwattr $C$DW$121, DW_AT_TI_symbol_name("WlanInterruptDisable")
    1412                    .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1413                    .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1414            $C$DW$122       .dwtag  DW_TAG_member
    1415                    .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$45)
    1416                    .dwattr $C$DW$122, DW_AT_name("WriteWlanPin")
    1417                    .dwattr $C$DW$122, DW_AT_TI_symbol_name("WriteWlanPin")
    1418                    .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1419                    .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1420            $C$DW$123       .dwtag  DW_TAG_member
    1421                    .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$32)
    1422                    .dwattr $C$DW$123, DW_AT_name("slTransmitDataError")
    1423                    .dwattr $C$DW$123, DW_AT_TI_symbol_name("slTransmitDataError")
    1424                    .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1425                    .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v4.1.8 Sat Mar 22 17:43:08 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0406010                            PAGE   29

    1426            $C$DW$124       .dwtag  DW_TAG_member
    1427                    .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1428                    .dwattr $C$DW$124, DW_AT_name("usNumberOfFreeBuffers")
    1429                    .dwattr $C$DW$124, DW_AT_TI_symbol_name("usNumberOfFreeBuffers")
    1430                    .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1431                    .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1432            $C$DW$125       .dwtag  DW_TAG_member
    1433                    .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1434                    .dwattr $C$DW$125, DW_AT_name("usSlBufferLength")
    1435                    .dwattr $C$DW$125, DW_AT_TI_symbol_name("usSlBufferLength")
    1436                    .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1437                    .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1438            $C$DW$126       .dwtag  DW_TAG_member
    1439                    .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1440                    .dwattr $C$DW$126, DW_AT_name("usBufferSize")
    1441                    .dwattr $C$DW$126, DW_AT_TI_symbol_name("usBufferSize")
    1442                    .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1443                    .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1444            $C$DW$127       .dwtag  DW_TAG_member
    1445                    .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1446                    .dwattr $C$DW$127, DW_AT_name("usRxDataPending")
    1447                    .dwattr $C$DW$127, DW_AT_TI_symbol_name("usRxDataPending")
    1448                    .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1449                    .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1450            $C$DW$128       .dwtag  DW_TAG_member
    1451                    .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$25)
    1452                    .dwattr $C$DW$128, DW_AT_name("NumberOfSentPackets")
    1453                    .dwattr $C$DW$128, DW_AT_TI_symbol_name("NumberOfSentPackets")
    1454                    .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1455                    .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1456            $C$DW$129       .dwtag  DW_TAG_member
    1457                    .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$25)
    1458                    .dwattr $C$DW$129, DW_AT_name("NumberOfReleasedPackets")
    1459                    .dwattr $C$DW$129, DW_AT_TI_symbol_name("NumberOfReleasedPackets")
    1460                    .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1461                    .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1462            $C$DW$130       .dwtag  DW_TAG_member
    1463                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1464                    .dwattr $C$DW$130, DW_AT_name("InformHostOnTxComplete")
    1465                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("InformHostOnTxComplete")
    1466                    .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1467                    .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1468                    .dwendtag $C$DW$T$46
    1469            
    1470            $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("sSimplLinkInformation")
    1471                    .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$46)
    1472                    .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1473            $C$DW$T$53      .dwtag  DW_TAG_volatile_type
    1474                    .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1475            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1476                    .dwattr $C$DW$T$3, DW_AT_address_class(0x10)
    1477            
    1478            $C$DW$T$33      .dwtag  DW_TAG_subroutine_type
    1479                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1480            $C$DW$131       .dwtag  DW_TAG_formal_parameter
MSP430 Assembler PC v4.1.8 Sat Mar 22 17:43:08 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0406010                            PAGE   30

    1481                    .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$32)
    1482            $C$DW$132       .dwtag  DW_TAG_formal_parameter
    1483                    .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$24)
    1484            $C$DW$133       .dwtag  DW_TAG_formal_parameter
    1485                    .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    1486                    .dwendtag $C$DW$T$33
    1487            
    1488            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1489                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1490                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    1491            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanCB")
    1492                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1493                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1494            
    1495            $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    1496                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1497            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    1498                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1499                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    1500            $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptDisable")
    1501                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    1502                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1503            $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptEnable")
    1504                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1505                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1506            
    1507            $C$DW$T$43      .dwtag  DW_TAG_subroutine_type
    1508                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1509            $C$DW$134       .dwtag  DW_TAG_formal_parameter
    1510                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    1511                    .dwendtag $C$DW$T$43
    1512            
    1513            $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    1514                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1515                    .dwattr $C$DW$T$44, DW_AT_address_class(0x14)
    1516            $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("tWriteWlanPin")
    1517                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1518                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1519            $C$DW$T$4       .dwtag  DW_TAG_base_type
    1520                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1521                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    1522                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1523            $C$DW$T$5       .dwtag  DW_TAG_base_type
    1524                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1525                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1526                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1527            $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("INT8")
    1528                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$5)
    1529                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1530            $C$DW$T$6       .dwtag  DW_TAG_base_type
    1531                    .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1532                    .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1533                    .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1534            $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("UINT8")
    1535                    .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
MSP430 Assembler PC v4.1.8 Sat Mar 22 17:43:08 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0406010                            PAGE   31

    1536                    .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1537            $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    1538                    .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    1539                    .dwattr $C$DW$T$21, DW_AT_address_class(0x10)
    1540            
    1541            $C$DW$T$47      .dwtag  DW_TAG_array_type
    1542                    .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$20)
    1543                    .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    1544                    .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    1545            $C$DW$135       .dwtag  DW_TAG_subrange_type
    1546                    .dwattr $C$DW$135, DW_AT_upper_bound(0x03)
    1547                    .dwendtag $C$DW$T$47
    1548            
    1549            
    1550            $C$DW$T$48      .dwtag  DW_TAG_array_type
    1551                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$20)
    1552                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1553                    .dwattr $C$DW$T$48, DW_AT_byte_size(0x06)
    1554            $C$DW$136       .dwtag  DW_TAG_subrange_type
    1555                    .dwattr $C$DW$136, DW_AT_upper_bound(0x05)
    1556                    .dwendtag $C$DW$T$48
    1557            
    1558            
    1559            $C$DW$T$49      .dwtag  DW_TAG_array_type
    1560                    .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$20)
    1561                    .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1562                    .dwattr $C$DW$T$49, DW_AT_byte_size(0x20)
    1563            $C$DW$137       .dwtag  DW_TAG_subrange_type
    1564                    .dwattr $C$DW$137, DW_AT_upper_bound(0x1f)
    1565                    .dwendtag $C$DW$T$49
    1566            
    1567            $C$DW$T$7       .dwtag  DW_TAG_base_type
    1568                    .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1569                    .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1570                    .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    1571            $C$DW$T$8       .dwtag  DW_TAG_base_type
    1572                    .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1573                    .dwattr $C$DW$T$8, DW_AT_name("short")
    1574                    .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1575            $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("INT16")
    1576                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$8)
    1577                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    1578            $C$DW$T$9       .dwtag  DW_TAG_base_type
    1579                    .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1580                    .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1581                    .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1582            $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("UINT16")
    1583                    .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    1584                    .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1585            $C$DW$T$10      .dwtag  DW_TAG_base_type
    1586                    .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1587                    .dwattr $C$DW$T$10, DW_AT_name("int")
    1588                    .dwattr $C$DW$T$10, DW_AT_byte_size(0x02)
    1589            $C$DW$T$11      .dwtag  DW_TAG_base_type
    1590                    .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
MSP430 Assembler PC v4.1.8 Sat Mar 22 17:43:08 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0406010                            PAGE   32

    1591                    .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1592                    .dwattr $C$DW$T$11, DW_AT_byte_size(0x02)
    1593            $C$DW$T$12      .dwtag  DW_TAG_base_type
    1594                    .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1595                    .dwattr $C$DW$T$12, DW_AT_name("long")
    1596                    .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    1597            $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("INT32")
    1598                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$12)
    1599                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1600            
    1601            $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    1602                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$32)
    1603                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1604            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    1605                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1606                    .dwattr $C$DW$T$37, DW_AT_address_class(0x14)
    1607            $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanReadInteruptPin")
    1608                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1609                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1610            $C$DW$T$13      .dwtag  DW_TAG_base_type
    1611                    .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1612                    .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1613                    .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    1614            $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("UINT32")
    1615                    .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    1616                    .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1617            $C$DW$T$87      .dwtag  DW_TAG_const_type
    1618                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$25)
    1619            $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    1620                    .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    1621                    .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    1622            $C$DW$T$88      .dwtag  DW_TAG_const_type
    1623                    .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$26)
    1624            $C$DW$T$14      .dwtag  DW_TAG_base_type
    1625                    .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1626                    .dwattr $C$DW$T$14, DW_AT_name("long long")
    1627                    .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    1628            $C$DW$T$15      .dwtag  DW_TAG_base_type
    1629                    .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1630                    .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1631                    .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    1632            $C$DW$T$16      .dwtag  DW_TAG_base_type
    1633                    .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1634                    .dwattr $C$DW$T$16, DW_AT_name("float")
    1635                    .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1636            $C$DW$T$17      .dwtag  DW_TAG_base_type
    1637                    .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1638                    .dwattr $C$DW$T$17, DW_AT_name("double")
    1639                    .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    1640            $C$DW$T$18      .dwtag  DW_TAG_base_type
    1641                    .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1642                    .dwattr $C$DW$T$18, DW_AT_name("long double")
    1643                    .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    1644            $C$DW$T$22      .dwtag  DW_TAG_base_type
    1645                    .dwattr $C$DW$T$22, DW_AT_encoding(DW_ATE_unsigned_char)
MSP430 Assembler PC v4.1.8 Sat Mar 22 17:43:08 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0406010                            PAGE   33

    1646                    .dwattr $C$DW$T$22, DW_AT_name("unsigned char")
    1647                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    1648            $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CHAR")
    1649                    .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    1650                    .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    1651            $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    1652                    .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    1653                    .dwattr $C$DW$T$24, DW_AT_address_class(0x10)
    1654            
    1655            $C$DW$T$27      .dwtag  DW_TAG_subroutine_type
    1656                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    1657                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    1658            $C$DW$138       .dwtag  DW_TAG_formal_parameter
    1659                    .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$26)
    1660                    .dwendtag $C$DW$T$27
    1661            
    1662            $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    1663                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1664                    .dwattr $C$DW$T$28, DW_AT_address_class(0x14)
    1665            $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("tBootLoaderPatches")
    1666                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    1667                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1668            $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("tDriverPatches")
    1669                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$28)
    1670                    .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1671            $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("tFWPatches")
    1672                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1673                    .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1674            
    1675            $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1676                    .dwattr $C$DW$T$50, DW_AT_name("_netapp_ipconfig_ret_args_t")
    1677                    .dwattr $C$DW$T$50, DW_AT_byte_size(0x3a)
    1678            $C$DW$139       .dwtag  DW_TAG_member
    1679                    .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$47)
    1680                    .dwattr $C$DW$139, DW_AT_name("aucIP")
    1681                    .dwattr $C$DW$139, DW_AT_TI_symbol_name("aucIP")
    1682                    .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1683                    .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1684            $C$DW$140       .dwtag  DW_TAG_member
    1685                    .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$47)
    1686                    .dwattr $C$DW$140, DW_AT_name("aucSubnetMask")
    1687                    .dwattr $C$DW$140, DW_AT_TI_symbol_name("aucSubnetMask")
    1688                    .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1689                    .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1690            $C$DW$141       .dwtag  DW_TAG_member
    1691                    .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$47)
    1692                    .dwattr $C$DW$141, DW_AT_name("aucDefaultGateway")
    1693                    .dwattr $C$DW$141, DW_AT_TI_symbol_name("aucDefaultGateway")
    1694                    .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1695                    .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1696            $C$DW$142       .dwtag  DW_TAG_member
    1697                    .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$47)
    1698                    .dwattr $C$DW$142, DW_AT_name("aucDHCPServer")
    1699                    .dwattr $C$DW$142, DW_AT_TI_symbol_name("aucDHCPServer")
    1700                    .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
MSP430 Assembler PC v4.1.8 Sat Mar 22 17:43:08 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0406010                            PAGE   34

    1701                    .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1702            $C$DW$143       .dwtag  DW_TAG_member
    1703                    .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$47)
    1704                    .dwattr $C$DW$143, DW_AT_name("aucDNSServer")
    1705                    .dwattr $C$DW$143, DW_AT_TI_symbol_name("aucDNSServer")
    1706                    .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1707                    .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1708            $C$DW$144       .dwtag  DW_TAG_member
    1709                    .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$48)
    1710                    .dwattr $C$DW$144, DW_AT_name("uaMacAddr")
    1711                    .dwattr $C$DW$144, DW_AT_TI_symbol_name("uaMacAddr")
    1712                    .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1713                    .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1714            $C$DW$145       .dwtag  DW_TAG_member
    1715                    .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$49)
    1716                    .dwattr $C$DW$145, DW_AT_name("uaSSID")
    1717                    .dwattr $C$DW$145, DW_AT_TI_symbol_name("uaSSID")
    1718                    .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1719                    .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1720                    .dwendtag $C$DW$T$50
    1721            
    1722            $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("tNetappIpconfigRetArgs")
    1723                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$50)
    1724                    .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1725            $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    1726                    .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    1727                    .dwattr $C$DW$T$58, DW_AT_address_class(0x10)
    1728            $C$DW$T$94      .dwtag  DW_TAG_const_type
    1729                    .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$58)
    1730                    .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1731            
    1732            ;***************************************************************
    1733            ;* DWARF CIE ENTRIES                                           *
    1734            ;***************************************************************
    1735            
    1736            $C$DW$CIE       .dwcie 16
    1737                    .dwcfi  cfa_register, 1
    1738                    .dwcfi  cfa_offset, 0
    1739                    .dwcfi  undefined, 0
    1740                    .dwcfi  undefined, 1
    1741                    .dwcfi  undefined, 2
    1742                    .dwcfi  undefined, 3
    1743                    .dwcfi  same_value, 4
    1744                    .dwcfi  same_value, 5
    1745                    .dwcfi  same_value, 6
    1746                    .dwcfi  same_value, 7
    1747                    .dwcfi  same_value, 8
    1748                    .dwcfi  same_value, 9
    1749                    .dwcfi  same_value, 10
    1750                    .dwcfi  undefined, 11
    1751                    .dwcfi  undefined, 12
    1752                    .dwcfi  undefined, 13
    1753                    .dwcfi  undefined, 14
    1754                    .dwcfi  undefined, 15
    1755                    .dwcfi  undefined, 16
MSP430 Assembler PC v4.1.8 Sat Mar 22 17:43:08 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0406010                            PAGE   35

    1756                    .dwendentry
    1757            
    1758            ;***************************************************************
    1759            ;* DWARF REGISTER MAP                                          *
    1760            ;***************************************************************
    1761            
    1762            $C$DW$146       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("PC")
    1763                    .dwattr $C$DW$146, DW_AT_location[DW_OP_reg0]
    1764            $C$DW$147       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SP")
    1765                    .dwattr $C$DW$147, DW_AT_location[DW_OP_reg1]
    1766            $C$DW$148       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SR")
    1767                    .dwattr $C$DW$148, DW_AT_location[DW_OP_reg2]
    1768            $C$DW$149       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("CG")
    1769                    .dwattr $C$DW$149, DW_AT_location[DW_OP_reg3]
    1770            $C$DW$150       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r4")
    1771                    .dwattr $C$DW$150, DW_AT_location[DW_OP_reg4]
    1772            $C$DW$151       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r5")
    1773                    .dwattr $C$DW$151, DW_AT_location[DW_OP_reg5]
    1774            $C$DW$152       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r6")
    1775                    .dwattr $C$DW$152, DW_AT_location[DW_OP_reg6]
    1776            $C$DW$153       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r7")
    1777                    .dwattr $C$DW$153, DW_AT_location[DW_OP_reg7]
