MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:25 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0395610                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                             PC v4.1.9 *
       3            ;* Date/Time created: Tue Mar 25 16:18:25 2014                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=coffabi --hll_source=on --mem_model:code=large --mem_model:data=small --o
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source
       9                    .dwattr $C$DW$CU, DW_AT_producer("MSP430 C/C++ Codegen PC v4.1.9 Copyright (c) 2003-2014 Texas
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("E:\Dropbox\git\CHARM\Embedded_Voltmeter\Basic WiFi Source\Ba
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)

    1056                                                      ; [] |317| 
    1057                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    1058 00001e 08CD          MOVA      r8,r13                ; [] |318| 
    1059 000020 09CE          MOVA      r9,r14                ; [] |318| 
    1060            $C$DW$109       .dwtag  DW_TAG_TI_branch
    1061                    .dwattr $C$DW$109, DW_AT_low_pc(0x00)
    1062                    .dwattr $C$DW$109, DW_AT_name("UINT32_TO_STREAM_f")
    1063                    .dwattr $C$DW$109, DW_AT_TI_call
    1064 000022 13B0!         CALLA     #UINT32_TO_STREAM_f   ; [] |318| 
         000024 0000 
    1065                                                      ; [] |318| 
    1066                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    1067 000026 403C          MOV.W     #515,r12              ; [] |321| 
         000028 0203 
    1068 00002a 07CD          MOVA      r7,r13                ; [] |321| 
    1069 00002c 427E          MOV.B     #8,r14                ; [] |321| 
    1070            $C$DW$110       .dwtag  DW_TAG_TI_branch
    1071                    .dwattr $C$DW$110, DW_AT_low_pc(0x00)
    1072                    .dwattr $C$DW$110, DW_AT_name("hci_command_send")
    1073                    .dwattr $C$DW$110, DW_AT_TI_call
    1074 00002e 13B0!         CALLA     #hci_command_send     ; [] |321| 
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:25 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0395610                            PAGE   22

         000030 0000 
    1075                                                      ; [] |321| 
    1076                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    1077 000032 403C          MOV.W     #515,r12              ; [] |323| 
         000034 0203 
    1078 000036 01CD          MOVA      SP,r13                ; [] |323| 
    1079            $C$DW$111       .dwtag  DW_TAG_TI_branch
    1080                    .dwattr $C$DW$111, DW_AT_low_pc(0x00)
    1081                    .dwattr $C$DW$111, DW_AT_name("SimpleLinkWaitEvent")
    1082                    .dwattr $C$DW$111, DW_AT_TI_call
    1083 000038 13B0!         CALLA     #SimpleLinkWaitEvent  ; [] |323| 
         00003a 0000 
    1084                                                      ; [] |323| 
    1085                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    1086 00003c 416C          MOV.B     0(SP),r12             ; [] |325| 
    1087 00003e 430D          MOV.W     #0,r13                ; [] |325| 
    1088                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    1089 000040 5321          ADD.W     #2,SP                 ; [] 
    1090                    .dwcfi  cfa_offset, 20
    1091                    .dwcfi  restore_reg, 7
    1092                    .dwcfi  restore_reg, 8
    1093                    .dwcfi  restore_reg, 9
    1094                    .dwcfi  restore_reg, 10
    1095 000042 1637          POPM.A    #4,r10                ; [] 
    1096                    .dwcfi  cfa_offset, 4
    1097            $C$DW$112       .dwtag  DW_TAG_TI_branch
    1098                    .dwattr $C$DW$112, DW_AT_low_pc(0x00)
    1099                    .dwattr $C$DW$112, DW_AT_TI_return
    1100 000044 0110          RETA      ; [] 
    1101                    ; [] 
    1102                    .dwattr $C$DW$101, DW_AT_TI_end_file("E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Sourc
    1103                    .dwattr $C$DW$101, DW_AT_TI_end_line(0x146)
    1104                    .dwattr $C$DW$101, DW_AT_TI_end_column(0x01)
    1105                    .dwendentry
    1106                    .dwendtag $C$DW$101
    1107            
    1108            ;*****************************************************************************
    1109            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1110            ;*****************************************************************************
    1111                    .global SimpleLinkWaitEvent
    1112                    .global SimpleLinkWaitData
    1113                    .global UINT32_TO_STREAM_f
    1114                    .global hci_command_send
    1115                    .global hci_data_command_send
    1116                    .global tSLInformation
    1117                    .global memcpy
    1118            
    1119            ;******************************************************************************
    1120            ;* BUILD ATTRIBUTES                                                           *
    1121            ;******************************************************************************
    1122                    .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
    1123            
    1124            ;******************************************************************************
    1125            ;* TYPE INFORMATION                                                           *
    1126            ;******************************************************************************
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:25 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0395610                            PAGE   23

    1127            
    1128            $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1129                    .dwattr $C$DW$T$46, DW_AT_byte_size(0x3e)
    1130            $C$DW$113       .dwtag  DW_TAG_member
    1131                    .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1132                    .dwattr $C$DW$113, DW_AT_name("usRxEventOpcode")
    1133                    .dwattr $C$DW$113, DW_AT_TI_symbol_name("usRxEventOpcode")
    1134                    .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135                    .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1136            $C$DW$114       .dwtag  DW_TAG_member
    1137                    .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1138                    .dwattr $C$DW$114, DW_AT_name("usEventOrDataReceived")
    1139                    .dwattr $C$DW$114, DW_AT_TI_symbol_name("usEventOrDataReceived")
    1140                    .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1141                    .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1142            $C$DW$115       .dwtag  DW_TAG_member
    1143                    .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
    1144                    .dwattr $C$DW$115, DW_AT_name("pucReceivedData")
    1145                    .dwattr $C$DW$115, DW_AT_TI_symbol_name("pucReceivedData")
    1146                    .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1147                    .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1148            $C$DW$116       .dwtag  DW_TAG_member
    1149                    .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$21)
    1150                    .dwattr $C$DW$116, DW_AT_name("pucTxCommandBuffer")
    1151                    .dwattr $C$DW$116, DW_AT_TI_symbol_name("pucTxCommandBuffer")
    1152                    .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1153                    .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1154            $C$DW$117       .dwtag  DW_TAG_member
    1155                    .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$29)
    1156                    .dwattr $C$DW$117, DW_AT_name("sFWPatches")
    1157                    .dwattr $C$DW$117, DW_AT_TI_symbol_name("sFWPatches")
    1158                    .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1159                    .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1160            $C$DW$118       .dwtag  DW_TAG_member
    1161                    .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$30)
    1162                    .dwattr $C$DW$118, DW_AT_name("sDriverPatches")
    1163                    .dwattr $C$DW$118, DW_AT_TI_symbol_name("sDriverPatches")
    1164                    .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1165                    .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1166            $C$DW$119       .dwtag  DW_TAG_member
    1167                    .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$31)
    1168                    .dwattr $C$DW$119, DW_AT_name("sBootLoaderPatches")
    1169                    .dwattr $C$DW$119, DW_AT_TI_symbol_name("sBootLoaderPatches")
    1170                    .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1171                    .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1172            $C$DW$120       .dwtag  DW_TAG_member
    1173                    .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$35)
    1174                    .dwattr $C$DW$120, DW_AT_name("sWlanCB")
    1175                    .dwattr $C$DW$120, DW_AT_TI_symbol_name("sWlanCB")
    1176                    .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1177                    .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1178            $C$DW$121       .dwtag  DW_TAG_member
    1179                    .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$38)
    1180                    .dwattr $C$DW$121, DW_AT_name("ReadWlanInterruptPin")
    1181                    .dwattr $C$DW$121, DW_AT_TI_symbol_name("ReadWlanInterruptPin")
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:25 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0395610                            PAGE   24

    1182                    .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1183                    .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1184            $C$DW$122       .dwtag  DW_TAG_member
    1185                    .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$41)
    1186                    .dwattr $C$DW$122, DW_AT_name("WlanInterruptEnable")
    1187                    .dwattr $C$DW$122, DW_AT_TI_symbol_name("WlanInterruptEnable")
    1188                    .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1189                    .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1190            $C$DW$123       .dwtag  DW_TAG_member
    1191                    .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$42)
    1192                    .dwattr $C$DW$123, DW_AT_name("WlanInterruptDisable")
    1193                    .dwattr $C$DW$123, DW_AT_TI_symbol_name("WlanInterruptDisable")
    1194                    .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1195                    .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1196            $C$DW$124       .dwtag  DW_TAG_member
    1197                    .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$45)
    1198                    .dwattr $C$DW$124, DW_AT_name("WriteWlanPin")
    1199                    .dwattr $C$DW$124, DW_AT_TI_symbol_name("WriteWlanPin")
    1200                    .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1201                    .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1202            $C$DW$125       .dwtag  DW_TAG_member
    1203                    .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$32)
    1204                    .dwattr $C$DW$125, DW_AT_name("slTransmitDataError")
    1205                    .dwattr $C$DW$125, DW_AT_TI_symbol_name("slTransmitDataError")
    1206                    .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1207                    .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1208            $C$DW$126       .dwtag  DW_TAG_member
    1209                    .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1210                    .dwattr $C$DW$126, DW_AT_name("usNumberOfFreeBuffers")
    1211                    .dwattr $C$DW$126, DW_AT_TI_symbol_name("usNumberOfFreeBuffers")
    1212                    .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1213                    .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1214            $C$DW$127       .dwtag  DW_TAG_member
    1215                    .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1216                    .dwattr $C$DW$127, DW_AT_name("usSlBufferLength")
    1217                    .dwattr $C$DW$127, DW_AT_TI_symbol_name("usSlBufferLength")
    1218                    .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1219                    .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1220            $C$DW$128       .dwtag  DW_TAG_member
    1221                    .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1222                    .dwattr $C$DW$128, DW_AT_name("usBufferSize")
    1223                    .dwattr $C$DW$128, DW_AT_TI_symbol_name("usBufferSize")
    1224                    .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1225                    .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1226            $C$DW$129       .dwtag  DW_TAG_member
    1227                    .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1228                    .dwattr $C$DW$129, DW_AT_name("usRxDataPending")
    1229                    .dwattr $C$DW$129, DW_AT_TI_symbol_name("usRxDataPending")
    1230                    .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1231                    .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1232            $C$DW$130       .dwtag  DW_TAG_member
    1233                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$25)
    1234                    .dwattr $C$DW$130, DW_AT_name("NumberOfSentPackets")
    1235                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("NumberOfSentPackets")
    1236                    .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:25 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0395610                            PAGE   25

    1237                    .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1238            $C$DW$131       .dwtag  DW_TAG_member
    1239                    .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$25)
    1240                    .dwattr $C$DW$131, DW_AT_name("NumberOfReleasedPackets")
    1241                    .dwattr $C$DW$131, DW_AT_TI_symbol_name("NumberOfReleasedPackets")
    1242                    .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1243                    .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1244            $C$DW$132       .dwtag  DW_TAG_member
    1245                    .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1246                    .dwattr $C$DW$132, DW_AT_name("InformHostOnTxComplete")
    1247                    .dwattr $C$DW$132, DW_AT_TI_symbol_name("InformHostOnTxComplete")
    1248                    .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1249                    .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1250                    .dwendtag $C$DW$T$46
    1251            
    1252            $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("sSimplLinkInformation")
    1253                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$46)
    1254                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1255            $C$DW$T$49      .dwtag  DW_TAG_volatile_type
    1256                    .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1257            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1258                    .dwattr $C$DW$T$3, DW_AT_address_class(0x10)
    1259            
    1260            $C$DW$T$33      .dwtag  DW_TAG_subroutine_type
    1261                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1262            $C$DW$133       .dwtag  DW_TAG_formal_parameter
    1263                    .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$32)
    1264            $C$DW$134       .dwtag  DW_TAG_formal_parameter
    1265                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$24)
    1266            $C$DW$135       .dwtag  DW_TAG_formal_parameter
    1267                    .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1268                    .dwendtag $C$DW$T$33
    1269            
    1270            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1271                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1272                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    1273            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanCB")
    1274                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1275                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1276            
    1277            $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    1278                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1279            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    1280                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1281                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    1282            $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptDisable")
    1283                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    1284                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1285            $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptEnable")
    1286                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1287                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1288            
    1289            $C$DW$T$43      .dwtag  DW_TAG_subroutine_type
    1290                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1291            $C$DW$136       .dwtag  DW_TAG_formal_parameter
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:25 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0395610                            PAGE   26

    1292                    .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    1293                    .dwendtag $C$DW$T$43
    1294            
    1295            $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    1296                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1297                    .dwattr $C$DW$T$44, DW_AT_address_class(0x14)
    1298            $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("tWriteWlanPin")
    1299                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1300                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1301            $C$DW$T$50      .dwtag  DW_TAG_const_type
    1302            $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    1303                    .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    1304                    .dwattr $C$DW$T$51, DW_AT_address_class(0x10)
