MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:33 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0206810                         PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                             PC v4.2.1 *
       3            ;* Date/Time created: Fri Mar 21 13:42:33 2014                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=coffabi --hll_source=on --mem_model:code=large --mem_model:data=small --o
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Bas
       9                    .dwattr $C$DW$CU, DW_AT_producer("MSP430 C/C++ Codegen PC v4.2.1 Copyright (c) 2003-2013 Texas
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\409010855\Documents\GitHub\CHARM\Embedded_Voltmeter
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)

     987                    .dwattr $C$DW$106, DW_AT_low_pc(0x00)
     988                    .dwattr $C$DW$106, DW_AT_name("UINT32_TO_STREAM_f")
     989                    .dwattr $C$DW$106, DW_AT_TI_call
     990 000016 13B0!         CALLA     #UINT32_TO_STREAM_f   ; [] |317| 
         000018 0000 
     991                                                      ; [] |317| 
     992                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
     993 00001a 09CD          MOVA      r9,r13                ; [] |318| 
     994 00001c 0ACE          MOVA      r10,r14               ; [] |318| 
     995            $C$DW$107       .dwtag  DW_TAG_TI_branch
     996                    .dwattr $C$DW$107, DW_AT_low_pc(0x00)
     997                    .dwattr $C$DW$107, DW_AT_name("UINT32_TO_STREAM_f")
     998                    .dwattr $C$DW$107, DW_AT_TI_call
     999 00001e 13B0!         CALLA     #UINT32_TO_STREAM_f   ; [] |318| 
         000020 0000 
    1000                                                      ; [] |318| 
    1001                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    1002 000022 403C          MOV.W     #515,r12              ; [] |321| 
         000024 0203 
    1003 000026 08CD          MOVA      r8,r13                ; [] |321| 
    1004 000028 427E          MOV.B     #8,r14                ; [] |321| 
    1005            $C$DW$108       .dwtag  DW_TAG_TI_branch
    1006                    .dwattr $C$DW$108, DW_AT_low_pc(0x00)
    1007                    .dwattr $C$DW$108, DW_AT_name("hci_command_send")
    1008                    .dwattr $C$DW$108, DW_AT_TI_call
    1009 00002a 13B0!         CALLA     #hci_command_send     ; [] |321| 
         00002c 0000 
    1010                                                      ; [] |321| 
    1011                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    1012 00002e 403C          MOV.W     #515,r12              ; [] |323| 
         000030 0203 
    1013 000032 01CD          MOVA      SP,r13                ; [] |323| 
    1014            $C$DW$109       .dwtag  DW_TAG_TI_branch
    1015                    .dwattr $C$DW$109, DW_AT_low_pc(0x00)
    1016                    .dwattr $C$DW$109, DW_AT_name("SimpleLinkWaitEvent")
    1017                    .dwattr $C$DW$109, DW_AT_TI_call
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:33 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0206810                         PAGE   21

    1018 000034 13B0!         CALLA     #SimpleLinkWaitEvent  ; [] |323| 
         000036 0000 
    1019                                                      ; [] |323| 
    1020                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    1021 000038 416C          MOV.B     0(SP),r12             ; [] |325| 
    1022 00003a 430D          MOV.W     #0,r13                ; [] |325| 
    1023 00003c 5321          ADD.W     #2,SP                 ; [] 
    1024                    .dwcfi  cfa_offset, 16
    1025 00003e 1628          POPM.A    #3,r10                ; [] 
    1026                    .dwcfi  restore_reg, 8
    1027                    .dwcfi  restore_reg, 9
    1028                    .dwcfi  restore_reg, 10
    1029                    .dwcfi  cfa_offset, 4
    1030            $C$DW$110       .dwtag  DW_TAG_TI_branch
    1031                    .dwattr $C$DW$110, DW_AT_low_pc(0x00)
    1032                    .dwattr $C$DW$110, DW_AT_TI_return
    1033 000040 0110          RETA      ; [] 
    1034                    ; [] 
    1035                    .dwattr $C$DW$98, DW_AT_TI_end_file("C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltme
    1036                    .dwattr $C$DW$98, DW_AT_TI_end_line(0x146)
    1037                    .dwattr $C$DW$98, DW_AT_TI_end_column(0x01)
    1038                    .dwendentry
    1039                    .dwendtag $C$DW$98
    1040            
    1041            ;*****************************************************************************
    1042            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    1043            ;*****************************************************************************
    1044                    .global SimpleLinkWaitEvent
    1045                    .global SimpleLinkWaitData
    1046                    .global UINT32_TO_STREAM_f
    1047                    .global hci_command_send
    1048                    .global hci_data_command_send
    1049                    .global tSLInformation
    1050                    .global memcpy
    1051            
    1052            ;******************************************************************************
    1053            ;* BUILD ATTRIBUTES                                                           *
    1054            ;******************************************************************************
    1055                    .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
    1056            
    1057            ;******************************************************************************
    1058            ;* TYPE INFORMATION                                                           *
    1059            ;******************************************************************************
    1060            
    1061            $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1062                    .dwattr $C$DW$T$46, DW_AT_byte_size(0x3e)
    1063            $C$DW$111       .dwtag  DW_TAG_member
    1064                    .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1065                    .dwattr $C$DW$111, DW_AT_name("usRxEventOpcode")
    1066                    .dwattr $C$DW$111, DW_AT_TI_symbol_name("usRxEventOpcode")
    1067                    .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1068                    .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1069            $C$DW$112       .dwtag  DW_TAG_member
    1070                    .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1071                    .dwattr $C$DW$112, DW_AT_name("usEventOrDataReceived")
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:33 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0206810                         PAGE   22

    1072                    .dwattr $C$DW$112, DW_AT_TI_symbol_name("usEventOrDataReceived")
    1073                    .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1074                    .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1075            $C$DW$113       .dwtag  DW_TAG_member
    1076                    .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$21)
    1077                    .dwattr $C$DW$113, DW_AT_name("pucReceivedData")
    1078                    .dwattr $C$DW$113, DW_AT_TI_symbol_name("pucReceivedData")
    1079                    .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1080                    .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1081            $C$DW$114       .dwtag  DW_TAG_member
    1082                    .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$21)
    1083                    .dwattr $C$DW$114, DW_AT_name("pucTxCommandBuffer")
    1084                    .dwattr $C$DW$114, DW_AT_TI_symbol_name("pucTxCommandBuffer")
    1085                    .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1086                    .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1087            $C$DW$115       .dwtag  DW_TAG_member
    1088                    .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$29)
    1089                    .dwattr $C$DW$115, DW_AT_name("sFWPatches")
    1090                    .dwattr $C$DW$115, DW_AT_TI_symbol_name("sFWPatches")
    1091                    .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1092                    .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1093            $C$DW$116       .dwtag  DW_TAG_member
    1094                    .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$30)
    1095                    .dwattr $C$DW$116, DW_AT_name("sDriverPatches")
    1096                    .dwattr $C$DW$116, DW_AT_TI_symbol_name("sDriverPatches")
    1097                    .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1098                    .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1099            $C$DW$117       .dwtag  DW_TAG_member
    1100                    .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$31)
    1101                    .dwattr $C$DW$117, DW_AT_name("sBootLoaderPatches")
    1102                    .dwattr $C$DW$117, DW_AT_TI_symbol_name("sBootLoaderPatches")
    1103                    .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1104                    .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1105            $C$DW$118       .dwtag  DW_TAG_member
    1106                    .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$35)
    1107                    .dwattr $C$DW$118, DW_AT_name("sWlanCB")
    1108                    .dwattr $C$DW$118, DW_AT_TI_symbol_name("sWlanCB")
    1109                    .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1110                    .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1111            $C$DW$119       .dwtag  DW_TAG_member
    1112                    .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$38)
    1113                    .dwattr $C$DW$119, DW_AT_name("ReadWlanInterruptPin")
    1114                    .dwattr $C$DW$119, DW_AT_TI_symbol_name("ReadWlanInterruptPin")
    1115                    .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1116                    .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1117            $C$DW$120       .dwtag  DW_TAG_member
    1118                    .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$41)
    1119                    .dwattr $C$DW$120, DW_AT_name("WlanInterruptEnable")
    1120                    .dwattr $C$DW$120, DW_AT_TI_symbol_name("WlanInterruptEnable")
    1121                    .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1122                    .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1123            $C$DW$121       .dwtag  DW_TAG_member
    1124                    .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$42)
    1125                    .dwattr $C$DW$121, DW_AT_name("WlanInterruptDisable")
    1126                    .dwattr $C$DW$121, DW_AT_TI_symbol_name("WlanInterruptDisable")
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:33 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0206810                         PAGE   23

    1127                    .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1128                    .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1129            $C$DW$122       .dwtag  DW_TAG_member
    1130                    .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$45)
    1131                    .dwattr $C$DW$122, DW_AT_name("WriteWlanPin")
    1132                    .dwattr $C$DW$122, DW_AT_TI_symbol_name("WriteWlanPin")
    1133                    .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1134                    .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1135            $C$DW$123       .dwtag  DW_TAG_member
    1136                    .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$32)
    1137                    .dwattr $C$DW$123, DW_AT_name("slTransmitDataError")
    1138                    .dwattr $C$DW$123, DW_AT_TI_symbol_name("slTransmitDataError")
    1139                    .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1140                    .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1141            $C$DW$124       .dwtag  DW_TAG_member
    1142                    .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1143                    .dwattr $C$DW$124, DW_AT_name("usNumberOfFreeBuffers")
    1144                    .dwattr $C$DW$124, DW_AT_TI_symbol_name("usNumberOfFreeBuffers")
    1145                    .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1146                    .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1147            $C$DW$125       .dwtag  DW_TAG_member
    1148                    .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1149                    .dwattr $C$DW$125, DW_AT_name("usSlBufferLength")
    1150                    .dwattr $C$DW$125, DW_AT_TI_symbol_name("usSlBufferLength")
    1151                    .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1152                    .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1153            $C$DW$126       .dwtag  DW_TAG_member
    1154                    .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1155                    .dwattr $C$DW$126, DW_AT_name("usBufferSize")
    1156                    .dwattr $C$DW$126, DW_AT_TI_symbol_name("usBufferSize")
    1157                    .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1158                    .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1159            $C$DW$127       .dwtag  DW_TAG_member
    1160                    .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1161                    .dwattr $C$DW$127, DW_AT_name("usRxDataPending")
    1162                    .dwattr $C$DW$127, DW_AT_TI_symbol_name("usRxDataPending")
    1163                    .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1164                    .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1165            $C$DW$128       .dwtag  DW_TAG_member
    1166                    .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$25)
    1167                    .dwattr $C$DW$128, DW_AT_name("NumberOfSentPackets")
    1168                    .dwattr $C$DW$128, DW_AT_TI_symbol_name("NumberOfSentPackets")
    1169                    .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1170                    .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1171            $C$DW$129       .dwtag  DW_TAG_member
    1172                    .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$25)
    1173                    .dwattr $C$DW$129, DW_AT_name("NumberOfReleasedPackets")
    1174                    .dwattr $C$DW$129, DW_AT_TI_symbol_name("NumberOfReleasedPackets")
    1175                    .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1176                    .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1177            $C$DW$130       .dwtag  DW_TAG_member
    1178                    .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1179                    .dwattr $C$DW$130, DW_AT_name("InformHostOnTxComplete")
    1180                    .dwattr $C$DW$130, DW_AT_TI_symbol_name("InformHostOnTxComplete")
    1181                    .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:33 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0206810                         PAGE   24

    1182                    .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1183                    .dwendtag $C$DW$T$46
    1184            
    1185            $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("sSimplLinkInformation")
    1186                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$46)
    1187                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    1188            $C$DW$T$49      .dwtag  DW_TAG_volatile_type
    1189                    .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    1190            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1191                    .dwattr $C$DW$T$3, DW_AT_address_class(0x10)
    1192            
    1193            $C$DW$T$33      .dwtag  DW_TAG_subroutine_type
    1194                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1195            $C$DW$131       .dwtag  DW_TAG_formal_parameter
    1196                    .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$32)
    1197            $C$DW$132       .dwtag  DW_TAG_formal_parameter
    1198                    .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$24)
    1199            $C$DW$133       .dwtag  DW_TAG_formal_parameter
    1200                    .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    1201                    .dwendtag $C$DW$T$33
    1202            
    1203            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1204                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1205                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    1206            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanCB")
    1207                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1208                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1209            
    1210            $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    1211                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1212            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    1213                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1214                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    1215            $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptDisable")
    1216                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    1217                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1218            $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptEnable")
    1219                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    1220                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1221            
    1222            $C$DW$T$43      .dwtag  DW_TAG_subroutine_type
    1223                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1224            $C$DW$134       .dwtag  DW_TAG_formal_parameter
    1225                    .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    1226                    .dwendtag $C$DW$T$43
    1227            
    1228            $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    1229                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1230                    .dwattr $C$DW$T$44, DW_AT_address_class(0x14)
    1231            $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("tWriteWlanPin")
    1232                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    1233                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1234            $C$DW$T$50      .dwtag  DW_TAG_const_type
    1235            $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    1236                    .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:33 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
