MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0881612                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                             PC v4.1.9 *
       3            ;* Date/Time created: Tue Mar 25 16:18:26 2014                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=coffabi --hll_source=on --mem_model:code=large --mem_model:data=small --o
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source
       9                    .dwattr $C$DW$CU, DW_AT_producer("MSP430 C/C++ Codegen PC v4.1.9 Copyright (c) 2003-2014 Texas
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("E:\Dropbox\git\CHARM\Embedded_Voltmeter\Basic WiFi Source\Ba
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)

    4077 000060 E33D          INV.W     r13                   ; [] |328| 
    4078 000062 430E          MOV.W     #0,r14                ; [] |328| 
    4079 000064 430F          MOV.W     #0,r15                ; [] |328| 
    4080            $C$DW$373       .dwtag  DW_TAG_TI_branch
    4081                    .dwattr $C$DW$373, DW_AT_low_pc(0x00)
    4082                    .dwattr $C$DW$373, DW_AT_name("set_socket_active_status")
    4083                    .dwattr $C$DW$373, DW_AT_TI_call
    4084 000066 13B0!         CALLA     #set_socket_active_status ; [] |328| 
         000068 0000 
    4085                                                      ; [] |328| 
    4086                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    4087 00006a 3C06          JMP       $C$L57                ; [] |329| 
    4088                                                      ; [] |329| 
    4089            ;* --------------------------------------------------------------------------*
    4090 00006c       $C$L56:    
    4091                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    4092 00006c 09CC          MOVA      r9,r12                ; [] |332| 
    4093 00006e 0ACD          MOVA      r10,r13               ; [] |332| 
    4094 000070 431E          MOV.W     #1,r14                ; [] |332| 
    4095 000072 430F          MOV.W     #0,r15                ; [] |332| 
    4096            $C$DW$374       .dwtag  DW_TAG_TI_branch
    4097                    .dwattr $C$DW$374, DW_AT_low_pc(0x00)
    4098                    .dwattr $C$DW$374, DW_AT_name("set_socket_active_status")
    4099                    .dwattr $C$DW$374, DW_AT_TI_call
    4100 000074 13B0!         CALLA     #set_socket_active_status ; [] |332| 
         000076 0000 
    4101                                                      ; [] |332| 
    4102            ;* --------------------------------------------------------------------------*
    4103 000078       $C$L57:    
    4104                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    4105 000078 08CC          MOVA      r8,r12                ; [] |335| 
    4106 00007a B03C          BIT.W     #32768,r12            ; [] |335| 
         00007c 8000 
    4107 00007e 7D0D          SUBC.W    r13,r13               ; [] |335| 
    4108 000080 E33D          INV.W     r13                   ; [] |335| 
    4109                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    4110 000082 5031          ADD.W     #24,SP                ; [] 
         000084 0018 
    4111                    .dwcfi  cfa_offset, 24
    4112                    .dwcfi  restore_reg, 6
    4113                    .dwcfi  restore_reg, 7
    4114                    .dwcfi  restore_reg, 8
    4115                    .dwcfi  restore_reg, 9
    4116                    .dwcfi  restore_reg, 10
    4117 000086 1646          POPM.A    #5,r10                ; [] 
    4118                    .dwcfi  cfa_offset, 4
    4119            $C$DW$375       .dwtag  DW_TAG_TI_branch
    4120                    .dwattr $C$DW$375, DW_AT_low_pc(0x00)
    4121                    .dwattr $C$DW$375, DW_AT_TI_return
    4122 000088 0110          RETA      ; [] 
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0881612                            PAGE   83

    4123                    ; [] 
    4124                    .dwattr $C$DW$360, DW_AT_TI_end_file("E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Sourc
    4125                    .dwattr $C$DW$360, DW_AT_TI_end_line(0x150)
    4126                    .dwattr $C$DW$360, DW_AT_TI_end_column(0x01)
    4127                    .dwendentry
    4128                    .dwendtag $C$DW$360
    4129            
    4130            ;*****************************************************************************
    4131            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    4132            ;*****************************************************************************
    4133                    .global SimpleLinkWaitEvent
    4134                    .global SimpleLinkWaitData
    4135                    .global UINT32_TO_STREAM_f
    4136                    .global hci_command_send
    4137                    .global hci_data_send
    4138                    .global set_socket_active_status
    4139                    .global get_socket_active_status
    4140                    .global _Errno
    4141                    .global tSLInformation
    4142                    .global memcpy
    4143                    .global L_LSL_8
    4144            
    4145            ;******************************************************************************
    4146            ;* BUILD ATTRIBUTES                                                           *
    4147            ;******************************************************************************
    4148                    .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
    4149            
    4150            ;******************************************************************************
    4151            ;* TYPE INFORMATION                                                           *
    4152            ;******************************************************************************
    4153            
    4154            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4155                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    4156            $C$DW$376       .dwtag  DW_TAG_member
    4157                    .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$21)
    4158                    .dwattr $C$DW$376, DW_AT_name("fds_bits")
    4159                    .dwattr $C$DW$376, DW_AT_TI_symbol_name("fds_bits")
    4160                    .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4161                    .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4162                    .dwendtag $C$DW$T$22
    4163            
    4164            $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("fd_set")
    4165                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$22)
    4166                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    4167            $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    4168                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    4169                    .dwattr $C$DW$T$65, DW_AT_address_class(0x10)
    4170            $C$DW$T$66      .dwtag  DW_TAG_const_type
    4171                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    4172            
    4173            $C$DW$T$49      .dwtag  DW_TAG_structure_type
    4174                    .dwattr $C$DW$T$49, DW_AT_byte_size(0x3e)
    4175            $C$DW$377       .dwtag  DW_TAG_member
    4176                    .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$23)
    4177                    .dwattr $C$DW$377, DW_AT_name("usRxEventOpcode")
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0881612                            PAGE   84

    4178                    .dwattr $C$DW$377, DW_AT_TI_symbol_name("usRxEventOpcode")
    4179                    .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4180                    .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4181            $C$DW$378       .dwtag  DW_TAG_member
    4182                    .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
    4183                    .dwattr $C$DW$378, DW_AT_name("usEventOrDataReceived")
    4184                    .dwattr $C$DW$378, DW_AT_TI_symbol_name("usEventOrDataReceived")
    4185                    .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4186                    .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4187            $C$DW$379       .dwtag  DW_TAG_member
    4188                    .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$25)
    4189                    .dwattr $C$DW$379, DW_AT_name("pucReceivedData")
    4190                    .dwattr $C$DW$379, DW_AT_TI_symbol_name("pucReceivedData")
    4191                    .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4192                    .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4193            $C$DW$380       .dwtag  DW_TAG_member
    4194                    .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$25)
    4195                    .dwattr $C$DW$380, DW_AT_name("pucTxCommandBuffer")
    4196                    .dwattr $C$DW$380, DW_AT_TI_symbol_name("pucTxCommandBuffer")
    4197                    .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4198                    .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4199            $C$DW$381       .dwtag  DW_TAG_member
    4200                    .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$33)
    4201                    .dwattr $C$DW$381, DW_AT_name("sFWPatches")
    4202                    .dwattr $C$DW$381, DW_AT_TI_symbol_name("sFWPatches")
    4203                    .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4204                    .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4205            $C$DW$382       .dwtag  DW_TAG_member
    4206                    .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$34)
    4207                    .dwattr $C$DW$382, DW_AT_name("sDriverPatches")
    4208                    .dwattr $C$DW$382, DW_AT_TI_symbol_name("sDriverPatches")
    4209                    .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4210                    .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4211            $C$DW$383       .dwtag  DW_TAG_member
    4212                    .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$35)
    4213                    .dwattr $C$DW$383, DW_AT_name("sBootLoaderPatches")
    4214                    .dwattr $C$DW$383, DW_AT_TI_symbol_name("sBootLoaderPatches")
    4215                    .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4216                    .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4217            $C$DW$384       .dwtag  DW_TAG_member
    4218                    .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$38)
    4219                    .dwattr $C$DW$384, DW_AT_name("sWlanCB")
    4220                    .dwattr $C$DW$384, DW_AT_TI_symbol_name("sWlanCB")
    4221                    .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4222                    .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    4223            $C$DW$385       .dwtag  DW_TAG_member
    4224                    .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$41)
    4225                    .dwattr $C$DW$385, DW_AT_name("ReadWlanInterruptPin")
    4226                    .dwattr $C$DW$385, DW_AT_TI_symbol_name("ReadWlanInterruptPin")
    4227                    .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4228                    .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4229            $C$DW$386       .dwtag  DW_TAG_member
    4230                    .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$44)
    4231                    .dwattr $C$DW$386, DW_AT_name("WlanInterruptEnable")
    4232                    .dwattr $C$DW$386, DW_AT_TI_symbol_name("WlanInterruptEnable")
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0881612                            PAGE   85

    4233                    .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4234                    .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4235            $C$DW$387       .dwtag  DW_TAG_member
    4236                    .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$45)
    4237                    .dwattr $C$DW$387, DW_AT_name("WlanInterruptDisable")
    4238                    .dwattr $C$DW$387, DW_AT_TI_symbol_name("WlanInterruptDisable")
    4239                    .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4240                    .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4241            $C$DW$388       .dwtag  DW_TAG_member
    4242                    .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$48)
    4243                    .dwattr $C$DW$388, DW_AT_name("WriteWlanPin")
    4244                    .dwattr $C$DW$388, DW_AT_TI_symbol_name("WriteWlanPin")
    4245                    .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4246                    .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4247            $C$DW$389       .dwtag  DW_TAG_member
    4248                    .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
    4249                    .dwattr $C$DW$389, DW_AT_name("slTransmitDataError")
    4250                    .dwattr $C$DW$389, DW_AT_TI_symbol_name("slTransmitDataError")
    4251                    .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4252                    .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4253            $C$DW$390       .dwtag  DW_TAG_member
    4254                    .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$23)
    4255                    .dwattr $C$DW$390, DW_AT_name("usNumberOfFreeBuffers")
    4256                    .dwattr $C$DW$390, DW_AT_TI_symbol_name("usNumberOfFreeBuffers")
    4257                    .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4258                    .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4259            $C$DW$391       .dwtag  DW_TAG_member
    4260                    .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$23)
    4261                    .dwattr $C$DW$391, DW_AT_name("usSlBufferLength")
    4262                    .dwattr $C$DW$391, DW_AT_TI_symbol_name("usSlBufferLength")
    4263                    .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4264                    .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4265            $C$DW$392       .dwtag  DW_TAG_member
    4266                    .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$23)
    4267                    .dwattr $C$DW$392, DW_AT_name("usBufferSize")
    4268                    .dwattr $C$DW$392, DW_AT_TI_symbol_name("usBufferSize")
    4269                    .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4270                    .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4271            $C$DW$393       .dwtag  DW_TAG_member
    4272                    .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$23)
    4273                    .dwattr $C$DW$393, DW_AT_name("usRxDataPending")
    4274                    .dwattr $C$DW$393, DW_AT_TI_symbol_name("usRxDataPending")
    4275                    .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4276                    .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4277            $C$DW$394       .dwtag  DW_TAG_member
    4278                    .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$29)
    4279                    .dwattr $C$DW$394, DW_AT_name("NumberOfSentPackets")
    4280                    .dwattr $C$DW$394, DW_AT_TI_symbol_name("NumberOfSentPackets")
    4281                    .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4282                    .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4283            $C$DW$395       .dwtag  DW_TAG_member
    4284                    .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$29)
    4285                    .dwattr $C$DW$395, DW_AT_name("NumberOfReleasedPackets")
    4286                    .dwattr $C$DW$395, DW_AT_TI_symbol_name("NumberOfReleasedPackets")
    4287                    .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0881612                            PAGE   86

    4288                    .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4289            $C$DW$396       .dwtag  DW_TAG_member
    4290                    .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$24)
    4291                    .dwattr $C$DW$396, DW_AT_name("InformHostOnTxComplete")
    4292                    .dwattr $C$DW$396, DW_AT_TI_symbol_name("InformHostOnTxComplete")
    4293                    .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4294                    .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4295                    .dwendtag $C$DW$T$49
    4296            
    4297            $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("sSimplLinkInformation")
    4298                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$49)
    4299                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    4300            $C$DW$T$69      .dwtag  DW_TAG_volatile_type
    4301                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    4302            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4303                    .dwattr $C$DW$T$3, DW_AT_address_class(0x10)
    4304            $C$DW$T$74      .dwtag  DW_TAG_const_type
    4305                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$3)
    4306            
    4307            $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    4308                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4309            $C$DW$397       .dwtag  DW_TAG_formal_parameter
    4310                    .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
    4311            $C$DW$398       .dwtag  DW_TAG_formal_parameter
    4312                    .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$28)
    4313            $C$DW$399       .dwtag  DW_TAG_formal_parameter
    4314                    .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$24)
    4315                    .dwendtag $C$DW$T$36
    4316            
    4317            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4318                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    4319                    .dwattr $C$DW$T$37, DW_AT_address_class(0x14)
    4320            $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanCB")
    4321                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4322                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4323            
    4324            $C$DW$T$42      .dwtag  DW_TAG_subroutine_type
    4325                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4326            $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4327                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4328                    .dwattr $C$DW$T$43, DW_AT_address_class(0x14)
    4329            $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptDisable")
    4330                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$43)
    4331                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4332            $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptEnable")
    4333                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4334                    .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4335            
    4336            $C$DW$T$46      .dwtag  DW_TAG_subroutine_type
    4337                    .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4338            $C$DW$400       .dwtag  DW_TAG_formal_parameter
    4339                    .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$24)
    4340                    .dwendtag $C$DW$T$46
    4341            
    4342            $C$DW$T$47      .dwtag  DW_TAG_pointer_type
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0881612                            PAGE   87

    4343                    .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4344                    .dwattr $C$DW$T$47, DW_AT_address_class(0x14)
    4345            $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("tWriteWlanPin")
    4346                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    4347                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4348            $C$DW$T$70      .dwtag  DW_TAG_const_type
    4349            $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    4350                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    4351                    .dwattr $C$DW$T$71, DW_AT_address_class(0x10)
    4352            $C$DW$T$75      .dwtag  DW_TAG_const_type
    4353                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$71)
    4354            $C$DW$T$4       .dwtag  DW_TAG_base_type
    4355                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4356                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    4357                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4358            $C$DW$T$5       .dwtag  DW_TAG_base_type
    4359                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4360                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4361                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4362            $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("INT8")
    4363                    .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$5)
    4364                    .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    4365            $C$DW$T$6       .dwtag  DW_TAG_base_type
    4366                    .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4367                    .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4368                    .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4369            $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("UINT8")
    4370                    .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$6)
    4371                    .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    4372            $C$DW$T$84      .dwtag  DW_TAG_const_type
    4373                    .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$24)
    4374            $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    4375                    .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    4376                    .dwattr $C$DW$T$85, DW_AT_address_class(0x10)
    4377            $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    4378                    .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    4379                    .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
    4380            
    4381            $C$DW$T$53      .dwtag  DW_TAG_array_type
    4382                    .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$24)
    4383                    .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4384                    .dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
    4385            $C$DW$401       .dwtag  DW_TAG_subrange_type
    4386                    .dwattr $C$DW$401, DW_AT_upper_bound(0x03)
    4387                    .dwendtag $C$DW$T$53
    4388            
    4389            
    4390            $C$DW$T$57      .dwtag  DW_TAG_array_type
    4391                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$24)
    4392                    .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4393                    .dwattr $C$DW$T$57, DW_AT_byte_size(0x0e)
    4394            $C$DW$402       .dwtag  DW_TAG_subrange_type
    4395                    .dwattr $C$DW$402, DW_AT_upper_bound(0x0d)
    4396                    .dwendtag $C$DW$T$57
    4397            
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0881612                            PAGE   88

    4398            $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    4399                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$6)
    4400                    .dwattr $C$DW$T$87, DW_AT_address_class(0x10)
    4401            $C$DW$T$91      .dwtag  DW_TAG_const_type
    4402                    .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$87)
    4403            $C$DW$T$7       .dwtag  DW_TAG_base_type
    4404                    .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4405                    .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4406                    .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4407            $C$DW$T$8       .dwtag  DW_TAG_base_type
    4408                    .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4409                    .dwattr $C$DW$T$8, DW_AT_name("short")
    4410                    .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    4411            $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("INT16")
    4412                    .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$8)
    4413                    .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    4414            $C$DW$T$93      .dwtag  DW_TAG_const_type
    4415                    .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    4416            $C$DW$T$9       .dwtag  DW_TAG_base_type
    4417                    .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4418                    .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4419                    .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    4420            $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("UINT16")
    4421                    .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$9)
    4422                    .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    4423            $C$DW$T$113     .dwtag  DW_TAG_const_type
    4424                    .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$23)
    4425            $C$DW$T$10      .dwtag  DW_TAG_base_type
    4426                    .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4427                    .dwattr $C$DW$T$10, DW_AT_name("int")
    4428                    .dwattr $C$DW$T$10, DW_AT_byte_size(0x02)
    4429            $C$DW$T$11      .dwtag  DW_TAG_base_type
    4430                    .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4431                    .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4432                    .dwattr $C$DW$T$11, DW_AT_byte_size(0x02)
    4433            $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    4434                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$11)
    4435                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4436            $C$DW$T$12      .dwtag  DW_TAG_base_type
    4437                    .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4438                    .dwattr $C$DW$T$12, DW_AT_name("long")
    4439                    .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    4440            $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("INT32")
    4441                    .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$12)
    4442                    .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4443            $C$DW$T$139     .dwtag  DW_TAG_const_type
    4444                    .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$19)
    4445            
    4446            $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    4447                    .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$19)
    4448                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4449            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    4450                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4451                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    4452            $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanReadInteruptPin")
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0881612                            PAGE   89

    4453                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    4454                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4455            $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("__fd_mask")
    4456                    .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4457                    .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4458            
    4459            $C$DW$T$21      .dwtag  DW_TAG_array_type
    4460                    .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    4461                    .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    4462                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    4463            $C$DW$403       .dwtag  DW_TAG_subrange_type
    4464                    .dwattr $C$DW$403, DW_AT_upper_bound(0x00)
    4465                    .dwendtag $C$DW$T$21
    4466            
    4467            $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("suseconds_t")
    4468                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$19)
    4469                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4470            $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("time_t")
    4471                    .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$19)
    4472                    .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4473            $C$DW$T$13      .dwtag  DW_TAG_base_type
    4474                    .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4475                    .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4476                    .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    4477            $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("UINT32")
    4478                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$13)
    4479                    .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4480            $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    4481                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    4482                    .dwattr $C$DW$T$30, DW_AT_address_class(0x10)
    4483            $C$DW$T$155     .dwtag  DW_TAG_const_type
    4484                    .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$30)
    4485            $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("socklen_t")
    4486                    .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$29)
    4487                    .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    4488            $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    4489                    .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$99)
    4490                    .dwattr $C$DW$T$101, DW_AT_address_class(0x10)
    4491            $C$DW$T$157     .dwtag  DW_TAG_const_type
    4492                    .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$101)
    4493            $C$DW$T$158     .dwtag  DW_TAG_const_type
    4494                    .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$99)
    4495            $C$DW$T$14      .dwtag  DW_TAG_base_type
    4496                    .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4497                    .dwattr $C$DW$T$14, DW_AT_name("long long")
    4498                    .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    4499            $C$DW$T$15      .dwtag  DW_TAG_base_type
    4500                    .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4501                    .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4502                    .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    4503            $C$DW$T$16      .dwtag  DW_TAG_base_type
    4504                    .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4505                    .dwattr $C$DW$T$16, DW_AT_name("float")
    4506                    .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    4507            $C$DW$T$17      .dwtag  DW_TAG_base_type
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0881612                            PAGE   90

    4508                    .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4509                    .dwattr $C$DW$T$17, DW_AT_name("double")
    4510                    .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    4511            $C$DW$T$18      .dwtag  DW_TAG_base_type
    4512                    .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4513                    .dwattr $C$DW$T$18, DW_AT_name("long double")
    4514                    .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    4515            $C$DW$T$26      .dwtag  DW_TAG_base_type
    4516                    .dwattr $C$DW$T$26, DW_AT_encoding(DW_ATE_unsigned_char)
    4517                    .dwattr $C$DW$T$26, DW_AT_name("unsigned char")
    4518                    .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    4519            $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CHAR")
    4520                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    4521                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4522            $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    4523                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    4524                    .dwattr $C$DW$T$28, DW_AT_address_class(0x10)
    4525            
    4526            $C$DW$T$31      .dwtag  DW_TAG_subroutine_type
    4527                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    4528                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4529            $C$DW$404       .dwtag  DW_TAG_formal_parameter
    4530                    .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$30)
    4531                    .dwendtag $C$DW$T$31
    4532            
    4533            $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    4534                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    4535                    .dwattr $C$DW$T$32, DW_AT_address_class(0x14)
    4536            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("tBootLoaderPatches")
    4537                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$32)
    4538                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4539            $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("tDriverPatches")
    4540                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$32)
    4541                    .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4542            $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("tFWPatches")
    4543                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4544                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4545            $C$DW$T$164     .dwtag  DW_TAG_const_type
    4546                    .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$28)
    4547            
    4548            $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4549                    .dwattr $C$DW$T$51, DW_AT_name("_bsd_accept_return_t")
    4550                    .dwattr $C$DW$T$51, DW_AT_byte_size(0x18)
    4551            $C$DW$405       .dwtag  DW_TAG_member
    4552                    .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    4553                    .dwattr $C$DW$405, DW_AT_name("iSocketDescriptor")
    4554                    .dwattr $C$DW$405, DW_AT_TI_symbol_name("iSocketDescriptor")
    4555                    .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4556                    .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4557            $C$DW$406       .dwtag  DW_TAG_member
    4558                    .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
    4559                    .dwattr $C$DW$406, DW_AT_name("iStatus")
    4560                    .dwattr $C$DW$406, DW_AT_TI_symbol_name("iStatus")
    4561                    .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4562                    .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0881612                            PAGE   91

    4563            $C$DW$407       .dwtag  DW_TAG_member
    4564                    .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$50)
    4565                    .dwattr $C$DW$407, DW_AT_name("tSocketAddress")
    4566                    .dwattr $C$DW$407, DW_AT_TI_symbol_name("tSocketAddress")
    4567                    .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4568                    .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4569                    .dwendtag $C$DW$T$51
    4570            
    4571            $C$DW$T$166     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdReturnParams")
    4572                    .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$51)
    4573                    .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    4574            
    4575            $C$DW$T$52      .dwtag  DW_TAG_structure_type
    4576                    .dwattr $C$DW$T$52, DW_AT_name("_bsd_gethostbyname_return_t")
    4577                    .dwattr $C$DW$T$52, DW_AT_byte_size(0x08)
    4578            $C$DW$408       .dwtag  DW_TAG_member
    4579                    .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    4580                    .dwattr $C$DW$408, DW_AT_name("retVal")
    4581                    .dwattr $C$DW$408, DW_AT_TI_symbol_name("retVal")
    4582                    .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4583                    .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4584            $C$DW$409       .dwtag  DW_TAG_member
    4585                    .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    4586                    .dwattr $C$DW$409, DW_AT_name("outputAddress")
    4587                    .dwattr $C$DW$409, DW_AT_TI_symbol_name("outputAddress")
    4588                    .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4589                    .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4590                    .dwendtag $C$DW$T$52
    4591            
    4592            $C$DW$T$168     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdGethostbynameParams")
    4593                    .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$52)
    4594                    .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    4595            
    4596            $C$DW$T$54      .dwtag  DW_TAG_structure_type
    4597                    .dwattr $C$DW$T$54, DW_AT_name("_bsd_getsockopt_return_t")
    4598                    .dwattr $C$DW$T$54, DW_AT_byte_size(0x05)
    4599            $C$DW$410       .dwtag  DW_TAG_member
    4600                    .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$53)
    4601                    .dwattr $C$DW$410, DW_AT_name("ucOptValue")
    4602                    .dwattr $C$DW$410, DW_AT_TI_symbol_name("ucOptValue")
    4603                    .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4604                    .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4605            $C$DW$411       .dwtag  DW_TAG_member
    4606                    .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$27)
    4607                    .dwattr $C$DW$411, DW_AT_name("iStatus")
    4608                    .dwattr $C$DW$411, DW_AT_TI_symbol_name("iStatus")
    4609                    .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4610                    .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4611                    .dwendtag $C$DW$T$54
    4612            
    4613            $C$DW$T$170     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdGetSockOptReturnParams")
    4614                    .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$54)
    4615                    .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
    4616            
    4617            $C$DW$T$55      .dwtag  DW_TAG_structure_type
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0881612                            PAGE   92

    4618                    .dwattr $C$DW$T$55, DW_AT_name("_bsd_read_return_t")
    4619                    .dwattr $C$DW$T$55, DW_AT_byte_size(0x0c)
    4620            $C$DW$412       .dwtag  DW_TAG_member
    4621                    .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    4622                    .dwattr $C$DW$412, DW_AT_name("iSocketDescriptor")
    4623                    .dwattr $C$DW$412, DW_AT_TI_symbol_name("iSocketDescriptor")
    4624                    .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4625                    .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4626            $C$DW$413       .dwtag  DW_TAG_member
    4627                    .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
    4628                    .dwattr $C$DW$413, DW_AT_name("iNumberOfBytes")
    4629                    .dwattr $C$DW$413, DW_AT_TI_symbol_name("iNumberOfBytes")
    4630                    .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4631                    .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4632            $C$DW$414       .dwtag  DW_TAG_member
    4633                    .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$29)
    4634                    .dwattr $C$DW$414, DW_AT_name("uiFlags")
    4635                    .dwattr $C$DW$414, DW_AT_TI_symbol_name("uiFlags")
    4636                    .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4637                    .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4638                    .dwendtag $C$DW$T$55
    4639            
    4640            $C$DW$T$172     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdReadReturnParams")
    4641                    .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$55)
    4642                    .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    4643            
    4644            $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4645                    .dwattr $C$DW$T$56, DW_AT_name("_bsd_select_return_t")
    4646                    .dwattr $C$DW$T$56, DW_AT_byte_size(0x10)
    4647            $C$DW$415       .dwtag  DW_TAG_member
    4648                    .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$19)
    4649                    .dwattr $C$DW$415, DW_AT_name("iStatus")
    4650                    .dwattr $C$DW$415, DW_AT_TI_symbol_name("iStatus")
    4651                    .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4652                    .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4653            $C$DW$416       .dwtag  DW_TAG_member
    4654                    .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$29)
    4655                    .dwattr $C$DW$416, DW_AT_name("uiRdfd")
    4656                    .dwattr $C$DW$416, DW_AT_TI_symbol_name("uiRdfd")
    4657                    .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4658                    .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4659            $C$DW$417       .dwtag  DW_TAG_member
    4660                    .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$29)
    4661                    .dwattr $C$DW$417, DW_AT_name("uiWrfd")
    4662                    .dwattr $C$DW$417, DW_AT_TI_symbol_name("uiWrfd")
    4663                    .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4664                    .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4665            $C$DW$418       .dwtag  DW_TAG_member
    4666                    .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$29)
    4667                    .dwattr $C$DW$418, DW_AT_name("uiExfd")
    4668                    .dwattr $C$DW$418, DW_AT_TI_symbol_name("uiExfd")
    4669                    .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4670                    .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4671                    .dwendtag $C$DW$T$56
    4672            
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0881612                            PAGE   93

    4673            $C$DW$T$174     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdSelectRecvParams")
    4674                    .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$56)
    4675                    .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    4676            
    4677            $C$DW$T$58      .dwtag  DW_TAG_structure_type
    4678                    .dwattr $C$DW$T$58, DW_AT_name("_sockaddr_t")
    4679                    .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    4680            $C$DW$419       .dwtag  DW_TAG_member
    4681                    .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$23)
    4682                    .dwattr $C$DW$419, DW_AT_name("sa_family")
    4683                    .dwattr $C$DW$419, DW_AT_TI_symbol_name("sa_family")
    4684                    .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4685                    .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4686            $C$DW$420       .dwtag  DW_TAG_member
    4687                    .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$57)
    4688                    .dwattr $C$DW$420, DW_AT_name("sa_data")
    4689                    .dwattr $C$DW$420, DW_AT_TI_symbol_name("sa_data")
    4690                    .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4691                    .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4692                    .dwendtag $C$DW$T$58
    4693            
    4694            $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("sockaddr")
    4695                    .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$58)
    4696                    .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4697            $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    4698                    .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$50)
    4699                    .dwattr $C$DW$T$103, DW_AT_address_class(0x10)
    4700            $C$DW$T$180     .dwtag  DW_TAG_const_type
    4701                    .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$103)
    4702            $C$DW$T$107     .dwtag  DW_TAG_const_type
    4703                    .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$50)
    4704            $C$DW$T$108     .dwtag  DW_TAG_pointer_type
    4705                    .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    4706                    .dwattr $C$DW$T$108, DW_AT_address_class(0x10)
    4707            $C$DW$T$181     .dwtag  DW_TAG_const_type
    4708                    .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$108)
    4709            
    4710            $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4711                    .dwattr $C$DW$T$61, DW_AT_name("timeval")
    4712                    .dwattr $C$DW$T$61, DW_AT_byte_size(0x08)
    4713            $C$DW$421       .dwtag  DW_TAG_member
    4714                    .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$59)
    4715                    .dwattr $C$DW$421, DW_AT_name("tv_sec")
    4716                    .dwattr $C$DW$421, DW_AT_TI_symbol_name("tv_sec")
    4717                    .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4718                    .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4719            $C$DW$422       .dwtag  DW_TAG_member
    4720                    .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$60)
    4721                    .dwattr $C$DW$422, DW_AT_name("tv_usec")
    4722                    .dwattr $C$DW$422, DW_AT_TI_symbol_name("tv_usec")
    4723                    .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4724                    .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4725                    .dwendtag $C$DW$T$61
    4726            
    4727            $C$DW$T$97      .dwtag  DW_TAG_pointer_type
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0881612                            PAGE   94

    4728                    .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$61)
    4729                    .dwattr $C$DW$T$97, DW_AT_address_class(0x10)
    4730            $C$DW$T$182     .dwtag  DW_TAG_const_type
    4731                    .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$97)
    4732                    .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4733            
    4734            ;***************************************************************
    4735            ;* DWARF CIE ENTRIES                                           *
    4736            ;***************************************************************
    4737            
    4738            $C$DW$CIE       .dwcie 16
    4739                    .dwcfi  cfa_register, 1
    4740                    .dwcfi  cfa_offset, 0
    4741                    .dwcfi  undefined, 0
    4742                    .dwcfi  undefined, 1
    4743                    .dwcfi  undefined, 2
    4744                    .dwcfi  undefined, 3
    4745                    .dwcfi  same_value, 4
    4746                    .dwcfi  same_value, 5
    4747                    .dwcfi  same_value, 6
    4748                    .dwcfi  same_value, 7
    4749                    .dwcfi  same_value, 8
    4750                    .dwcfi  same_value, 9
    4751                    .dwcfi  same_value, 10
    4752                    .dwcfi  undefined, 11
    4753                    .dwcfi  undefined, 12
    4754                    .dwcfi  undefined, 13
    4755                    .dwcfi  undefined, 14
    4756                    .dwcfi  undefined, 15
    4757                    .dwcfi  undefined, 16
    4758                    .dwendentry
    4759            
    4760            ;***************************************************************
    4761            ;* DWARF REGISTER MAP                                          *
    4762            ;***************************************************************
    4763            
    4764            $C$DW$423       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("PC")
    4765                    .dwattr $C$DW$423, DW_AT_location[DW_OP_reg0]
    4766            $C$DW$424       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SP")
    4767                    .dwattr $C$DW$424, DW_AT_location[DW_OP_reg1]
    4768            $C$DW$425       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SR")
    4769                    .dwattr $C$DW$425, DW_AT_location[DW_OP_reg2]
    4770            $C$DW$426       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("CG")
    4771                    .dwattr $C$DW$426, DW_AT_location[DW_OP_reg3]
    4772            $C$DW$427       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r4")
    4773                    .dwattr $C$DW$427, DW_AT_location[DW_OP_reg4]
    4774            $C$DW$428       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r5")
    4775                    .dwattr $C$DW$428, DW_AT_location[DW_OP_reg5]
    4776            $C$DW$429       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r6")
    4777                    .dwattr $C$DW$429, DW_AT_location[DW_OP_reg6]
    4778            $C$DW$430       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r7")
    4779                    .dwattr $C$DW$430, DW_AT_location[DW_OP_reg7]
    4780            $C$DW$431       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r8")
    4781                    .dwattr $C$DW$431, DW_AT_location[DW_OP_reg8]
    4782            $C$DW$432       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r9")
