MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                             PC v4.2.1 *
       3            ;* Date/Time created: Fri Mar 21 13:42:37 2014                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=coffabi --hll_source=on --mem_model:code=large --mem_model:data=small --o
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Bas
       9                    .dwattr $C$DW$CU, DW_AT_producer("MSP430 C/C++ Codegen PC v4.2.1 Copyright (c) 2003-2013 Texas
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\409010855\Documents\GitHub\CHARM\Embedded_Voltmeter
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("memcpy")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("memcpy")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$3)

    3779            ;* --------------------------------------------------------------------------*
    3780                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    3781 000058 0AC8          MOVA      r10,r8                ; [] |328| 
    3782 00005a B038          BIT.W     #32768,r8             ; [] |328| 
         00005c 8000 
    3783 00005e 7909          SUBC.W    r9,r9                 ; [] |328| 
    3784 000060 E339          INV.W     r9                    ; [] |328| 
    3785 000062 430E          MOV.W     #0,r14                ; [] |328| 
    3786                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    3787 000064 3C01          JMP       $C$L58                ; [] |329| 
    3788                                                      ; [] |329| 
    3789            ;* --------------------------------------------------------------------------*
    3790 000066       $C$L57:    
    3791                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    3792 000066 431E          MOV.W     #1,r14                ; [] |332| 
    3793            ;* --------------------------------------------------------------------------*
    3794 000068       $C$L58:    
    3795 000068 08CC          MOVA      r8,r12                ; [] |332| 
    3796 00006a 09CD          MOVA      r9,r13                ; [] |332| 
    3797 00006c 430F          MOV.W     #0,r15                ; [] |332| 
    3798            $C$DW$357       .dwtag  DW_TAG_TI_branch
    3799                    .dwattr $C$DW$357, DW_AT_low_pc(0x00)
    3800                    .dwattr $C$DW$357, DW_AT_name("set_socket_active_status")
    3801                    .dwattr $C$DW$357, DW_AT_TI_call
    3802 00006e 13B0!         CALLA     #set_socket_active_status ; [] |332| 
         000070 0000 
    3803                                                      ; [] |332| 
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE   77

    3804                    .dwpsn  file "C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Basic WiFi Source/S
    3805 000072 0ACC          MOVA      r10,r12               ; [] |335| 
    3806 000074 B03C          BIT.W     #32768,r12            ; [] |335| 
         000076 8000 
    3807 000078 7D0D          SUBC.W    r13,r13               ; [] |335| 
    3808 00007a E33D          INV.W     r13                   ; [] |335| 
    3809 00007c 5031          ADD.W     #24,SP                ; [] 
         00007e 0018 
    3810                    .dwcfi  cfa_offset, 24
    3811 000080 1646          POPM.A    #5,r10                ; [] 
    3812                    .dwcfi  restore_reg, 6
    3813                    .dwcfi  restore_reg, 7
    3814                    .dwcfi  restore_reg, 8
    3815                    .dwcfi  restore_reg, 9
    3816                    .dwcfi  restore_reg, 10
    3817                    .dwcfi  cfa_offset, 4
    3818            $C$DW$358       .dwtag  DW_TAG_TI_branch
    3819                    .dwattr $C$DW$358, DW_AT_low_pc(0x00)
    3820                    .dwattr $C$DW$358, DW_AT_TI_return
    3821 000082 0110          RETA      ; [] 
    3822                    ; [] 
    3823                    .dwattr $C$DW$344, DW_AT_TI_end_file("C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltm
    3824                    .dwattr $C$DW$344, DW_AT_TI_end_line(0x150)
    3825                    .dwattr $C$DW$344, DW_AT_TI_end_column(0x01)
    3826                    .dwendentry
    3827                    .dwendtag $C$DW$344
    3828            
    3829            ;*****************************************************************************
    3830            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    3831            ;*****************************************************************************
    3832                    .global SimpleLinkWaitEvent
    3833                    .global SimpleLinkWaitData
    3834                    .global UINT32_TO_STREAM_f
    3835                    .global hci_command_send
    3836                    .global hci_data_send
    3837                    .global set_socket_active_status
    3838                    .global get_socket_active_status
    3839                    .global _Errno
    3840                    .global tSLInformation
    3841                    .global memcpy
    3842                    .global L_LSL_8
    3843            
    3844            ;******************************************************************************
    3845            ;* BUILD ATTRIBUTES                                                           *
    3846            ;******************************************************************************
    3847                    .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
    3848            
    3849            ;******************************************************************************
    3850            ;* TYPE INFORMATION                                                           *
    3851            ;******************************************************************************
    3852            
    3853            $C$DW$T$22      .dwtag  DW_TAG_structure_type
    3854                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    3855            $C$DW$359       .dwtag  DW_TAG_member
    3856                    .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$21)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE   78

    3857                    .dwattr $C$DW$359, DW_AT_name("fds_bits")
    3858                    .dwattr $C$DW$359, DW_AT_TI_symbol_name("fds_bits")
    3859                    .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3860                    .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    3861                    .dwendtag $C$DW$T$22
    3862            
    3863            $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("fd_set")
    3864                    .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$22)
    3865                    .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3866            $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    3867                    .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    3868                    .dwattr $C$DW$T$65, DW_AT_address_class(0x10)
    3869            $C$DW$T$66      .dwtag  DW_TAG_const_type
    3870                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    3871            
    3872            $C$DW$T$49      .dwtag  DW_TAG_structure_type
    3873                    .dwattr $C$DW$T$49, DW_AT_byte_size(0x3e)
    3874            $C$DW$360       .dwtag  DW_TAG_member
    3875                    .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$23)
    3876                    .dwattr $C$DW$360, DW_AT_name("usRxEventOpcode")
    3877                    .dwattr $C$DW$360, DW_AT_TI_symbol_name("usRxEventOpcode")
    3878                    .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3879                    .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    3880            $C$DW$361       .dwtag  DW_TAG_member
    3881                    .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$23)
    3882                    .dwattr $C$DW$361, DW_AT_name("usEventOrDataReceived")
    3883                    .dwattr $C$DW$361, DW_AT_TI_symbol_name("usEventOrDataReceived")
    3884                    .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3885                    .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    3886            $C$DW$362       .dwtag  DW_TAG_member
    3887                    .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$25)
    3888                    .dwattr $C$DW$362, DW_AT_name("pucReceivedData")
    3889                    .dwattr $C$DW$362, DW_AT_TI_symbol_name("pucReceivedData")
    3890                    .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3891                    .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    3892            $C$DW$363       .dwtag  DW_TAG_member
    3893                    .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$25)
    3894                    .dwattr $C$DW$363, DW_AT_name("pucTxCommandBuffer")
    3895                    .dwattr $C$DW$363, DW_AT_TI_symbol_name("pucTxCommandBuffer")
    3896                    .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3897                    .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    3898            $C$DW$364       .dwtag  DW_TAG_member
    3899                    .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$33)
    3900                    .dwattr $C$DW$364, DW_AT_name("sFWPatches")
    3901                    .dwattr $C$DW$364, DW_AT_TI_symbol_name("sFWPatches")
    3902                    .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3903                    .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    3904            $C$DW$365       .dwtag  DW_TAG_member
    3905                    .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$34)
    3906                    .dwattr $C$DW$365, DW_AT_name("sDriverPatches")
    3907                    .dwattr $C$DW$365, DW_AT_TI_symbol_name("sDriverPatches")
    3908                    .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3909                    .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    3910            $C$DW$366       .dwtag  DW_TAG_member
    3911                    .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$35)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE   79

    3912                    .dwattr $C$DW$366, DW_AT_name("sBootLoaderPatches")
    3913                    .dwattr $C$DW$366, DW_AT_TI_symbol_name("sBootLoaderPatches")
    3914                    .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3915                    .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    3916            $C$DW$367       .dwtag  DW_TAG_member
    3917                    .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$38)
    3918                    .dwattr $C$DW$367, DW_AT_name("sWlanCB")
    3919                    .dwattr $C$DW$367, DW_AT_TI_symbol_name("sWlanCB")
    3920                    .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3921                    .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    3922            $C$DW$368       .dwtag  DW_TAG_member
    3923                    .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$41)
    3924                    .dwattr $C$DW$368, DW_AT_name("ReadWlanInterruptPin")
    3925                    .dwattr $C$DW$368, DW_AT_TI_symbol_name("ReadWlanInterruptPin")
    3926                    .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3927                    .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    3928            $C$DW$369       .dwtag  DW_TAG_member
    3929                    .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$44)
    3930                    .dwattr $C$DW$369, DW_AT_name("WlanInterruptEnable")
    3931                    .dwattr $C$DW$369, DW_AT_TI_symbol_name("WlanInterruptEnable")
    3932                    .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3933                    .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    3934            $C$DW$370       .dwtag  DW_TAG_member
    3935                    .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$45)
    3936                    .dwattr $C$DW$370, DW_AT_name("WlanInterruptDisable")
    3937                    .dwattr $C$DW$370, DW_AT_TI_symbol_name("WlanInterruptDisable")
    3938                    .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3939                    .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    3940            $C$DW$371       .dwtag  DW_TAG_member
    3941                    .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$48)
    3942                    .dwattr $C$DW$371, DW_AT_name("WriteWlanPin")
    3943                    .dwattr $C$DW$371, DW_AT_TI_symbol_name("WriteWlanPin")
    3944                    .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3945                    .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    3946            $C$DW$372       .dwtag  DW_TAG_member
    3947                    .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
    3948                    .dwattr $C$DW$372, DW_AT_name("slTransmitDataError")
    3949                    .dwattr $C$DW$372, DW_AT_TI_symbol_name("slTransmitDataError")
    3950                    .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3951                    .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    3952            $C$DW$373       .dwtag  DW_TAG_member
    3953                    .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
    3954                    .dwattr $C$DW$373, DW_AT_name("usNumberOfFreeBuffers")
    3955                    .dwattr $C$DW$373, DW_AT_TI_symbol_name("usNumberOfFreeBuffers")
    3956                    .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3957                    .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    3958            $C$DW$374       .dwtag  DW_TAG_member
    3959                    .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$23)
    3960                    .dwattr $C$DW$374, DW_AT_name("usSlBufferLength")
    3961                    .dwattr $C$DW$374, DW_AT_TI_symbol_name("usSlBufferLength")
    3962                    .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3963                    .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    3964            $C$DW$375       .dwtag  DW_TAG_member
    3965                    .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$23)
    3966                    .dwattr $C$DW$375, DW_AT_name("usBufferSize")
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE   80

    3967                    .dwattr $C$DW$375, DW_AT_TI_symbol_name("usBufferSize")
    3968                    .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3969                    .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    3970            $C$DW$376       .dwtag  DW_TAG_member
    3971                    .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$23)
    3972                    .dwattr $C$DW$376, DW_AT_name("usRxDataPending")
    3973                    .dwattr $C$DW$376, DW_AT_TI_symbol_name("usRxDataPending")
    3974                    .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3975                    .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    3976            $C$DW$377       .dwtag  DW_TAG_member
    3977                    .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$29)
    3978                    .dwattr $C$DW$377, DW_AT_name("NumberOfSentPackets")
    3979                    .dwattr $C$DW$377, DW_AT_TI_symbol_name("NumberOfSentPackets")
    3980                    .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3981                    .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    3982            $C$DW$378       .dwtag  DW_TAG_member
    3983                    .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$29)
    3984                    .dwattr $C$DW$378, DW_AT_name("NumberOfReleasedPackets")
    3985                    .dwattr $C$DW$378, DW_AT_TI_symbol_name("NumberOfReleasedPackets")
    3986                    .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3987                    .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    3988            $C$DW$379       .dwtag  DW_TAG_member
    3989                    .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$24)
    3990                    .dwattr $C$DW$379, DW_AT_name("InformHostOnTxComplete")
    3991                    .dwattr $C$DW$379, DW_AT_TI_symbol_name("InformHostOnTxComplete")
    3992                    .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3993                    .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    3994                    .dwendtag $C$DW$T$49
    3995            
    3996            $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("sSimplLinkInformation")
    3997                    .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$49)
    3998                    .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    3999            $C$DW$T$69      .dwtag  DW_TAG_volatile_type
    4000                    .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    4001            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4002                    .dwattr $C$DW$T$3, DW_AT_address_class(0x10)
    4003            $C$DW$T$74      .dwtag  DW_TAG_const_type
    4004                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$3)
    4005            
    4006            $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    4007                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4008            $C$DW$380       .dwtag  DW_TAG_formal_parameter
    4009                    .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
    4010            $C$DW$381       .dwtag  DW_TAG_formal_parameter
    4011                    .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$28)
    4012            $C$DW$382       .dwtag  DW_TAG_formal_parameter
    4013                    .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$24)
    4014                    .dwendtag $C$DW$T$36
    4015            
    4016            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4017                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    4018                    .dwattr $C$DW$T$37, DW_AT_address_class(0x14)
    4019            $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanCB")
    4020                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4021                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE   81

    4022            
    4023            $C$DW$T$42      .dwtag  DW_TAG_subroutine_type
    4024                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4025            $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4026                    .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
    4027                    .dwattr $C$DW$T$43, DW_AT_address_class(0x14)
    4028            $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptDisable")
    4029                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$43)
    4030                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4031            $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptEnable")
    4032                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4033                    .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4034            
    4035            $C$DW$T$46      .dwtag  DW_TAG_subroutine_type
    4036                    .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4037            $C$DW$383       .dwtag  DW_TAG_formal_parameter
    4038                    .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$24)
    4039                    .dwendtag $C$DW$T$46
    4040            
    4041            $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    4042                    .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    4043                    .dwattr $C$DW$T$47, DW_AT_address_class(0x14)
    4044            $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("tWriteWlanPin")
    4045                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    4046                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4047            $C$DW$T$70      .dwtag  DW_TAG_const_type
    4048            $C$DW$T$71      .dwtag  DW_TAG_pointer_type
    4049                    .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    4050                    .dwattr $C$DW$T$71, DW_AT_address_class(0x10)
    4051            $C$DW$T$75      .dwtag  DW_TAG_const_type
    4052                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$71)
    4053            $C$DW$T$4       .dwtag  DW_TAG_base_type
    4054                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4055                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    4056                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4057            $C$DW$T$5       .dwtag  DW_TAG_base_type
    4058                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4059                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4060                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4061            $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("INT8")
    4062                    .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$5)
    4063                    .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    4064            $C$DW$T$6       .dwtag  DW_TAG_base_type
    4065                    .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4066                    .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4067                    .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4068            $C$DW$T$24      .dwtag  DW_TAG_typedef, DW_AT_name("UINT8")
    4069                    .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$6)
    4070                    .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    4071            $C$DW$T$84      .dwtag  DW_TAG_const_type
    4072                    .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$24)
    4073            $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    4074                    .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    4075                    .dwattr $C$DW$T$85, DW_AT_address_class(0x10)
    4076            $C$DW$T$25      .dwtag  DW_TAG_pointer_type
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE   82

    4077                    .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    4078                    .dwattr $C$DW$T$25, DW_AT_address_class(0x10)
    4079            
    4080            $C$DW$T$53      .dwtag  DW_TAG_array_type
    4081                    .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$24)
    4082                    .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4083                    .dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
    4084            $C$DW$384       .dwtag  DW_TAG_subrange_type
    4085                    .dwattr $C$DW$384, DW_AT_upper_bound(0x03)
    4086                    .dwendtag $C$DW$T$53
    4087            
    4088            
    4089            $C$DW$T$57      .dwtag  DW_TAG_array_type
    4090                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$24)
    4091                    .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4092                    .dwattr $C$DW$T$57, DW_AT_byte_size(0x0e)
    4093            $C$DW$385       .dwtag  DW_TAG_subrange_type
    4094                    .dwattr $C$DW$385, DW_AT_upper_bound(0x0d)
    4095                    .dwendtag $C$DW$T$57
    4096            
    4097            $C$DW$T$87      .dwtag  DW_TAG_pointer_type
    4098                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$6)
    4099                    .dwattr $C$DW$T$87, DW_AT_address_class(0x10)
    4100            $C$DW$T$91      .dwtag  DW_TAG_const_type
    4101                    .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$87)
    4102            $C$DW$T$7       .dwtag  DW_TAG_base_type
    4103                    .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4104                    .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4105                    .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4106            $C$DW$T$8       .dwtag  DW_TAG_base_type
    4107                    .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4108                    .dwattr $C$DW$T$8, DW_AT_name("short")
    4109                    .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    4110            $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("INT16")
    4111                    .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$8)
    4112                    .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    4113            $C$DW$T$93      .dwtag  DW_TAG_const_type
    4114                    .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$92)
    4115            $C$DW$T$9       .dwtag  DW_TAG_base_type
    4116                    .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4117                    .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4118                    .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    4119            $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("UINT16")
    4120                    .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$9)
    4121                    .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    4122            $C$DW$T$113     .dwtag  DW_TAG_const_type
    4123                    .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$23)
    4124            $C$DW$T$10      .dwtag  DW_TAG_base_type
    4125                    .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4126                    .dwattr $C$DW$T$10, DW_AT_name("int")
    4127                    .dwattr $C$DW$T$10, DW_AT_byte_size(0x02)
    4128            $C$DW$T$11      .dwtag  DW_TAG_base_type
    4129                    .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4130                    .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4131                    .dwattr $C$DW$T$11, DW_AT_byte_size(0x02)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE   83

    4132            $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    4133                    .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$11)
    4134                    .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4135            $C$DW$T$12      .dwtag  DW_TAG_base_type
    4136                    .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4137                    .dwattr $C$DW$T$12, DW_AT_name("long")
    4138                    .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    4139            $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("INT32")
    4140                    .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$12)
    4141                    .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4142            $C$DW$T$139     .dwtag  DW_TAG_const_type
    4143                    .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$19)
    4144            
    4145            $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    4146                    .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$19)
    4147                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4148            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    4149                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4150                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    4151            $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanReadInteruptPin")
    4152                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    4153                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4154            $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("__fd_mask")
    4155                    .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    4156                    .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4157            
    4158            $C$DW$T$21      .dwtag  DW_TAG_array_type
    4159                    .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    4160                    .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    4161                    .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    4162            $C$DW$386       .dwtag  DW_TAG_subrange_type
    4163                    .dwattr $C$DW$386, DW_AT_upper_bound(0x00)
    4164                    .dwendtag $C$DW$T$21
    4165            
    4166            $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("suseconds_t")
    4167                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$19)
    4168                    .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4169            $C$DW$T$59      .dwtag  DW_TAG_typedef, DW_AT_name("time_t")
    4170                    .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$19)
    4171                    .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    4172            $C$DW$T$13      .dwtag  DW_TAG_base_type
    4173                    .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4174                    .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4175                    .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    4176            $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("UINT32")
    4177                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$13)
    4178                    .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4179            $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    4180                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    4181                    .dwattr $C$DW$T$30, DW_AT_address_class(0x10)
    4182            $C$DW$T$155     .dwtag  DW_TAG_const_type
    4183                    .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$30)
    4184            $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("socklen_t")
    4185                    .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$29)
    4186                    .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE   84

    4187            $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    4188                    .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$99)
    4189                    .dwattr $C$DW$T$101, DW_AT_address_class(0x10)
    4190            $C$DW$T$157     .dwtag  DW_TAG_const_type
    4191                    .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$101)
    4192            $C$DW$T$158     .dwtag  DW_TAG_const_type
    4193                    .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$99)
    4194            $C$DW$T$14      .dwtag  DW_TAG_base_type
    4195                    .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4196                    .dwattr $C$DW$T$14, DW_AT_name("long long")
    4197                    .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    4198            $C$DW$T$15      .dwtag  DW_TAG_base_type
    4199                    .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4200                    .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4201                    .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    4202            $C$DW$T$16      .dwtag  DW_TAG_base_type
    4203                    .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4204                    .dwattr $C$DW$T$16, DW_AT_name("float")
    4205                    .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    4206            $C$DW$T$17      .dwtag  DW_TAG_base_type
    4207                    .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4208                    .dwattr $C$DW$T$17, DW_AT_name("double")
    4209                    .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    4210            $C$DW$T$18      .dwtag  DW_TAG_base_type
    4211                    .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4212                    .dwattr $C$DW$T$18, DW_AT_name("long double")
    4213                    .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    4214            $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("CHAR")
    4215                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
    4216                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4217            $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    4218                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    4219                    .dwattr $C$DW$T$28, DW_AT_address_class(0x10)
    4220            
    4221            $C$DW$T$31      .dwtag  DW_TAG_subroutine_type
    4222                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    4223                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4224            $C$DW$387       .dwtag  DW_TAG_formal_parameter
    4225                    .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$30)
    4226                    .dwendtag $C$DW$T$31
    4227            
    4228            $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    4229                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    4230                    .dwattr $C$DW$T$32, DW_AT_address_class(0x14)
    4231            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("tBootLoaderPatches")
    4232                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$32)
    4233                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4234            $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("tDriverPatches")
    4235                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$32)
    4236                    .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4237            $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("tFWPatches")
    4238                    .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4239                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4240            $C$DW$T$164     .dwtag  DW_TAG_const_type
    4241                    .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$28)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE   85

    4242            
    4243            $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4244                    .dwattr $C$DW$T$51, DW_AT_name("_bsd_accept_return_t")
    4245                    .dwattr $C$DW$T$51, DW_AT_byte_size(0x18)
    4246            $C$DW$388       .dwtag  DW_TAG_member
    4247                    .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
    4248                    .dwattr $C$DW$388, DW_AT_name("iSocketDescriptor")
    4249                    .dwattr $C$DW$388, DW_AT_TI_symbol_name("iSocketDescriptor")
    4250                    .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4251                    .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4252            $C$DW$389       .dwtag  DW_TAG_member
    4253                    .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
    4254                    .dwattr $C$DW$389, DW_AT_name("iStatus")
    4255                    .dwattr $C$DW$389, DW_AT_TI_symbol_name("iStatus")
    4256                    .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4257                    .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4258            $C$DW$390       .dwtag  DW_TAG_member
    4259                    .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$50)
    4260                    .dwattr $C$DW$390, DW_AT_name("tSocketAddress")
    4261                    .dwattr $C$DW$390, DW_AT_TI_symbol_name("tSocketAddress")
    4262                    .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4263                    .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4264                    .dwendtag $C$DW$T$51
    4265            
    4266            $C$DW$T$166     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdReturnParams")
    4267                    .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$51)
    4268                    .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    4269            
    4270            $C$DW$T$52      .dwtag  DW_TAG_structure_type
    4271                    .dwattr $C$DW$T$52, DW_AT_name("_bsd_gethostbyname_return_t")
    4272                    .dwattr $C$DW$T$52, DW_AT_byte_size(0x08)
    4273            $C$DW$391       .dwtag  DW_TAG_member
    4274                    .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$19)
    4275                    .dwattr $C$DW$391, DW_AT_name("retVal")
    4276                    .dwattr $C$DW$391, DW_AT_TI_symbol_name("retVal")
    4277                    .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4278                    .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4279            $C$DW$392       .dwtag  DW_TAG_member
    4280                    .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$19)
    4281                    .dwattr $C$DW$392, DW_AT_name("outputAddress")
    4282                    .dwattr $C$DW$392, DW_AT_TI_symbol_name("outputAddress")
    4283                    .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4284                    .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4285                    .dwendtag $C$DW$T$52
    4286            
    4287            $C$DW$T$168     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdGethostbynameParams")
    4288                    .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$52)
    4289                    .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    4290            
    4291            $C$DW$T$54      .dwtag  DW_TAG_structure_type
    4292                    .dwattr $C$DW$T$54, DW_AT_name("_bsd_getsockopt_return_t")
    4293                    .dwattr $C$DW$T$54, DW_AT_byte_size(0x05)
    4294            $C$DW$393       .dwtag  DW_TAG_member
    4295                    .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$53)
    4296                    .dwattr $C$DW$393, DW_AT_name("ucOptValue")
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE   86

    4297                    .dwattr $C$DW$393, DW_AT_TI_symbol_name("ucOptValue")
    4298                    .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4299                    .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4300            $C$DW$394       .dwtag  DW_TAG_member
    4301                    .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$27)
    4302                    .dwattr $C$DW$394, DW_AT_name("iStatus")
    4303                    .dwattr $C$DW$394, DW_AT_TI_symbol_name("iStatus")
    4304                    .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4305                    .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4306                    .dwendtag $C$DW$T$54
    4307            
    4308            $C$DW$T$170     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdGetSockOptReturnParams")
    4309                    .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$54)
    4310                    .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
    4311            
    4312            $C$DW$T$55      .dwtag  DW_TAG_structure_type
    4313                    .dwattr $C$DW$T$55, DW_AT_name("_bsd_read_return_t")
    4314                    .dwattr $C$DW$T$55, DW_AT_byte_size(0x0c)
    4315            $C$DW$395       .dwtag  DW_TAG_member
    4316                    .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
    4317                    .dwattr $C$DW$395, DW_AT_name("iSocketDescriptor")
    4318                    .dwattr $C$DW$395, DW_AT_TI_symbol_name("iSocketDescriptor")
    4319                    .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4320                    .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    4321            $C$DW$396       .dwtag  DW_TAG_member
    4322                    .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
    4323                    .dwattr $C$DW$396, DW_AT_name("iNumberOfBytes")
    4324                    .dwattr $C$DW$396, DW_AT_TI_symbol_name("iNumberOfBytes")
    4325                    .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4326                    .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    4327            $C$DW$397       .dwtag  DW_TAG_member
    4328                    .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$29)
    4329                    .dwattr $C$DW$397, DW_AT_name("uiFlags")
    4330                    .dwattr $C$DW$397, DW_AT_TI_symbol_name("uiFlags")
    4331                    .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4332                    .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    4333                    .dwendtag $C$DW$T$55
    4334            
    4335            $C$DW$T$172     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdReadReturnParams")
    4336                    .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$55)
    4337                    .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    4338            
    4339            $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4340                    .dwattr $C$DW$T$56, DW_AT_name("_bsd_select_return_t")
    4341                    .dwattr $C$DW$T$56, DW_AT_byte_size(0x10)
    4342            $C$DW$398       .dwtag  DW_TAG_member
    4343                    .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
    4344                    .dwattr $C$DW$398, DW_AT_name("iStatus")
    4345                    .dwattr $C$DW$398, DW_AT_TI_symbol_name("iStatus")
    4346                    .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4347                    .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    4348            $C$DW$399       .dwtag  DW_TAG_member
    4349                    .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$29)
    4350                    .dwattr $C$DW$399, DW_AT_name("uiRdfd")
    4351                    .dwattr $C$DW$399, DW_AT_TI_symbol_name("uiRdfd")
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE   87

    4352                    .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4353                    .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    4354            $C$DW$400       .dwtag  DW_TAG_member
    4355                    .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$29)
    4356                    .dwattr $C$DW$400, DW_AT_name("uiWrfd")
    4357                    .dwattr $C$DW$400, DW_AT_TI_symbol_name("uiWrfd")
    4358                    .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4359                    .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    4360            $C$DW$401       .dwtag  DW_TAG_member
    4361                    .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$29)
    4362                    .dwattr $C$DW$401, DW_AT_name("uiExfd")
    4363                    .dwattr $C$DW$401, DW_AT_TI_symbol_name("uiExfd")
    4364                    .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4365                    .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    4366                    .dwendtag $C$DW$T$56
    4367            
    4368            $C$DW$T$174     .dwtag  DW_TAG_typedef, DW_AT_name("tBsdSelectRecvParams")
    4369                    .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$56)
    4370                    .dwattr $C$DW$T$174, DW_AT_language(DW_LANG_C)
    4371            
    4372            $C$DW$T$58      .dwtag  DW_TAG_structure_type
    4373                    .dwattr $C$DW$T$58, DW_AT_name("_sockaddr_t")
    4374                    .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    4375            $C$DW$402       .dwtag  DW_TAG_member
    4376                    .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$23)
    4377                    .dwattr $C$DW$402, DW_AT_name("sa_family")
    4378                    .dwattr $C$DW$402, DW_AT_TI_symbol_name("sa_family")
    4379                    .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4380                    .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    4381            $C$DW$403       .dwtag  DW_TAG_member
    4382                    .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$57)
    4383                    .dwattr $C$DW$403, DW_AT_name("sa_data")
    4384                    .dwattr $C$DW$403, DW_AT_TI_symbol_name("sa_data")
    4385                    .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4386                    .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    4387                    .dwendtag $C$DW$T$58
    4388            
    4389            $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("sockaddr")
    4390                    .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$58)
    4391                    .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4392            $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    4393                    .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$50)
    4394                    .dwattr $C$DW$T$103, DW_AT_address_class(0x10)
    4395            $C$DW$T$180     .dwtag  DW_TAG_const_type
    4396                    .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$103)
    4397            $C$DW$T$107     .dwtag  DW_TAG_const_type
    4398                    .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$50)
    4399            $C$DW$T$108     .dwtag  DW_TAG_pointer_type
    4400                    .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    4401                    .dwattr $C$DW$T$108, DW_AT_address_class(0x10)
    4402            $C$DW$T$181     .dwtag  DW_TAG_const_type
    4403                    .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$108)
    4404            
    4405            $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4406                    .dwattr $C$DW$T$61, DW_AT_name("timeval")
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE   88

    4407                    .dwattr $C$DW$T$61, DW_AT_byte_size(0x08)
    4408            $C$DW$404       .dwtag  DW_TAG_member
    4409                    .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$59)
    4410                    .dwattr $C$DW$404, DW_AT_name("tv_sec")
    4411                    .dwattr $C$DW$404, DW_AT_TI_symbol_name("tv_sec")
    4412                    .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4413                    .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4414            $C$DW$405       .dwtag  DW_TAG_member
    4415                    .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$60)
    4416                    .dwattr $C$DW$405, DW_AT_name("tv_usec")
    4417                    .dwattr $C$DW$405, DW_AT_TI_symbol_name("tv_usec")
    4418                    .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4419                    .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4420                    .dwendtag $C$DW$T$61
    4421            
    4422            $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    4423                    .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$61)
    4424                    .dwattr $C$DW$T$97, DW_AT_address_class(0x10)
    4425            $C$DW$T$182     .dwtag  DW_TAG_const_type
    4426                    .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$97)
    4427                    .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4428            
    4429            ;***************************************************************
    4430            ;* DWARF CIE ENTRIES                                           *
    4431            ;***************************************************************
    4432            
    4433            $C$DW$CIE       .dwcie 16
    4434                    .dwcfi  cfa_register, 1
    4435                    .dwcfi  cfa_offset, 0
    4436                    .dwcfi  undefined, 0
    4437                    .dwcfi  undefined, 1
    4438                    .dwcfi  undefined, 2
    4439                    .dwcfi  undefined, 3
    4440                    .dwcfi  same_value, 4
    4441                    .dwcfi  same_value, 5
    4442                    .dwcfi  same_value, 6
    4443                    .dwcfi  same_value, 7
    4444                    .dwcfi  same_value, 8
    4445                    .dwcfi  same_value, 9
    4446                    .dwcfi  same_value, 10
    4447                    .dwcfi  undefined, 11
    4448                    .dwcfi  undefined, 12
    4449                    .dwcfi  undefined, 13
    4450                    .dwcfi  undefined, 14
    4451                    .dwcfi  undefined, 15
    4452                    .dwcfi  undefined, 16
    4453                    .dwendentry
    4454            
    4455            ;***************************************************************
    4456            ;* DWARF REGISTER MAP                                          *
    4457            ;***************************************************************
    4458            
    4459            $C$DW$406       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("PC")
    4460                    .dwattr $C$DW$406, DW_AT_location[DW_OP_reg0]
    4461            $C$DW$407       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SP")
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:37 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0310410                         PAGE   89

    4462                    .dwattr $C$DW$407, DW_AT_location[DW_OP_reg1]
    4463            $C$DW$408       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SR")
    4464                    .dwattr $C$DW$408, DW_AT_location[DW_OP_reg2]
    4465            $C$DW$409       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("CG")
    4466                    .dwattr $C$DW$409, DW_AT_location[DW_OP_reg3]
    4467            $C$DW$410       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r4")
    4468                    .dwattr $C$DW$410, DW_AT_location[DW_OP_reg4]
    4469            $C$DW$411       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r5")
    4470                    .dwattr $C$DW$411, DW_AT_location[DW_OP_reg5]
    4471            $C$DW$412       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r6")
    4472                    .dwattr $C$DW$412, DW_AT_location[DW_OP_reg6]
    4473            $C$DW$413       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r7")
    4474                    .dwattr $C$DW$413, DW_AT_location[DW_OP_reg7]
    4475            $C$DW$414       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r8")
    4476                    .dwattr $C$DW$414, DW_AT_location[DW_OP_reg8]
    4477            $C$DW$415       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r9")
