MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0500410                            PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                             PC v4.1.9 *
       3            ;* Date/Time created: Tue Mar 25 16:18:27 2014                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=coffabi --hll_source=on --mem_model:code=large --mem_model:data=small --o
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source
       9                    .dwattr $C$DW$CU, DW_AT_producer("MSP430 C/C++ Codegen PC v4.1.9 Copyright (c) 2003-2014 Texas
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("E:\Dropbox\git\CHARM\Embedded_Voltmeter\Basic WiFi Source\Ba
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("strlen")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("strlen")
      15                    .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$57)

    4534 00004c 503E          ADD.W     #26,r14               ; [] |155| 
         00004e 001A 
    4535 000050 4E81          MOV.W     r14,4(SP)             ; [] |155| 
         000052 0004 
    4536 000054 4C0E          MOV.W     r12,r14               ; [] |155| 
    4537 000056 0E71          MOVX.A    r14,6(SP)             ; [] |155| 
         000058 0006 
    4538 00005a 403C          MOV.W     #3,r12                ; [] |155| 
         00005c 0003 
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0500410                            PAGE   92

    4539 00005e 430D          MOV.W     #0,r13                ; [] |155| 
    4540 000060 01CE          MOVA      SP,r14                ; [] |155| 
    4541 000062 503E          ADD.W     #10,r14               ; [] |155| 
         000064 000A 
    4542            $C$DW$402       .dwtag  DW_TAG_TI_branch
    4543                    .dwattr $C$DW$402, DW_AT_low_pc(0x00)
    4544                    .dwattr $C$DW$402, DW_AT_name("wlan_connect")
    4545                    .dwattr $C$DW$402, DW_AT_TI_call
    4546 000066 13B0!         CALLA     #wlan_connect         ; [] |155| 
         000068 0000 
    4547                                                      ; [] |155| 
    4548                    .dwpsn  file "E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Source/Source/CC3000HostDrive
    4549 00006a 5031          ADD.W     #42,SP                ; [] 
         00006c 002A 
    4550                    .dwcfi  cfa_offset, 8
    4551                    .dwcfi  restore_reg, 10
    4552 00006e 160A          POPM.A    #1,r10                ; [] 
    4553                    .dwcfi  cfa_offset, 4
    4554            $C$DW$403       .dwtag  DW_TAG_TI_branch
    4555                    .dwattr $C$DW$403, DW_AT_low_pc(0x00)
    4556                    .dwattr $C$DW$403, DW_AT_TI_return
    4557 000070 0110          RETA      ; [] 
    4558                    ; [] 
    4559                    .dwattr $C$DW$393, DW_AT_TI_end_file("E:/Dropbox/git/CHARM/Embedded_Voltmeter/Basic WiFi Sourc
    4560                    .dwattr $C$DW$393, DW_AT_TI_end_line(0x9c)
    4561                    .dwattr $C$DW$393, DW_AT_TI_end_column(0x01)
    4562                    .dwendentry
    4563                    .dwendtag $C$DW$393
    4564            
    4565            ;******************************************************************************
    4566            ;* STRINGS                                                                    *
    4567            ;******************************************************************************
    4568 000000               .sect   ".const:.string"
    4569                    .align  2
    4570 000000 0041  $C$SL1: .string "Animal House",0
         000001 006E 
         000002 0069 
         000003 006D 
         000004 0061 
         000005 006C 
         000006 0020 
         000007 0048 
         000008 006F 
         000009 0075 
         00000a 0073 
         00000b 0065 
         00000c 0000 
    4571                    .align  2
    4572 00000e 0061  $C$SL2: .string "ab123456",0
         00000f 0062 
         000010 0031 
         000011 0032 
         000012 0033 
         000013 0034 
         000014 0035 
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0500410                            PAGE   93

         000015 0036 
         000016 0000 
    4573            ;*****************************************************************************
    4574            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    4575            ;*****************************************************************************
    4576                    .global strlen
    4577                    .global memset
    4578                    .global SimpleLinkWaitEvent
    4579                    .global UINT32_TO_STREAM_f
    4580                    .global UINT16_TO_STREAM_f
    4581                    .global hci_command_send
    4582                    .global SpiOpen
    4583                    .global SpiClose
    4584                    .global socket
    4585                    .global inet_aton
    4586                    .global connect
    4587                    .global nvmem_read
    4588                    .global aes_decrypt
    4589                    .global aes_read_key
    4590                    .global hci_unsolicited_event_handler
    4591                    .global _Errno
    4592                    .global wlan_tx_buffer
    4593                    .global ulSocket
    4594                    .global __mpyi
    4595                    .global memcpy
    4596            
    4597            ;******************************************************************************
    4598            ;* BUILD ATTRIBUTES                                                           *
    4599            ;******************************************************************************
    4600                    .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
    4601            
    4602            ;******************************************************************************
    4603            ;* TYPE INFORMATION                                                           *
    4604            ;******************************************************************************
    4605            
    4606            $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4607                    .dwattr $C$DW$T$46, DW_AT_byte_size(0x3e)
    4608            $C$DW$404       .dwtag  DW_TAG_member
    4609                    .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
    4610                    .dwattr $C$DW$404, DW_AT_name("usRxEventOpcode")
    4611                    .dwattr $C$DW$404, DW_AT_TI_symbol_name("usRxEventOpcode")
    4612                    .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4613                    .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    4614            $C$DW$405       .dwtag  DW_TAG_member
    4615                    .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
    4616                    .dwattr $C$DW$405, DW_AT_name("usEventOrDataReceived")
    4617                    .dwattr $C$DW$405, DW_AT_TI_symbol_name("usEventOrDataReceived")
    4618                    .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4619                    .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    4620            $C$DW$406       .dwtag  DW_TAG_member
    4621                    .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$21)
    4622                    .dwattr $C$DW$406, DW_AT_name("pucReceivedData")
    4623                    .dwattr $C$DW$406, DW_AT_TI_symbol_name("pucReceivedData")
    4624                    .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4625                    .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0500410                            PAGE   94

    4626            $C$DW$407       .dwtag  DW_TAG_member
    4627                    .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$21)
    4628                    .dwattr $C$DW$407, DW_AT_name("pucTxCommandBuffer")
    4629                    .dwattr $C$DW$407, DW_AT_TI_symbol_name("pucTxCommandBuffer")
    4630                    .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4631                    .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    4632            $C$DW$408       .dwtag  DW_TAG_member
    4633                    .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$29)
    4634                    .dwattr $C$DW$408, DW_AT_name("sFWPatches")
    4635                    .dwattr $C$DW$408, DW_AT_TI_symbol_name("sFWPatches")
    4636                    .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4637                    .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    4638            $C$DW$409       .dwtag  DW_TAG_member
    4639                    .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$30)
    4640                    .dwattr $C$DW$409, DW_AT_name("sDriverPatches")
    4641                    .dwattr $C$DW$409, DW_AT_TI_symbol_name("sDriverPatches")
    4642                    .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4643                    .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    4644            $C$DW$410       .dwtag  DW_TAG_member
    4645                    .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$31)
    4646                    .dwattr $C$DW$410, DW_AT_name("sBootLoaderPatches")
    4647                    .dwattr $C$DW$410, DW_AT_TI_symbol_name("sBootLoaderPatches")
    4648                    .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4649                    .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    4650            $C$DW$411       .dwtag  DW_TAG_member
    4651                    .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$35)
    4652                    .dwattr $C$DW$411, DW_AT_name("sWlanCB")
    4653                    .dwattr $C$DW$411, DW_AT_TI_symbol_name("sWlanCB")
    4654                    .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4655                    .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    4656            $C$DW$412       .dwtag  DW_TAG_member
    4657                    .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$38)
    4658                    .dwattr $C$DW$412, DW_AT_name("ReadWlanInterruptPin")
    4659                    .dwattr $C$DW$412, DW_AT_TI_symbol_name("ReadWlanInterruptPin")
    4660                    .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4661                    .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    4662            $C$DW$413       .dwtag  DW_TAG_member
    4663                    .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$41)
    4664                    .dwattr $C$DW$413, DW_AT_name("WlanInterruptEnable")
    4665                    .dwattr $C$DW$413, DW_AT_TI_symbol_name("WlanInterruptEnable")
    4666                    .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4667                    .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    4668            $C$DW$414       .dwtag  DW_TAG_member
    4669                    .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$42)
    4670                    .dwattr $C$DW$414, DW_AT_name("WlanInterruptDisable")
    4671                    .dwattr $C$DW$414, DW_AT_TI_symbol_name("WlanInterruptDisable")
    4672                    .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4673                    .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    4674            $C$DW$415       .dwtag  DW_TAG_member
    4675                    .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$45)
    4676                    .dwattr $C$DW$415, DW_AT_name("WriteWlanPin")
    4677                    .dwattr $C$DW$415, DW_AT_TI_symbol_name("WriteWlanPin")
    4678                    .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4679                    .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    4680            $C$DW$416       .dwtag  DW_TAG_member
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0500410                            PAGE   95

    4681                    .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$32)
    4682                    .dwattr $C$DW$416, DW_AT_name("slTransmitDataError")
    4683                    .dwattr $C$DW$416, DW_AT_TI_symbol_name("slTransmitDataError")
    4684                    .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4685                    .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    4686            $C$DW$417       .dwtag  DW_TAG_member
    4687                    .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$19)
    4688                    .dwattr $C$DW$417, DW_AT_name("usNumberOfFreeBuffers")
    4689                    .dwattr $C$DW$417, DW_AT_TI_symbol_name("usNumberOfFreeBuffers")
    4690                    .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4691                    .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    4692            $C$DW$418       .dwtag  DW_TAG_member
    4693                    .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$19)
    4694                    .dwattr $C$DW$418, DW_AT_name("usSlBufferLength")
    4695                    .dwattr $C$DW$418, DW_AT_TI_symbol_name("usSlBufferLength")
    4696                    .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4697                    .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    4698            $C$DW$419       .dwtag  DW_TAG_member
    4699                    .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$19)
    4700                    .dwattr $C$DW$419, DW_AT_name("usBufferSize")
    4701                    .dwattr $C$DW$419, DW_AT_TI_symbol_name("usBufferSize")
    4702                    .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4703                    .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    4704            $C$DW$420       .dwtag  DW_TAG_member
    4705                    .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$19)
    4706                    .dwattr $C$DW$420, DW_AT_name("usRxDataPending")
    4707                    .dwattr $C$DW$420, DW_AT_TI_symbol_name("usRxDataPending")
    4708                    .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4709                    .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    4710            $C$DW$421       .dwtag  DW_TAG_member
    4711                    .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$25)
    4712                    .dwattr $C$DW$421, DW_AT_name("NumberOfSentPackets")
    4713                    .dwattr $C$DW$421, DW_AT_TI_symbol_name("NumberOfSentPackets")
    4714                    .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4715                    .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    4716            $C$DW$422       .dwtag  DW_TAG_member
    4717                    .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$25)
    4718                    .dwattr $C$DW$422, DW_AT_name("NumberOfReleasedPackets")
    4719                    .dwattr $C$DW$422, DW_AT_TI_symbol_name("NumberOfReleasedPackets")
    4720                    .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4721                    .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    4722            $C$DW$423       .dwtag  DW_TAG_member
    4723                    .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$20)
    4724                    .dwattr $C$DW$423, DW_AT_name("InformHostOnTxComplete")
    4725                    .dwattr $C$DW$423, DW_AT_TI_symbol_name("InformHostOnTxComplete")
    4726                    .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4727                    .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    4728                    .dwendtag $C$DW$T$46
    4729            
    4730            $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("sSimplLinkInformation")
    4731                    .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$46)
    4732                    .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4733            $C$DW$T$56      .dwtag  DW_TAG_volatile_type
    4734                    .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    4735            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0500410                            PAGE   96

    4736                    .dwattr $C$DW$T$3, DW_AT_address_class(0x10)
    4737            $C$DW$T$60      .dwtag  DW_TAG_const_type
    4738                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$3)
    4739            
    4740            $C$DW$T$33      .dwtag  DW_TAG_subroutine_type
    4741                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4742            $C$DW$424       .dwtag  DW_TAG_formal_parameter
    4743                    .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$32)
    4744            $C$DW$425       .dwtag  DW_TAG_formal_parameter
    4745                    .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$24)
    4746            $C$DW$426       .dwtag  DW_TAG_formal_parameter
    4747                    .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$20)
    4748                    .dwendtag $C$DW$T$33
    4749            
    4750            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4751                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4752                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    4753            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanCB")
    4754                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4755                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4756            $C$DW$T$63      .dwtag  DW_TAG_const_type
    4757                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$35)
    4758            
    4759            $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    4760                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4761            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    4762                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4763                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    4764            $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptDisable")
    4765                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    4766                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4767            $C$DW$T$66      .dwtag  DW_TAG_const_type
    4768                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$42)
    4769            $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptEnable")
    4770                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    4771                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4772            $C$DW$T$67      .dwtag  DW_TAG_const_type
    4773                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$41)
    4774            
    4775            $C$DW$T$43      .dwtag  DW_TAG_subroutine_type
    4776                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4777            $C$DW$427       .dwtag  DW_TAG_formal_parameter
    4778                    .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    4779                    .dwendtag $C$DW$T$43
    4780            
    4781            $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    4782                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4783                    .dwattr $C$DW$T$44, DW_AT_address_class(0x14)
    4784            $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("tWriteWlanPin")
    4785                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    4786                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4787            $C$DW$T$70      .dwtag  DW_TAG_const_type
    4788                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$45)
    4789            
    4790            $C$DW$T$73      .dwtag  DW_TAG_subroutine_type
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0500410                            PAGE   97

    4791                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    4792            $C$DW$428       .dwtag  DW_TAG_formal_parameter
    4793                    .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$3)
    4794                    .dwendtag $C$DW$T$73
    4795            
    4796            $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    4797                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    4798                    .dwattr $C$DW$T$74, DW_AT_address_class(0x14)
    4799            $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("gcSpiHandleRx")
    4800                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    4801                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4802            $C$DW$T$4       .dwtag  DW_TAG_base_type
    4803                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4804                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    4805                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4806            $C$DW$T$5       .dwtag  DW_TAG_base_type
    4807                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4808                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4809                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4810            $C$DW$T$6       .dwtag  DW_TAG_base_type
    4811                    .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4812                    .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4813                    .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4814            $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("UINT8")
    4815                    .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    4816                    .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4817            $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    4818                    .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    4819                    .dwattr $C$DW$T$21, DW_AT_address_class(0x10)
    4820            $C$DW$T$84      .dwtag  DW_TAG_const_type
    4821                    .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$21)
    4822            
    4823            $C$DW$T$52      .dwtag  DW_TAG_array_type
    4824                    .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$20)
    4825                    .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4826                    .dwattr $C$DW$T$52, DW_AT_byte_size(0x0e)
    4827            $C$DW$429       .dwtag  DW_TAG_subrange_type
    4828                    .dwattr $C$DW$429, DW_AT_upper_bound(0x0d)
    4829                    .dwendtag $C$DW$T$52
    4830            
    4831            
    4832            $C$DW$T$85      .dwtag  DW_TAG_array_type
    4833                    .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$20)
    4834                    .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4835                    .dwattr $C$DW$T$85, DW_AT_byte_size(0x10)
    4836            $C$DW$430       .dwtag  DW_TAG_subrange_type
    4837                    .dwattr $C$DW$430, DW_AT_upper_bound(0x0f)
    4838                    .dwendtag $C$DW$T$85
    4839            
    4840            
    4841            $C$DW$T$86      .dwtag  DW_TAG_array_type
    4842                    .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$20)
    4843                    .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    4844                    .dwattr $C$DW$T$86, DW_AT_byte_size(0x43)
    4845            $C$DW$431       .dwtag  DW_TAG_subrange_type
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0500410                            PAGE   98

    4846                    .dwattr $C$DW$431, DW_AT_upper_bound(0x42)
    4847                    .dwendtag $C$DW$T$86
    4848            
    4849            
    4850            $C$DW$T$87      .dwtag  DW_TAG_array_type
    4851                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$20)
    4852                    .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4853                    .dwattr $C$DW$T$87, DW_AT_byte_size(0x06)
    4854            $C$DW$432       .dwtag  DW_TAG_subrange_type
    4855                    .dwattr $C$DW$432, DW_AT_upper_bound(0x05)
    4856                    .dwendtag $C$DW$T$87
    4857            
    4858            $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    4859                    .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$6)
    4860                    .dwattr $C$DW$T$88, DW_AT_address_class(0x10)
    4861            
    4862            $C$DW$T$99      .dwtag  DW_TAG_array_type
    4863                    .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$6)
    4864                    .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    4865            $C$DW$433       .dwtag  DW_TAG_subrange_type
    4866                    .dwendtag $C$DW$T$99
    4867            
    4868            
    4869            $C$DW$T$100     .dwtag  DW_TAG_array_type
    4870                    .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$6)
    4871                    .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    4872                    .dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
    4873            $C$DW$434       .dwtag  DW_TAG_subrange_type
    4874                    .dwattr $C$DW$434, DW_AT_upper_bound(0x03)
    4875                    .dwendtag $C$DW$T$100
    4876            
    4877            $C$DW$T$101     .dwtag  DW_TAG_const_type
    4878                    .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$6)
    4879            
    4880            $C$DW$T$102     .dwtag  DW_TAG_array_type
    4881                    .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    4882                    .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    4883                    .dwattr $C$DW$T$102, DW_AT_byte_size(0x04)
    4884            $C$DW$435       .dwtag  DW_TAG_subrange_type
    4885                    .dwattr $C$DW$435, DW_AT_upper_bound(0x03)
    4886                    .dwendtag $C$DW$T$102
    4887            
    4888            $C$DW$T$7       .dwtag  DW_TAG_base_type
    4889                    .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4890                    .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4891                    .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4892            $C$DW$T$8       .dwtag  DW_TAG_base_type
    4893                    .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4894                    .dwattr $C$DW$T$8, DW_AT_name("short")
    4895                    .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    4896            $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("INT16")
    4897                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$8)
    4898                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4899            $C$DW$T$9       .dwtag  DW_TAG_base_type
    4900                    .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0500410                            PAGE   99

    4901                    .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4902                    .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    4903            $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("UINT16")
    4904                    .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    4905                    .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4906            $C$DW$T$114     .dwtag  DW_TAG_const_type
    4907                    .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$19)
    4908            $C$DW$T$10      .dwtag  DW_TAG_base_type
    4909                    .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4910                    .dwattr $C$DW$T$10, DW_AT_name("int")
    4911                    .dwattr $C$DW$T$10, DW_AT_byte_size(0x02)
    4912            $C$DW$T$11      .dwtag  DW_TAG_base_type
    4913                    .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4914                    .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4915                    .dwattr $C$DW$T$11, DW_AT_byte_size(0x02)
    4916            $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    4917                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$11)
    4918                    .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4919            $C$DW$T$12      .dwtag  DW_TAG_base_type
    4920                    .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4921                    .dwattr $C$DW$T$12, DW_AT_name("long")
    4922                    .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    4923            $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("INT32")
    4924                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$12)
    4925                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    4926            $C$DW$T$128     .dwtag  DW_TAG_const_type
    4927                    .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$32)
    4928            
    4929            $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    4930                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$32)
    4931                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4932            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4933                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    4934                    .dwattr $C$DW$T$37, DW_AT_address_class(0x14)
    4935            $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanReadInteruptPin")
    4936                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4937                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4938            $C$DW$T$129     .dwtag  DW_TAG_const_type
    4939                    .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$38)
    4940            $C$DW$T$143     .dwtag  DW_TAG_volatile_type
    4941                    .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$12)
    4942            $C$DW$T$13      .dwtag  DW_TAG_base_type
    4943                    .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4944                    .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4945                    .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    4946            $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("UINT32")
    4947                    .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    4948                    .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    4949            $C$DW$T$165     .dwtag  DW_TAG_const_type
    4950                    .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$25)
    4951            $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    4952                    .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    4953                    .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    4954            $C$DW$T$166     .dwtag  DW_TAG_const_type
    4955                    .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$26)
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0500410                            PAGE  100

    4956            $C$DW$T$14      .dwtag  DW_TAG_base_type
    4957                    .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4958                    .dwattr $C$DW$T$14, DW_AT_name("long long")
    4959                    .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    4960            $C$DW$T$15      .dwtag  DW_TAG_base_type
    4961                    .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4962                    .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4963                    .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    4964            $C$DW$T$16      .dwtag  DW_TAG_base_type
    4965                    .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4966                    .dwattr $C$DW$T$16, DW_AT_name("float")
    4967                    .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    4968            $C$DW$T$17      .dwtag  DW_TAG_base_type
    4969                    .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4970                    .dwattr $C$DW$T$17, DW_AT_name("double")
    4971                    .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    4972            $C$DW$T$18      .dwtag  DW_TAG_base_type
    4973                    .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4974                    .dwattr $C$DW$T$18, DW_AT_name("long double")
    4975                    .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    4976            $C$DW$T$22      .dwtag  DW_TAG_base_type
    4977                    .dwattr $C$DW$T$22, DW_AT_encoding(DW_ATE_unsigned_char)
    4978                    .dwattr $C$DW$T$22, DW_AT_name("unsigned char")
    4979                    .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    4980            $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CHAR")
    4981                    .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
    4982                    .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    4983            $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    4984                    .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    4985                    .dwattr $C$DW$T$24, DW_AT_address_class(0x10)
    4986            
    4987            $C$DW$T$27      .dwtag  DW_TAG_subroutine_type
    4988                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    4989                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4990            $C$DW$436       .dwtag  DW_TAG_formal_parameter
    4991                    .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$26)
    4992                    .dwendtag $C$DW$T$27
    4993            
    4994            $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    4995                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    4996                    .dwattr $C$DW$T$28, DW_AT_address_class(0x14)
    4997            $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("tBootLoaderPatches")
    4998                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    4999                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    5000            $C$DW$T$174     .dwtag  DW_TAG_const_type
    5001                    .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$31)
    5002            $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("tDriverPatches")
    5003                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$28)
    5004                    .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    5005            $C$DW$T$175     .dwtag  DW_TAG_const_type
    5006                    .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$30)
    5007            $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("tFWPatches")
    5008                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    5009                    .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    5010            $C$DW$T$176     .dwtag  DW_TAG_const_type
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0500410                            PAGE  101

    5011                    .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$29)
    5012            $C$DW$T$177     .dwtag  DW_TAG_const_type
    5013                    .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$24)
    5014            
    5015            $C$DW$T$50      .dwtag  DW_TAG_array_type
    5016                    .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$23)
    5017                    .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    5018                    .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    5019            $C$DW$437       .dwtag  DW_TAG_subrange_type
    5020                    .dwattr $C$DW$437, DW_AT_upper_bound(0x07)
    5021                    .dwendtag $C$DW$T$50
    5022            
    5023            $C$DW$T$119     .dwtag  DW_TAG_const_type
    5024                    .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$22)
    5025            $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    5026                    .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    5027                    .dwattr $C$DW$T$120, DW_AT_address_class(0x10)
    5028            $C$DW$T$178     .dwtag  DW_TAG_pointer_type
    5029                    .dwattr $C$DW$T$178, DW_AT_type(*$C$DW$T$22)
    5030                    .dwattr $C$DW$T$178, DW_AT_address_class(0x10)
    5031            
    5032            $C$DW$T$180     .dwtag  DW_TAG_array_type
    5033                    .dwattr $C$DW$T$180, DW_AT_type(*$C$DW$T$22)
    5034                    .dwattr $C$DW$T$180, DW_AT_language(DW_LANG_C)
    5035                    .dwattr $C$DW$T$180, DW_AT_byte_size(0x0f)
    5036            $C$DW$438       .dwtag  DW_TAG_subrange_type
    5037                    .dwattr $C$DW$438, DW_AT_upper_bound(0x0e)
    5038                    .dwendtag $C$DW$T$180
    5039            
    5040            
    5041            $C$DW$T$47      .dwtag  DW_TAG_structure_type
    5042                    .dwattr $C$DW$T$47, DW_AT_name("_in_addr_t")
    5043                    .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    5044            $C$DW$439       .dwtag  DW_TAG_member
    5045                    .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$25)
    5046                    .dwattr $C$DW$439, DW_AT_name("s_addr")
    5047                    .dwattr $C$DW$439, DW_AT_TI_symbol_name("s_addr")
    5048                    .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5049                    .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    5050                    .dwendtag $C$DW$T$47
    5051            
    5052            $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("in_addr")
    5053                    .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$47)
    5054                    .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    5055            
    5056            $C$DW$T$51      .dwtag  DW_TAG_structure_type
    5057                    .dwattr $C$DW$T$51, DW_AT_name("_sockaddr_in_t")
    5058                    .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    5059            $C$DW$440       .dwtag  DW_TAG_member
    5060                    .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$48)
    5061                    .dwattr $C$DW$440, DW_AT_name("sin_family")
    5062                    .dwattr $C$DW$440, DW_AT_TI_symbol_name("sin_family")
    5063                    .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5064                    .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    5065            $C$DW$441       .dwtag  DW_TAG_member
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0500410                            PAGE  102

    5066                    .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$19)
    5067                    .dwattr $C$DW$441, DW_AT_name("sin_port")
    5068                    .dwattr $C$DW$441, DW_AT_TI_symbol_name("sin_port")
    5069                    .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5070                    .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    5071            $C$DW$442       .dwtag  DW_TAG_member
    5072                    .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$49)
    5073                    .dwattr $C$DW$442, DW_AT_name("sin_addr")
    5074                    .dwattr $C$DW$442, DW_AT_TI_symbol_name("sin_addr")
    5075                    .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5076                    .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    5077            $C$DW$443       .dwtag  DW_TAG_member
    5078                    .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$50)
    5079                    .dwattr $C$DW$443, DW_AT_name("sin_zero")
    5080                    .dwattr $C$DW$443, DW_AT_TI_symbol_name("sin_zero")
    5081                    .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5082                    .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    5083                    .dwendtag $C$DW$T$51
    5084            
    5085            $C$DW$T$182     .dwtag  DW_TAG_typedef, DW_AT_name("sockaddr_in")
    5086                    .dwattr $C$DW$T$182, DW_AT_type(*$C$DW$T$51)
    5087                    .dwattr $C$DW$T$182, DW_AT_language(DW_LANG_C)
    5088            
    5089            $C$DW$T$53      .dwtag  DW_TAG_structure_type
    5090                    .dwattr $C$DW$T$53, DW_AT_name("_sockaddr_t")
    5091                    .dwattr $C$DW$T$53, DW_AT_byte_size(0x10)
    5092            $C$DW$444       .dwtag  DW_TAG_member
    5093                    .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$19)
    5094                    .dwattr $C$DW$444, DW_AT_name("sa_family")
    5095                    .dwattr $C$DW$444, DW_AT_TI_symbol_name("sa_family")
    5096                    .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5097                    .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    5098            $C$DW$445       .dwtag  DW_TAG_member
    5099                    .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$52)
    5100                    .dwattr $C$DW$445, DW_AT_name("sa_data")
    5101                    .dwattr $C$DW$445, DW_AT_TI_symbol_name("sa_data")
    5102                    .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5103                    .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    5104                    .dwendtag $C$DW$T$53
    5105            
    5106            $C$DW$T$130     .dwtag  DW_TAG_typedef, DW_AT_name("sockaddr")
    5107                    .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$53)
    5108                    .dwattr $C$DW$T$130, DW_AT_language(DW_LANG_C)
    5109            $C$DW$T$131     .dwtag  DW_TAG_const_type
    5110                    .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$130)
    5111            $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    5112                    .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$131)
    5113                    .dwattr $C$DW$T$132, DW_AT_address_class(0x10)
    5114                    .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    5115            
    5116            ;***************************************************************
    5117            ;* DWARF CIE ENTRIES                                           *
    5118            ;***************************************************************
    5119            
    5120            $C$DW$CIE       .dwcie 16
MSP430 Assembler PC v4.1.9 Tue Mar 25 16:18:27 2014

Tools Copyright (c) 2003-2014 Texas Instruments Incorporated
C:\Users\Lucas\AppData\Local\Temp\0500410                            PAGE  103

    5121                    .dwcfi  cfa_register, 1
    5122                    .dwcfi  cfa_offset, 0
    5123                    .dwcfi  undefined, 0
    5124                    .dwcfi  undefined, 1
    5125                    .dwcfi  undefined, 2
    5126                    .dwcfi  undefined, 3
    5127                    .dwcfi  same_value, 4
    5128                    .dwcfi  same_value, 5
    5129                    .dwcfi  same_value, 6
    5130                    .dwcfi  same_value, 7
    5131                    .dwcfi  same_value, 8
    5132                    .dwcfi  same_value, 9
    5133                    .dwcfi  same_value, 10
    5134                    .dwcfi  undefined, 11
    5135                    .dwcfi  undefined, 12
    5136                    .dwcfi  undefined, 13
    5137                    .dwcfi  undefined, 14
    5138                    .dwcfi  undefined, 15
    5139                    .dwcfi  undefined, 16
    5140                    .dwendentry
    5141            
    5142            ;***************************************************************
    5143            ;* DWARF REGISTER MAP                                          *
    5144            ;***************************************************************
    5145            
    5146            $C$DW$446       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("PC")
    5147                    .dwattr $C$DW$446, DW_AT_location[DW_OP_reg0]
    5148            $C$DW$447       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SP")
    5149                    .dwattr $C$DW$447, DW_AT_location[DW_OP_reg1]
    5150            $C$DW$448       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SR")
    5151                    .dwattr $C$DW$448, DW_AT_location[DW_OP_reg2]
    5152            $C$DW$449       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("CG")
    5153                    .dwattr $C$DW$449, DW_AT_location[DW_OP_reg3]
    5154            $C$DW$450       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r4")
    5155                    .dwattr $C$DW$450, DW_AT_location[DW_OP_reg4]
    5156            $C$DW$451       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r5")
    5157                    .dwattr $C$DW$451, DW_AT_location[DW_OP_reg5]
    5158            $C$DW$452       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r6")
    5159                    .dwattr $C$DW$452, DW_AT_location[DW_OP_reg6]
    5160            $C$DW$453       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r7")
    5161                    .dwattr $C$DW$453, DW_AT_location[DW_OP_reg7]
