MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:39 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0188810                         PAGE    1

       1            ;******************************************************************************
       2            ;* MSP430 C/C++ Codegen                                             PC v4.2.1 *
       3            ;* Date/Time created: Fri Mar 21 13:42:39 2014                                *
       4            ;******************************************************************************
       5                    .compiler_opts --abi=coffabi --hll_source=on --mem_model:code=large --mem_model:data=small --o
       6            
       7            $C$DW$CU        .dwtag  DW_TAG_compile_unit
       8                    .dwattr $C$DW$CU, DW_AT_name("C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltmeter/Bas
       9                    .dwattr $C$DW$CU, DW_AT_producer("MSP430 C/C++ Codegen PC v4.2.1 Copyright (c) 2003-2013 Texas
      10                    .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11                    .dwattr $C$DW$CU, DW_AT_comp_dir("C:\Users\409010855\Documents\GitHub\CHARM\Embedded_Voltmeter
      12            
      13            $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__builtin_strlen")
      14                    .dwattr $C$DW$1, DW_AT_TI_symbol_name("__builtin_strlen")

    3990 00004a 01CE          MOVA      SP,r14                ; [] |155| 
    3991 00004c 503E          ADD.W     #26,r14               ; [] |155| 
         00004e 001A 
    3992 000050 4E81          MOV.W     r14,4(SP)             ; [] |155| 
         000052 0004 
    3993 000054 4C0E          MOV.W     r12,r14               ; [] |155| 
    3994 000056 0E71          MOVX.A    r14,6(SP)             ; [] |155| 
         000058 0006 
    3995 00005a 430C          MOV.W     #0,r12                ; [] |155| 
    3996 00005c 430D          MOV.W     #0,r13                ; [] |155| 
    3997 00005e 01CE          MOVA      SP,r14                ; [] |155| 
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:39 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0188810                         PAGE   82

    3998 000060 503E          ADD.W     #10,r14               ; [] |155| 
         000062 000A 
    3999            $C$DW$338       .dwtag  DW_TAG_TI_branch
    4000                    .dwattr $C$DW$338, DW_AT_low_pc(0x00)
    4001                    .dwattr $C$DW$338, DW_AT_name("wlan_connect")
    4002                    .dwattr $C$DW$338, DW_AT_TI_call
    4003 000064 13B0!         CALLA     #wlan_connect         ; [] |155| 
         000066 0000 
    4004                                                      ; [] |155| 
    4005 000068 5031          ADD.W     #42,SP                ; [] 
         00006a 002A 
    4006                    .dwcfi  cfa_offset, 8
    4007 00006c 160A          POPM.A    #1,r10                ; [] 
    4008                    .dwcfi  restore_reg, 10
    4009                    .dwcfi  cfa_offset, 4
    4010            $C$DW$339       .dwtag  DW_TAG_TI_branch
    4011                    .dwattr $C$DW$339, DW_AT_low_pc(0x00)
    4012                    .dwattr $C$DW$339, DW_AT_TI_return
    4013 00006e 0110          RETA      ; [] 
    4014                    ; [] 
    4015                    .dwattr $C$DW$329, DW_AT_TI_end_file("C:/Users/409010855/Documents/GitHub/CHARM/Embedded_Voltm
    4016                    .dwattr $C$DW$329, DW_AT_TI_end_line(0x9c)
    4017                    .dwattr $C$DW$329, DW_AT_TI_end_column(0x01)
    4018                    .dwendentry
    4019                    .dwendtag $C$DW$329
    4020            
    4021            ;******************************************************************************
    4022            ;* STRINGS                                                                    *
    4023            ;******************************************************************************
    4024 000000               .sect   ".const:.string"
    4025                    .align  2
    4026 000000 0054  $C$SL1: .string "TP-LINK_4C3E00",0
         000001 0050 
         000002 002D 
         000003 004C 
         000004 0049 
         000005 004E 
         000006 004B 
         000007 005F 
         000008 0034 
         000009 0043 
         00000a 0033 
         00000b 0045 
         00000c 0030 
         00000d 0030 
         00000e 0000 
    4027                    .align  2
    4028 000010 0061  $C$SL2: .string "ab123456",0
         000011 0062 
         000012 0031 
         000013 0032 
         000014 0033 
         000015 0034 
         000016 0035 
         000017 0036 
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:39 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0188810                         PAGE   83

         000018 0000 
    4029            ;*****************************************************************************
    4030            ;* UNDEFINED EXTERNAL REFERENCES                                             *
    4031            ;*****************************************************************************
    4032                    .global strlen
    4033                    .global memset
    4034                    .global SimpleLinkWaitEvent
    4035                    .global UINT32_TO_STREAM_f
    4036                    .global UINT16_TO_STREAM_f
    4037                    .global hci_command_send
    4038                    .global SpiOpen
    4039                    .global SpiClose
    4040                    .global socket
    4041                    .global inet_aton
    4042                    .global connect
    4043                    .global nvmem_read
    4044                    .global aes_decrypt
    4045                    .global aes_read_key
    4046                    .global hci_unsolicited_event_handler
    4047                    .global _Errno
    4048                    .global wlan_tx_buffer
    4049                    .global ulSocket
    4050                    .global __mpyi
    4051                    .global memcpy
    4052            
    4053            ;******************************************************************************
    4054            ;* BUILD ATTRIBUTES                                                           *
    4055            ;******************************************************************************
    4056                    .battr "TI", Tag_File, 1, Tag_ABI_enum_size(3)
    4057            
    4058            ;******************************************************************************
    4059            ;* TYPE INFORMATION                                                           *
    4060            ;******************************************************************************
    4061            
    4062            $C$DW$T$46      .dwtag  DW_TAG_structure_type
    4063                    .dwattr $C$DW$T$46, DW_AT_byte_size(0x3e)
    4064            $C$DW$340       .dwtag  DW_TAG_member
    4065                    .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    4066                    .dwattr $C$DW$340, DW_AT_name("usRxEventOpcode")
    4067                    .dwattr $C$DW$340, DW_AT_TI_symbol_name("usRxEventOpcode")
    4068                    .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4069                    .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    4070            $C$DW$341       .dwtag  DW_TAG_member
    4071                    .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
    4072                    .dwattr $C$DW$341, DW_AT_name("usEventOrDataReceived")
    4073                    .dwattr $C$DW$341, DW_AT_TI_symbol_name("usEventOrDataReceived")
    4074                    .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4075                    .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    4076            $C$DW$342       .dwtag  DW_TAG_member
    4077                    .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$21)
    4078                    .dwattr $C$DW$342, DW_AT_name("pucReceivedData")
    4079                    .dwattr $C$DW$342, DW_AT_TI_symbol_name("pucReceivedData")
    4080                    .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4081                    .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    4082            $C$DW$343       .dwtag  DW_TAG_member
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:39 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0188810                         PAGE   84

    4083                    .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$21)
    4084                    .dwattr $C$DW$343, DW_AT_name("pucTxCommandBuffer")
    4085                    .dwattr $C$DW$343, DW_AT_TI_symbol_name("pucTxCommandBuffer")
    4086                    .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4087                    .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    4088            $C$DW$344       .dwtag  DW_TAG_member
    4089                    .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$29)
    4090                    .dwattr $C$DW$344, DW_AT_name("sFWPatches")
    4091                    .dwattr $C$DW$344, DW_AT_TI_symbol_name("sFWPatches")
    4092                    .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4093                    .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    4094            $C$DW$345       .dwtag  DW_TAG_member
    4095                    .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$30)
    4096                    .dwattr $C$DW$345, DW_AT_name("sDriverPatches")
    4097                    .dwattr $C$DW$345, DW_AT_TI_symbol_name("sDriverPatches")
    4098                    .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4099                    .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4100            $C$DW$346       .dwtag  DW_TAG_member
    4101                    .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$31)
    4102                    .dwattr $C$DW$346, DW_AT_name("sBootLoaderPatches")
    4103                    .dwattr $C$DW$346, DW_AT_TI_symbol_name("sBootLoaderPatches")
    4104                    .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4105                    .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4106            $C$DW$347       .dwtag  DW_TAG_member
    4107                    .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$35)
    4108                    .dwattr $C$DW$347, DW_AT_name("sWlanCB")
    4109                    .dwattr $C$DW$347, DW_AT_TI_symbol_name("sWlanCB")
    4110                    .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4111                    .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4112            $C$DW$348       .dwtag  DW_TAG_member
    4113                    .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$38)
    4114                    .dwattr $C$DW$348, DW_AT_name("ReadWlanInterruptPin")
    4115                    .dwattr $C$DW$348, DW_AT_TI_symbol_name("ReadWlanInterruptPin")
    4116                    .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4117                    .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4118            $C$DW$349       .dwtag  DW_TAG_member
    4119                    .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$41)
    4120                    .dwattr $C$DW$349, DW_AT_name("WlanInterruptEnable")
    4121                    .dwattr $C$DW$349, DW_AT_TI_symbol_name("WlanInterruptEnable")
    4122                    .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4123                    .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4124            $C$DW$350       .dwtag  DW_TAG_member
    4125                    .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$42)
    4126                    .dwattr $C$DW$350, DW_AT_name("WlanInterruptDisable")
    4127                    .dwattr $C$DW$350, DW_AT_TI_symbol_name("WlanInterruptDisable")
    4128                    .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4129                    .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4130            $C$DW$351       .dwtag  DW_TAG_member
    4131                    .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$45)
    4132                    .dwattr $C$DW$351, DW_AT_name("WriteWlanPin")
    4133                    .dwattr $C$DW$351, DW_AT_TI_symbol_name("WriteWlanPin")
    4134                    .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4135                    .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4136            $C$DW$352       .dwtag  DW_TAG_member
    4137                    .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$32)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:39 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0188810                         PAGE   85

    4138                    .dwattr $C$DW$352, DW_AT_name("slTransmitDataError")
    4139                    .dwattr $C$DW$352, DW_AT_TI_symbol_name("slTransmitDataError")
    4140                    .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4141                    .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4142            $C$DW$353       .dwtag  DW_TAG_member
    4143                    .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$19)
    4144                    .dwattr $C$DW$353, DW_AT_name("usNumberOfFreeBuffers")
    4145                    .dwattr $C$DW$353, DW_AT_TI_symbol_name("usNumberOfFreeBuffers")
    4146                    .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4147                    .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4148            $C$DW$354       .dwtag  DW_TAG_member
    4149                    .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
    4150                    .dwattr $C$DW$354, DW_AT_name("usSlBufferLength")
    4151                    .dwattr $C$DW$354, DW_AT_TI_symbol_name("usSlBufferLength")
    4152                    .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4153                    .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4154            $C$DW$355       .dwtag  DW_TAG_member
    4155                    .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$19)
    4156                    .dwattr $C$DW$355, DW_AT_name("usBufferSize")
    4157                    .dwattr $C$DW$355, DW_AT_TI_symbol_name("usBufferSize")
    4158                    .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    4159                    .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4160            $C$DW$356       .dwtag  DW_TAG_member
    4161                    .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$19)
    4162                    .dwattr $C$DW$356, DW_AT_name("usRxDataPending")
    4163                    .dwattr $C$DW$356, DW_AT_TI_symbol_name("usRxDataPending")
    4164                    .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    4165                    .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4166            $C$DW$357       .dwtag  DW_TAG_member
    4167                    .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$25)
    4168                    .dwattr $C$DW$357, DW_AT_name("NumberOfSentPackets")
    4169                    .dwattr $C$DW$357, DW_AT_TI_symbol_name("NumberOfSentPackets")
    4170                    .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4171                    .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4172            $C$DW$358       .dwtag  DW_TAG_member
    4173                    .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$25)
    4174                    .dwattr $C$DW$358, DW_AT_name("NumberOfReleasedPackets")
    4175                    .dwattr $C$DW$358, DW_AT_TI_symbol_name("NumberOfReleasedPackets")
    4176                    .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    4177                    .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4178            $C$DW$359       .dwtag  DW_TAG_member
    4179                    .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$20)
    4180                    .dwattr $C$DW$359, DW_AT_name("InformHostOnTxComplete")
    4181                    .dwattr $C$DW$359, DW_AT_TI_symbol_name("InformHostOnTxComplete")
    4182                    .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4183                    .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4184                    .dwendtag $C$DW$T$46
    4185            
    4186            $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("sSimplLinkInformation")
    4187                    .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$46)
    4188                    .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    4189            $C$DW$T$56      .dwtag  DW_TAG_volatile_type
    4190                    .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    4191            $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4192                    .dwattr $C$DW$T$3, DW_AT_address_class(0x10)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:39 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0188810                         PAGE   86

    4193            $C$DW$T$60      .dwtag  DW_TAG_const_type
    4194                    .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$3)
    4195            
    4196            $C$DW$T$33      .dwtag  DW_TAG_subroutine_type
    4197                    .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4198            $C$DW$360       .dwtag  DW_TAG_formal_parameter
    4199                    .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$32)
    4200            $C$DW$361       .dwtag  DW_TAG_formal_parameter
    4201                    .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$24)
    4202            $C$DW$362       .dwtag  DW_TAG_formal_parameter
    4203                    .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$20)
    4204                    .dwendtag $C$DW$T$33
    4205            
    4206            $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4207                    .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4208                    .dwattr $C$DW$T$34, DW_AT_address_class(0x14)
    4209            $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanCB")
    4210                    .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    4211                    .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4212            $C$DW$T$63      .dwtag  DW_TAG_const_type
    4213                    .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$35)
    4214            
    4215            $C$DW$T$39      .dwtag  DW_TAG_subroutine_type
    4216                    .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4217            $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    4218                    .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    4219                    .dwattr $C$DW$T$40, DW_AT_address_class(0x14)
    4220            $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptDisable")
    4221                    .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    4222                    .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4223            $C$DW$T$66      .dwtag  DW_TAG_const_type
    4224                    .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$42)
    4225            $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanInterruptEnable")
    4226                    .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    4227                    .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4228            $C$DW$T$67      .dwtag  DW_TAG_const_type
    4229                    .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$41)
    4230            
    4231            $C$DW$T$43      .dwtag  DW_TAG_subroutine_type
    4232                    .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    4233            $C$DW$363       .dwtag  DW_TAG_formal_parameter
    4234                    .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$20)
    4235                    .dwendtag $C$DW$T$43
    4236            
    4237            $C$DW$T$44      .dwtag  DW_TAG_pointer_type
    4238                    .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    4239                    .dwattr $C$DW$T$44, DW_AT_address_class(0x14)
    4240            $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("tWriteWlanPin")
    4241                    .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    4242                    .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4243            $C$DW$T$70      .dwtag  DW_TAG_const_type
    4244                    .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$45)
    4245            
    4246            $C$DW$T$73      .dwtag  DW_TAG_subroutine_type
    4247                    .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:39 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0188810                         PAGE   87

    4248            $C$DW$364       .dwtag  DW_TAG_formal_parameter
    4249                    .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$3)
    4250                    .dwendtag $C$DW$T$73
    4251            
    4252            $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    4253                    .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    4254                    .dwattr $C$DW$T$74, DW_AT_address_class(0x14)
    4255            $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("gcSpiHandleRx")
    4256                    .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    4257                    .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4258            $C$DW$T$4       .dwtag  DW_TAG_base_type
    4259                    .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4260                    .dwattr $C$DW$T$4, DW_AT_name("bool")
    4261                    .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4262            $C$DW$T$5       .dwtag  DW_TAG_base_type
    4263                    .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4264                    .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4265                    .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4266            $C$DW$T$6       .dwtag  DW_TAG_base_type
    4267                    .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4268                    .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4269                    .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4270            $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("UINT8")
    4271                    .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    4272                    .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4273            $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    4274                    .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    4275                    .dwattr $C$DW$T$21, DW_AT_address_class(0x10)
    4276            $C$DW$T$84      .dwtag  DW_TAG_const_type
    4277                    .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$21)
    4278            
    4279            $C$DW$T$52      .dwtag  DW_TAG_array_type
    4280                    .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$20)
    4281                    .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4282                    .dwattr $C$DW$T$52, DW_AT_byte_size(0x0e)
    4283            $C$DW$365       .dwtag  DW_TAG_subrange_type
    4284                    .dwattr $C$DW$365, DW_AT_upper_bound(0x0d)
    4285                    .dwendtag $C$DW$T$52
    4286            
    4287            
    4288            $C$DW$T$85      .dwtag  DW_TAG_array_type
    4289                    .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$20)
    4290                    .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    4291                    .dwattr $C$DW$T$85, DW_AT_byte_size(0x10)
    4292            $C$DW$366       .dwtag  DW_TAG_subrange_type
    4293                    .dwattr $C$DW$366, DW_AT_upper_bound(0x0f)
    4294                    .dwendtag $C$DW$T$85
    4295            
    4296            
    4297            $C$DW$T$86      .dwtag  DW_TAG_array_type
    4298                    .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$20)
    4299                    .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    4300                    .dwattr $C$DW$T$86, DW_AT_byte_size(0x43)
    4301            $C$DW$367       .dwtag  DW_TAG_subrange_type
    4302                    .dwattr $C$DW$367, DW_AT_upper_bound(0x42)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:39 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0188810                         PAGE   88

    4303                    .dwendtag $C$DW$T$86
    4304            
    4305            
    4306            $C$DW$T$87      .dwtag  DW_TAG_array_type
    4307                    .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$20)
    4308                    .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4309                    .dwattr $C$DW$T$87, DW_AT_byte_size(0x06)
    4310            $C$DW$368       .dwtag  DW_TAG_subrange_type
    4311                    .dwattr $C$DW$368, DW_AT_upper_bound(0x05)
    4312                    .dwendtag $C$DW$T$87
    4313            
    4314            $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    4315                    .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$6)
    4316                    .dwattr $C$DW$T$88, DW_AT_address_class(0x10)
    4317            
    4318            $C$DW$T$99      .dwtag  DW_TAG_array_type
    4319                    .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$6)
    4320                    .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    4321            $C$DW$369       .dwtag  DW_TAG_subrange_type
    4322                    .dwendtag $C$DW$T$99
    4323            
    4324            
    4325            $C$DW$T$100     .dwtag  DW_TAG_array_type
    4326                    .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$6)
    4327                    .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    4328                    .dwattr $C$DW$T$100, DW_AT_byte_size(0x04)
    4329            $C$DW$370       .dwtag  DW_TAG_subrange_type
    4330                    .dwattr $C$DW$370, DW_AT_upper_bound(0x03)
    4331                    .dwendtag $C$DW$T$100
    4332            
    4333            $C$DW$T$101     .dwtag  DW_TAG_const_type
    4334                    .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$6)
    4335            
    4336            $C$DW$T$102     .dwtag  DW_TAG_array_type
    4337                    .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    4338                    .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    4339                    .dwattr $C$DW$T$102, DW_AT_byte_size(0x04)
    4340            $C$DW$371       .dwtag  DW_TAG_subrange_type
    4341                    .dwattr $C$DW$371, DW_AT_upper_bound(0x03)
    4342                    .dwendtag $C$DW$T$102
    4343            
    4344            $C$DW$T$7       .dwtag  DW_TAG_base_type
    4345                    .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4346                    .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4347                    .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4348            $C$DW$T$8       .dwtag  DW_TAG_base_type
    4349                    .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4350                    .dwattr $C$DW$T$8, DW_AT_name("short")
    4351                    .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    4352            $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("INT16")
    4353                    .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$8)
    4354                    .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4355            $C$DW$T$9       .dwtag  DW_TAG_base_type
    4356                    .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4357                    .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:39 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0188810                         PAGE   89

    4358                    .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    4359            $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("UINT16")
    4360                    .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$9)
    4361                    .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4362            $C$DW$T$113     .dwtag  DW_TAG_const_type
    4363                    .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$19)
    4364            $C$DW$T$10      .dwtag  DW_TAG_base_type
    4365                    .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4366                    .dwattr $C$DW$T$10, DW_AT_name("int")
    4367                    .dwattr $C$DW$T$10, DW_AT_byte_size(0x02)
    4368            $C$DW$T$11      .dwtag  DW_TAG_base_type
    4369                    .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4370                    .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4371                    .dwattr $C$DW$T$11, DW_AT_byte_size(0x02)
    4372            $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    4373                    .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$11)
    4374                    .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    4375            $C$DW$T$12      .dwtag  DW_TAG_base_type
    4376                    .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4377                    .dwattr $C$DW$T$12, DW_AT_name("long")
    4378                    .dwattr $C$DW$T$12, DW_AT_byte_size(0x04)
    4379            $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("INT32")
    4380                    .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$12)
    4381                    .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    4382            $C$DW$T$127     .dwtag  DW_TAG_const_type
    4383                    .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$32)
    4384            
    4385            $C$DW$T$36      .dwtag  DW_TAG_subroutine_type
    4386                    .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$32)
    4387                    .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4388            $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    4389                    .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    4390                    .dwattr $C$DW$T$37, DW_AT_address_class(0x14)
    4391            $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("tWlanReadInteruptPin")
    4392                    .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    4393                    .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4394            $C$DW$T$128     .dwtag  DW_TAG_const_type
    4395                    .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$38)
    4396            $C$DW$T$142     .dwtag  DW_TAG_volatile_type
    4397                    .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$12)
    4398            $C$DW$T$13      .dwtag  DW_TAG_base_type
    4399                    .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4400                    .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4401                    .dwattr $C$DW$T$13, DW_AT_byte_size(0x04)
    4402            $C$DW$T$25      .dwtag  DW_TAG_typedef, DW_AT_name("UINT32")
    4403                    .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
    4404                    .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    4405            $C$DW$T$164     .dwtag  DW_TAG_const_type
    4406                    .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$25)
    4407            $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    4408                    .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
    4409                    .dwattr $C$DW$T$26, DW_AT_address_class(0x10)
    4410            $C$DW$T$165     .dwtag  DW_TAG_const_type
    4411                    .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$26)
    4412            $C$DW$T$14      .dwtag  DW_TAG_base_type
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:39 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0188810                         PAGE   90

    4413                    .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4414                    .dwattr $C$DW$T$14, DW_AT_name("long long")
    4415                    .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    4416            $C$DW$T$15      .dwtag  DW_TAG_base_type
    4417                    .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4418                    .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4419                    .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    4420            $C$DW$T$16      .dwtag  DW_TAG_base_type
    4421                    .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4422                    .dwattr $C$DW$T$16, DW_AT_name("float")
    4423                    .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    4424            $C$DW$T$17      .dwtag  DW_TAG_base_type
    4425                    .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4426                    .dwattr $C$DW$T$17, DW_AT_name("double")
    4427                    .dwattr $C$DW$T$17, DW_AT_byte_size(0x04)
    4428            $C$DW$T$18      .dwtag  DW_TAG_base_type
    4429                    .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4430                    .dwattr $C$DW$T$18, DW_AT_name("long double")
    4431                    .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    4432            $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("CHAR")
    4433                    .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$6)
    4434                    .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    4435            $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    4436                    .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    4437                    .dwattr $C$DW$T$24, DW_AT_address_class(0x10)
    4438            
    4439            $C$DW$T$27      .dwtag  DW_TAG_subroutine_type
    4440                    .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$24)
    4441                    .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4442            $C$DW$372       .dwtag  DW_TAG_formal_parameter
    4443                    .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$26)
    4444                    .dwendtag $C$DW$T$27
    4445            
    4446            $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    4447                    .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    4448                    .dwattr $C$DW$T$28, DW_AT_address_class(0x14)
    4449            $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("tBootLoaderPatches")
    4450                    .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$28)
    4451                    .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    4452            $C$DW$T$173     .dwtag  DW_TAG_const_type
    4453                    .dwattr $C$DW$T$173, DW_AT_type(*$C$DW$T$31)
    4454            $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("tDriverPatches")
    4455                    .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$28)
    4456                    .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    4457            $C$DW$T$174     .dwtag  DW_TAG_const_type
    4458                    .dwattr $C$DW$T$174, DW_AT_type(*$C$DW$T$30)
    4459            $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("tFWPatches")
    4460                    .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    4461                    .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4462            $C$DW$T$175     .dwtag  DW_TAG_const_type
    4463                    .dwattr $C$DW$T$175, DW_AT_type(*$C$DW$T$29)
    4464            $C$DW$T$176     .dwtag  DW_TAG_const_type
    4465                    .dwattr $C$DW$T$176, DW_AT_type(*$C$DW$T$24)
    4466            
    4467            $C$DW$T$50      .dwtag  DW_TAG_array_type
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:39 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0188810                         PAGE   91

    4468                    .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$23)
    4469                    .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4470                    .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    4471            $C$DW$373       .dwtag  DW_TAG_subrange_type
    4472                    .dwattr $C$DW$373, DW_AT_upper_bound(0x07)
    4473                    .dwendtag $C$DW$T$50
    4474            
    4475            $C$DW$T$118     .dwtag  DW_TAG_const_type
    4476                    .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$6)
    4477            $C$DW$T$119     .dwtag  DW_TAG_pointer_type
    4478                    .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    4479                    .dwattr $C$DW$T$119, DW_AT_address_class(0x10)
    4480            $C$DW$T$177     .dwtag  DW_TAG_pointer_type
    4481                    .dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$6)
    4482                    .dwattr $C$DW$T$177, DW_AT_address_class(0x10)
    4483            
    4484            $C$DW$T$179     .dwtag  DW_TAG_array_type
    4485                    .dwattr $C$DW$T$179, DW_AT_type(*$C$DW$T$6)
    4486                    .dwattr $C$DW$T$179, DW_AT_language(DW_LANG_C)
    4487                    .dwattr $C$DW$T$179, DW_AT_byte_size(0x0f)
    4488            $C$DW$374       .dwtag  DW_TAG_subrange_type
    4489                    .dwattr $C$DW$374, DW_AT_upper_bound(0x0e)
    4490                    .dwendtag $C$DW$T$179
    4491            
    4492            
    4493            $C$DW$T$47      .dwtag  DW_TAG_structure_type
    4494                    .dwattr $C$DW$T$47, DW_AT_name("_in_addr_t")
    4495                    .dwattr $C$DW$T$47, DW_AT_byte_size(0x04)
    4496            $C$DW$375       .dwtag  DW_TAG_member
    4497                    .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$25)
    4498                    .dwattr $C$DW$375, DW_AT_name("s_addr")
    4499                    .dwattr $C$DW$375, DW_AT_TI_symbol_name("s_addr")
    4500                    .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4501                    .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4502                    .dwendtag $C$DW$T$47
    4503            
    4504            $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("in_addr")
    4505                    .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$47)
    4506                    .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4507            
    4508            $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4509                    .dwattr $C$DW$T$51, DW_AT_name("_sockaddr_in_t")
    4510                    .dwattr $C$DW$T$51, DW_AT_byte_size(0x10)
    4511            $C$DW$376       .dwtag  DW_TAG_member
    4512                    .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$48)
    4513                    .dwattr $C$DW$376, DW_AT_name("sin_family")
    4514                    .dwattr $C$DW$376, DW_AT_TI_symbol_name("sin_family")
    4515                    .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4516                    .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4517            $C$DW$377       .dwtag  DW_TAG_member
    4518                    .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
    4519                    .dwattr $C$DW$377, DW_AT_name("sin_port")
    4520                    .dwattr $C$DW$377, DW_AT_TI_symbol_name("sin_port")
    4521                    .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4522                    .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:39 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0188810                         PAGE   92

    4523            $C$DW$378       .dwtag  DW_TAG_member
    4524                    .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$49)
    4525                    .dwattr $C$DW$378, DW_AT_name("sin_addr")
    4526                    .dwattr $C$DW$378, DW_AT_TI_symbol_name("sin_addr")
    4527                    .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4528                    .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4529            $C$DW$379       .dwtag  DW_TAG_member
    4530                    .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$50)
    4531                    .dwattr $C$DW$379, DW_AT_name("sin_zero")
    4532                    .dwattr $C$DW$379, DW_AT_TI_symbol_name("sin_zero")
    4533                    .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4534                    .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4535                    .dwendtag $C$DW$T$51
    4536            
    4537            $C$DW$T$181     .dwtag  DW_TAG_typedef, DW_AT_name("sockaddr_in")
    4538                    .dwattr $C$DW$T$181, DW_AT_type(*$C$DW$T$51)
    4539                    .dwattr $C$DW$T$181, DW_AT_language(DW_LANG_C)
    4540            
    4541            $C$DW$T$53      .dwtag  DW_TAG_structure_type
    4542                    .dwattr $C$DW$T$53, DW_AT_name("_sockaddr_t")
    4543                    .dwattr $C$DW$T$53, DW_AT_byte_size(0x10)
    4544            $C$DW$380       .dwtag  DW_TAG_member
    4545                    .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
    4546                    .dwattr $C$DW$380, DW_AT_name("sa_family")
    4547                    .dwattr $C$DW$380, DW_AT_TI_symbol_name("sa_family")
    4548                    .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4549                    .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4550            $C$DW$381       .dwtag  DW_TAG_member
    4551                    .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$52)
    4552                    .dwattr $C$DW$381, DW_AT_name("sa_data")
    4553                    .dwattr $C$DW$381, DW_AT_TI_symbol_name("sa_data")
    4554                    .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4555                    .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4556                    .dwendtag $C$DW$T$53
    4557            
    4558            $C$DW$T$129     .dwtag  DW_TAG_typedef, DW_AT_name("sockaddr")
    4559                    .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$53)
    4560                    .dwattr $C$DW$T$129, DW_AT_language(DW_LANG_C)
    4561            $C$DW$T$130     .dwtag  DW_TAG_const_type
    4562                    .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$129)
    4563            $C$DW$T$131     .dwtag  DW_TAG_pointer_type
    4564                    .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$130)
    4565                    .dwattr $C$DW$T$131, DW_AT_address_class(0x10)
    4566                    .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4567            
    4568            ;***************************************************************
    4569            ;* DWARF CIE ENTRIES                                           *
    4570            ;***************************************************************
    4571            
    4572            $C$DW$CIE       .dwcie 16
    4573                    .dwcfi  cfa_register, 1
    4574                    .dwcfi  cfa_offset, 0
    4575                    .dwcfi  undefined, 0
    4576                    .dwcfi  undefined, 1
    4577                    .dwcfi  undefined, 2
MSP430 Assembler PC v4.2.1 Fri Mar 21 13:42:39 2014

Tools Copyright (c) 2003-2013 Texas Instruments Incorporated
C:\Users\409010~1\AppData\Local\Temp\0188810                         PAGE   93

    4578                    .dwcfi  undefined, 3
    4579                    .dwcfi  same_value, 4
    4580                    .dwcfi  same_value, 5
    4581                    .dwcfi  same_value, 6
    4582                    .dwcfi  same_value, 7
    4583                    .dwcfi  same_value, 8
    4584                    .dwcfi  same_value, 9
    4585                    .dwcfi  same_value, 10
    4586                    .dwcfi  undefined, 11
    4587                    .dwcfi  undefined, 12
    4588                    .dwcfi  undefined, 13
    4589                    .dwcfi  undefined, 14
    4590                    .dwcfi  undefined, 15
    4591                    .dwcfi  undefined, 16
    4592                    .dwendentry
    4593            
    4594            ;***************************************************************
    4595            ;* DWARF REGISTER MAP                                          *
    4596            ;***************************************************************
    4597            
    4598            $C$DW$382       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("PC")
    4599                    .dwattr $C$DW$382, DW_AT_location[DW_OP_reg0]
    4600            $C$DW$383       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SP")
    4601                    .dwattr $C$DW$383, DW_AT_location[DW_OP_reg1]
    4602            $C$DW$384       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("SR")
    4603                    .dwattr $C$DW$384, DW_AT_location[DW_OP_reg2]
    4604            $C$DW$385       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("CG")
    4605                    .dwattr $C$DW$385, DW_AT_location[DW_OP_reg3]
    4606            $C$DW$386       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r4")
    4607                    .dwattr $C$DW$386, DW_AT_location[DW_OP_reg4]
    4608            $C$DW$387       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r5")
    4609                    .dwattr $C$DW$387, DW_AT_location[DW_OP_reg5]
    4610            $C$DW$388       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r6")
    4611                    .dwattr $C$DW$388, DW_AT_location[DW_OP_reg6]
    4612            $C$DW$389       .dwtag  DW_TAG_TI_assign_register, DW_AT_name("r7")
    4613                    .dwattr $C$DW$389, DW_AT_location[DW_OP_reg7]
